/**
 *  @file    reg_dsshwacc_xwr68xx.h
 *
 *  @brief
 *    This file gives register definitions of DSS_HW_ACC module.
 *
 *  This file is auto-generated on 7/30/2018.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define PARAMRAMERRLOC_PARAM_ERR_ADDR_BIT_END               15U

/* Definition for field PARAM_ERR_BIT in Register PARAMRAMERRLOC */
#define PARAMRAMERRLOC_PARAM_ERR_BIT_BIT_START              16U
#define PARAMRAMERRLOC_PARAM_ERR_BIT_BIT_END                31U

/* Definition for field IPING_ERR_ADDR in Register IPINGERRLOC */
#define IPINGERRLOC_IPING_ERR_ADDR_BIT_START                0U
#define IPINGERRLOC_IPING_ERR_ADDR_BIT_END                  15U

/* Definition for field IPING_ERR_BIT_REGION in Register IPINGERRLOC */
#define IPINGERRLOC_IPING_ERR_BIT_REGION_BIT_START          16U
#define IPINGERRLOC_IPING_ERR_BIT_REGION_BIT_END            31U

/* Definition for field IPING_ERR_BIT_LOC in Register IPINGSBELOC */
#define IPINGSBELOC_IPING_ERR_BIT_LOC_BIT_START             0U
#define IPINGSBELOC_IPING_ERR_BIT_LOC_BIT_END               31U

/* Definition for field IPONG_ERR_ADDR in Register IPONGERRLOC */
#define IPONGERRLOC_IPONG_ERR_ADDR_BIT_START                0U
#define IPONGERRLOC_IPONG_ERR_ADDR_BIT_END                  15U

/* Definition for field IPONG_ERR_BIT_REGION in Register IPONGERRLOC */
#define IPONGERRLOC_IPONG_ERR_BIT_REGION_BIT_START          16U
#define IPONGERRLOC_IPONG_ERR_BIT_REGION_BIT_END            31U

/* Definition for field IPONG_ERR_BIT_LOC in Register IPONGSBELOC */
#define IPONGSBELOC_IPONG_ERR_BIT_LOC_BIT_START             0U
#define IPONGSBELOC_IPONG_ERR_BIT_LOC_BIT_END               31U

/* Definition for field OPING_ERR_ADDR in Register OPINGERRLOC */
#define OPINGERRLOC_OPING_ERR_ADDR_BIT_START                0U
#define OPINGERRLOC_OPING_ERR_ADDR_BIT_END                  15U

/* Definition for field OPING_ERR_BIT_REGION in Register OPINGERRLOC */
#define OPINGERRLOC_OPING_ERR_BIT_REGION_BIT_START          16U
#define OPINGERRLOC_OPING_ERR_BIT_REGION_BIT_END            31U

/* Definition for field OPING_ERR_BIT_LOC in Register OPINGSBELOC */
#define OPINGSBELOC_OPING_ERR_BIT_LOC_BIT_START             0U
#define OPINGSBELOC_OPING_ERR_BIT_LOC_BIT_END               31U

/* Definition for field OPONG_ERR_ADDR in Register OPONGERRLOC */
#define OPONGERRLOC_OPONG_ERR_ADDR_BIT_START                0U
#define OPONGERRLOC_OPONG_ERR_ADDR_BIT_END                  15U

/* Definition for field OPONG_ERR_BIT_REGION in Register OPONGERRLOC */
#define OPONGERRLOC_OPONG_ERR_BIT_REGION_BIT_START          16U
#define OPONGERRLOC_OPONG_ERR_BIT_REGION_BIT_END            31U

/* Definition for field OPONG_ERR_BIT_LOC in Register OPONGSBELOC */
#define OPONGSBELOC_OPONG_ERR_BIT_LOC_BIT_START             0U
#define OPONGSBELOC_OPONG_ERR_BIT_LOC_BIT_END               31U

/** @struct hwaMaxStats
*   @brief  Hardware accelerator stats Register Definition
*
*   This structure is used to access the Hardware accelerator stats registers within the common space.
*/
/** @typedef hwaMaxStats_t
*   @brief  Hardware accelerator stats Register Definition
*
*   This structure is used to access the Hardware accelerator stats registers within the common space.
*/
typedef volatile struct hwaMaxStats
{
    uint32_t    MAXnVALUE       ;        /* AddrOffset = 0x000 */
    uint32_t    MAXnINDEX       ;        /* AddrOffset = 0x004 */
    uint32_t    ISUMnLSB        ;        /* AddrOffset = 0x008 */
    uint32_t    ISUMnMSB        ;        /* AddrOffset = 0x00C */
    uint32_t    QSUMnLSB        ;        /* AddrOffset = 0x010 */
    uint32_t    QSUMnMSB        ;        /* AddrOffset = 0x014 */
} hwaMaxStats_t;


/**
 * @struct DSSHWACCRegs_t
 * @brief
 *   Module DSS_HW_ACC Register Definition
 * @details
 *   This structure is used to access the DSS_HW_ACC module registers.
 */
/**
 * @typedef DSSHWACCRegs
 * @brief
 *   Module DSS_HW_ACC Register Frame type Definition
 * @details
 *   This type is used to access the DSS_HW_ACC module registers.
 */
typedef volatile struct DSSHWACCRegs_t
{
    uint32_t    HWACCREG1                          ;        /* Offset = 0x000 */
    uint32_t    HWACCREG2                          ;        /* Offset = 0x004 */
    uint32_t    HWACCREG3                          ;        /* Offset = 0x008 */
    uint32_t    HWACCREG4                          ;        /* Offset = 0x00C */
    uint32_t    HWACCREG5                          ;        /* Offset = 0x010 */
    uint32_t    HWACCREG6                          ;        /* Offset = 0x014 */
    uint32_t    HWACCREG7                          ;        /* Offset = 0x018 */
    uint32_t    HWACCREG8                          ;        /* Offset = 0x01C */
    uint32_t    HWACCREG9                          ;        /* Offset = 0x020 */
    uint32_t    HWACCREG10                         ;        /* Offset = 0x024 */
    uint32_t    HWACCREG11                         ;        /* Offset = 0x028 */
    uint32_t    HWACCREG12                         ;        /* Offset = 0x02C */
    uint32_t    HWACCREG13                         ;        /* Offset = 0x030 */
    uint32_t    HWACCREG14                         ;        /* Offset = 0x034 */
    uint32_t    HWACCREG15                         ;        /* Offset = 0x038 */
    uint32_t    RESTRICTED1                        ;        /* Offset = 0x03C */
#if 0    
    uint32_t    MAX1VALUE                          ;        /* Offset = 0x040 */
    uint32_t    MAX1INDEX                          ;        /* Offset = 0x044 */
    uint32_t    ISUM1LSB                           ;        /* Offset = 0x048 */
    uint32_t    ISUM1MSB                           ;        /* Offset = 0x04C */
    uint32_t    QSUM1LSB                           ;        /* Offset = 0x050 */
    uint32_t    QSUM1MSB                           ;        /* Offset = 0x054 */
    uint32_t    MAX2VALUE                          ;        /* Offset = 0x058 */
    uint32_t    MAX2INDEX                          ;        /* Offset = 0x05C */
    uint32_t    ISUM2LSB                           ;        /* Offset = 0x060 */
    uint32_t    ISUM2MSB                           ;        /* Offset = 0x064 */
    uint32_t    QSUM2LSB                           ;        /* Offset = 0x068 */
    uint32_t    QSUM2MSB                           ;        /* Offset = 0x06C */
    uint32_t    MAX3VALUE                          ;        /* Offset = 0x070 */
    uint32_t    MAX3INDEX                          ;        /* Offset = 0x074 */
    uint32_t    ISUM3LSB                           ;        /* Offset = 0x078 */
    uint32_t    ISUM3MSB                           ;        /* Offset = 0x07C */
    uint32_t    QSUM3LSB                           ;        /* Offset = 0x080 */
    uint32_t    QSUM3MSB                           ;        /* Offset = 0x084 */
    uint32_t    MAX4VALUE                          ;        /* Offset = 0x088 */
    uint32_t    MAX4INDEX                          ;        /* Offset = 0x08C */
    uint32_t    ISUM4LSB                           ;        /* Offset = 0x090 */
    uint32_t    ISUM4MSB                           ;        /* Offset = 0x094 */
    uint32_t    QSUM4LSB                           ;        /* Offset = 0x098 */
    uint32_t    QSUM4MSB                           ;        /* Offset = 0x09C */
#else
    hwaMaxStats_t HWACCSTATSREG[4];      /* AddrOffset = 0x040 - 0x09C */
#endif
    uint32_t    RESTRICTED2[3]                     ;        /* Offset = 0x0A0 */
    uint32_t    RDSTATUS                           ;        /* Offset = 0x0AC */
#if 0    
    uint32_t    SIGDMACH1DONE                      ;        /* Offset = 0x0B0 */
    uint32_t    SIGDMACH2DONE                      ;        /* Offset = 0x0B4 */
    uint32_t    SIGDMACH3DONE                      ;        /* Offset = 0x0B8 */
    uint32_t    SIGDMACH4DONE                      ;        /* Offset = 0x0BC */
    uint32_t    SIGDMACH5DONE                      ;        /* Offset = 0x0C0 */
    uint32_t    SIGDMACH6DONE                      ;        /* Offset = 0x0C4 */
    uint32_t    SIGDMACH7DONE                      ;        /* Offset = 0x0C8 */
    uint32_t    SIGDMACH8DONE                      ;        /* Offset = 0x0CC */
    uint32_t    SIGDMACH9DONE                      ;        /* Offset = 0x0D0 */
    uint32_t    SIGDMACH10DONE                     ;        /* Offset = 0x0D4 */
    uint32_t    SIGDMACH11DONE                     ;        /* Offset = 0x0D8 */
    uint32_t    SIGDMACH12DONE                     ;        /* Offset = 0x0DC */
    uint32_t    SIGDMACH13DONE                     ;        /* Offset = 0x0E0 */
    uint32_t    SIGDMACH14DONE                     ;        /* Offset = 0x0E4 */
    uint32_t    SIGDMACH15DONE                     ;        /* Offset = 0x0E8 */
    uint32_t    SIGDMACH16DONE                     ;        /* Offset = 0x0EC */
#else
    uint32_t    SIGDMACHxDONE[16];       /* AddrOffset = 0x0B0 */
#endif
    uint32_t    MEMACCESSERR                       ;        /* Offset = 0x0F0 */
    uint32_t    FFTCLIP                            ;        /* Offset = 0x0F4 */
    uint32_t    FFTPEAKCNT                         ;        /* Offset = 0x0F8 */
    uint32_t    RESTRICTED3[65]                    ;        /* Offset = 0x0FC */
    uint32_t    ECCENABLE                          ;        /* Offset = 0x200 */
    uint32_t    ECCERRCLR                          ;        /* Offset = 0x204 */
    uint32_t    MEMINIT                            ;        /* Offset = 0x208 */
    uint32_t    MEMINITDONE                        ;        /* Offset = 0x20C */
    uint32_t    ECC_SBE_STATUS                     ;        /* Offset = 0x210 */
    uint32_t    ECC_DBE_STATUS                     ;        /* Offset = 0x214 */
    uint32_t    WINRAMERRLOC                       ;        /* Offset = 0x218 */
    uint32_t    PARAMRAMERRLOC                     ;        /* Offset = 0x21C */
    uint32_t    RESTRICTED4[10]                    ;        /* Offset = 0x220 */
    uint32_t    IPINGERRLOC                        ;        /* Offset = 0x248 */
    uint32_t    IPINGSBELOC                        ;        /* Offset = 0x24C */
    uint32_t    IPONGERRLOC                        ;        /* Offset = 0x250 */
    uint32_t    IPONGSBELOC                        ;        /* Offset = 0x254 */
    uint32_t    OPINGERRLOC                        ;        /* Offset = 0x258 */
    uint32_t    OPINGSBELOC                        ;        /* Offset = 0x25C */
    uint32_t    OPONGERRLOC                        ;        /* Offset = 0x260 */
    uint32_t    OPONGSBELOC                        ;        /* Offset = 0x264 */
} DSSHWACCRegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_DSSHWACC_XWR68XX_H */
/* END OF REG_DSSHWACC_XWR68XX_H */

