/**
 *  @file    reg_cbuff.h
 *
 *  @brief
 *    This file gives register definitions of DSS_CBUFF module.
 *
 *  This file is auto-generated on 3/7/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

/* Definition for field NU2 in Register STAT_CBUFF_ECC_REG */
#define STAT_CBUFF_ECC_REG_NU2_BIT_START                    10U
#define STAT_CBUFF_ECC_REG_NU2_BIT_END                      31U

/* Definition for field NU1 in Register MASK_CBUFF_ECC_REG */
#define MASK_CBUFF_ECC_REG_NU1_BIT_START                    0U
#define MASK_CBUFF_ECC_REG_NU1_BIT_END                      7U

/* Definition for field meccsbe in Register MASK_CBUFF_ECC_REG */
#define MASK_CBUFF_ECC_REG_MECCSBE_BIT_START                8U
#define MASK_CBUFF_ECC_REG_MECCSBE_BIT_END                  8U

/* Definition for field meccdbe in Register MASK_CBUFF_ECC_REG */
#define MASK_CBUFF_ECC_REG_MECCDBE_BIT_START                9U
#define MASK_CBUFF_ECC_REG_MECCDBE_BIT_END                  9U

/* Definition for field NU2 in Register MASK_CBUFF_ECC_REG */
#define MASK_CBUFF_ECC_REG_NU2_BIT_START                    10U
#define MASK_CBUFF_ECC_REG_NU2_BIT_END                      31U

/* Definition for field ceccadd in Register CLR_CBUFF_ECC_REG */
#define CLR_CBUFF_ECC_REG_CECCADD_BIT_START                 0U
#define CLR_CBUFF_ECC_REG_CECCADD_BIT_END                   0U

/* Definition for field NU1 in Register CLR_CBUFF_ECC_REG */
#define CLR_CBUFF_ECC_REG_NU1_BIT_START                     1U
#define CLR_CBUFF_ECC_REG_NU1_BIT_END                       7U

/* Definition for field ceccsbe in Register CLR_CBUFF_ECC_REG */
#define CLR_CBUFF_ECC_REG_CECCSBE_BIT_START                 8U
#define CLR_CBUFF_ECC_REG_CECCSBE_BIT_END                   8U

/* Definition for field ceccdbe in Register CLR_CBUFF_ECC_REG */
#define CLR_CBUFF_ECC_REG_CECCDBE_BIT_START                 9U
#define CLR_CBUFF_ECC_REG_CECCDBE_BIT_END                   9U

/* Definition for field NU2 in Register CLR_CBUFF_ECC_REG */
#define CLR_CBUFF_ECC_REG_NU2_BIT_START                     10U
#define CLR_CBUFF_ECC_REG_NU2_BIT_END                       31U

/* Definition for field SAF_CRC in Register STAT_SAFETY */
#define STAT_SAFETY_SAF_CRC_BIT_START                       0U
#define STAT_SAFETY_SAF_CRC_BIT_END                         7U

/* Definition for field SAF_CHIRP_ERR in Register STAT_SAFETY */
#define STAT_SAFETY_SAF_CHIRP_ERR_BIT_START                 8U
#define STAT_SAFETY_SAF_CHIRP_ERR_BIT_END                   8U

/* Definition for field SAF_UNUSED1 in Register STAT_SAFETY */
#define STAT_SAFETY_SAF_UNUSED1_BIT_START                   9U
#define STAT_SAFETY_SAF_UNUSED1_BIT_END                     31U

/* Definition for field MASK_SAFETY in Register MASK_SAFETY */
#define MASK_SAFETY_MASK_SAFETY_BIT_START                   0U
#define MASK_SAFETY_MASK_SAFETY_BIT_END                     31U

/* Definition for field CLR_SAFETY in Register CLR_SAFETY */
#define CLR_SAFETY_CLR_SAFETY_BIT_START                     0U
#define CLR_SAFETY_CLR_SAFETY_BIT_END                       31U

/**
 * @brief
 *  CBUFF Linked List Entry
 *
 * @details
 *  The structure describes the Linked List Entry in the CBUFF register space
 */
typedef struct DSSCBUFF_LL_t
{
    uint32_t    CFG_DATA_LL;
    uint32_t    CFG_DATA_LL_LPHDR_VAL;
    uint32_t    CFG_DATA_LL_THRESHOLD;
}DSSCBUFF_LL;

/**
 * @struct DSSCBUFFRegs_t
 * @brief
 *   Module DSS_CBUFF Register Definition
 * @details
 *   This structure is used to access the DSS_CBUFF module registers.
 */
/**
 * @typedef DSSCBUFFRegs
 * @brief
 *   Module DSS_CBUFF Register Frame type Definition
 * @details
 *   This type is used to access the DSS_CBUFF module registers.
 */
typedef volatile struct DSSCBUFFRegs_t
{
    uint32_t    CONFIG_REG_0                       ;        /* Offset = 0x000 */
    uint32_t    CFG_SPHDR_ADDRESS                  ;        /* Offset = 0x004 */
    uint32_t    CFG_CMD_HSVAL                      ;        /* Offset = 0x008 */
    uint32_t    CFG_CMD_HEVAL                      ;        /* Offset = 0x00C */
    uint32_t    CFG_CMD_VSVAL                      ;        /* Offset = 0x010 */
    uint32_t    CFG_CMD_VEVAL                      ;        /* Offset = 0x014 */
    uint32_t    CFG_LPHDR_ADDRESS                  ;        /* Offset = 0x018 */
    uint32_t    RESTRICTED1                        ;        /* Offset = 0x01C */
    uint32_t    CFG_CHIRPS_PER_FRAME               ;        /* Offset = 0x020 */
    uint32_t    CFG_FIFO_FREE_THRESHOLD            ;        /* Offset = 0x024 */
    uint32_t    CFG_LPPYLD_ADDRESS                 ;        /* Offset = 0x028 */
    uint32_t    CFG_DELAY_CONFIG                   ;        /* Offset = 0x02C */

    /* SOFTWARE Modification: Making an array would make the driver easier to
     * code and save on memory. */
#if 0
    uint32_t    CFG_DATA_LL0                       ;        /* Offset = 0x030 */
    uint32_t    CFG_DATA_LL0_LPHDR_VAL             ;        /* Offset = 0x034 */
    uint32_t    CFG_DATA_LL0_THRESHOLD             ;        /* Offset = 0x038 */
    uint32_t    CFG_DATA_LL1                       ;        /* Offset = 0x03C */
    uint32_t    CFG_DATA_LL1_LPHDR_VAL             ;        /* Offset = 0x040 */
    uint32_t    CFG_DATA_LL1_THRESHOLD             ;        /* Offset = 0x044 */
    uint32_t    CFG_DATA_LL2                       ;        /* Offset = 0x048 */
    uint32_t    CFG_DATA_LL2_LPHDR_VAL             ;        /* Offset = 0x04C */
    uint32_t    CFG_DATA_LL2_THRESHOLD             ;        /* Offset = 0x050 */
    uint32_t    CFG_DATA_LL3                       ;        /* Offset = 0x054 */
    uint32_t    CFG_DATA_LL3_LPHDR_VAL             ;        /* Offset = 0x058 */
    uint32_t    CFG_DATA_LL3_THRESHOLD             ;        /* Offset = 0x05C */
    uint32_t    CFG_DATA_LL4                       ;        /* Offset = 0x060 */
    uint32_t    CFG_DATA_LL4_LPHDR_VAL             ;        /* Offset = 0x064 */
    uint32_t    CFG_DATA_LL4_THRESHOLD             ;        /* Offset = 0x068 */
    uint32_t    CFG_DATA_LL5                       ;        /* Offset = 0x06C */
    uint32_t    CFG_DATA_LL5_LPHDR_VAL             ;        /* Offset = 0x070 */
    uint32_t    CFG_DATA_LL5_THRESHOLD             ;        /* Offset = 0x074 */
    uint32_t    CFG_DATA_LL6                       ;        /* Offset = 0x078 */
    uint32_t    CFG_DATA_LL6_LPHDR_VAL             ;        /* Offset = 0x07C */
    uint32_t    CFG_DATA_LL6_THRESHOLD             ;        /* Offset = 0x080 */
    uint32_t    CFG_DATA_LL7                       ;        /* Offset = 0x084 */
    uint32_t    CFG_DATA_LL7_LPHDR_VAL             ;        /* Offset = 0x088 */
    uint32_t    CFG_DATA_LL7_THRESHOLD             ;        /* Offset = 0x08C */
    uint32_t    CFG_DATA_LL8                       ;        /* Offset = 0x090 */
    uint32_t    CFG_DATA_LL8_LPHDR_VAL             ;        /* Offset = 0x094 */
    uint32_t    CFG_DATA_LL8_THRESHOLD             ;        /* Offset = 0x098 */
    uint32_t    CFG_DATA_LL9                       ;        /* Offset = 0x09C */
    uint32_t    CFG_DATA_LL9_LPHDR_VAL             ;        /* Offset = 0x0A0 */
    uint32_t    CFG_DATA_LL9_THRESHOLD             ;        /* Offset = 0x0A4 */
    uint32_t    CFG_DATA_LL10                      ;        /* Offset = 0x0A8 */
    uint32_t    CFG_DATA_LL10_LPHDR_VAL            ;        /* Offset = 0x0AC */
    uint32_t    CFG_DATA_LL10_THRESHOLD            ;        /* Offset = 0x0B0 */
    uint32_t    CFG_DATA_LL11                      ;        /* Offset = 0x0B4 */
    uint32_t    CFG_DATA_LL11_LPHDR_VAL            ;        /* Offset = 0x0B8 */
    uint32_t    CFG_DATA_LL11_THRESHOLD            ;        /* Offset = 0x0BC */
    uint32_t    CFG_DATA_LL12                      ;        /* Offset = 0x0C0 */
    uint32_t    CFG_DATA_LL12_LPHDR_VAL            ;        /* Offset = 0x0C4 */
    uint32_t    CFG_DATA_LL12_THRESHOLD            ;        /* Offset = 0x0C8 */
    uint32_t    CFG_DATA_LL13                      ;        /* Offset = 0x0CC */
    uint32_t    CFG_DATA_LL13_LPHDR_VAL            ;        /* Offset = 0x0D0 */
    uint32_t    CFG_DATA_LL13_THRESHOLD            ;        /* Offset = 0x0D4 */
    uint32_t    CFG_DATA_LL14                      ;        /* Offset = 0x0D8 */
    uint32_t    CFG_DATA_LL14_LPHDR_VAL            ;        /* Offset = 0x0DC */
    uint32_t    CFG_DATA_LL14_THRESHOLD            ;        /* Offset = 0x0E0 */
    uint32_t    CFG_DATA_LL15                      ;        /* Offset = 0x0E4 */
    uint32_t    CFG_DATA_LL15_LPHDR_VAL            ;        /* Offset = 0x0E8 */
    uint32_t    CFG_DATA_LL15_THRESHOLD            ;        /* Offset = 0x0EC */
    uint32_t    CFG_DATA_LL16                      ;        /* Offset = 0x0F0 */
    uint32_t    CFG_DATA_LL16_LPHDR_VAL            ;        /* Offset = 0x0F4 */
    uint32_t    CFG_DATA_LL16_THRESHOLD            ;        /* Offset = 0x0F8 */
    uint32_t    CFG_DATA_LL17                      ;        /* Offset = 0x0FC */
    uint32_t    CFG_DATA_LL17_LPHDR_VAL            ;        /* Offset = 0x100 */
    uint32_t    CFG_DATA_LL17_THRESHOLD            ;        /* Offset = 0x104 */
    uint32_t    CFG_DATA_LL18                      ;        /* Offset = 0x108 */
    uint32_t    CFG_DATA_LL18_LPHDR_VAL            ;        /* Offset = 0x10C */
    uint32_t    CFG_DATA_LL18_THRESHOLD            ;        /* Offset = 0x110 */
    uint32_t    CFG_DATA_LL19                      ;        /* Offset = 0x114 */
    uint32_t    CFG_DATA_LL19_LPHDR_VAL            ;        /* Offset = 0x118 */
    uint32_t    CFG_DATA_LL19_THRESHOLD            ;        /* Offset = 0x11C */
    uint32_t    CFG_DATA_LL20                      ;        /* Offset = 0x120 */
    uint32_t    CFG_DATA_LL20_LPHDR_VAL            ;        /* Offset = 0x124 */
    uint32_t    CFG_DATA_LL20_THRESHOLD            ;        /* Offset = 0x128 */
    uint32_t    CFG_DATA_LL21                      ;        /* Offset = 0x12C */
    uint32_t    CFG_DATA_LL21_LPHDR_VAL            ;        /* Offset = 0x130 */
    uint32_t    CFG_DATA_LL21_THRESHOLD            ;        /* Offset = 0x134 */
    uint32_t    CFG_DATA_LL22                      ;        /* Offset = 0x138 */
    uint32_t    CFG_DATA_LL22_LPHDR_VAL            ;        /* Offset = 0x13C */
    uint32_t    CFG_DATA_LL22_THRESHOLD            ;        /* Offset = 0x140 */
    uint32_t    CFG_DATA_LL23                      ;        /* Offset = 0x144 */
    uint32_t    CFG_DATA_LL23_LPHDR_VAL            ;        /* Offset = 0x148 */
    uint32_t    CFG_DATA_LL23_THRESHOLD            ;        /* Offset = 0x14C */
    uint32_t    CFG_DATA_LL24                      ;        /* Offset = 0x150 */
    uint32_t    CFG_DATA_LL24_LPHDR_VAL            ;        /* Offset = 0x154 */
    uint32_t    CFG_DATA_LL24_THRESHOLD            ;        /* Offset = 0x158 */
    uint32_t    CFG_DATA_LL25                      ;        /* Offset = 0x15C */
    uint32_t    CFG_DATA_LL25_LPHDR_VAL            ;        /* Offset = 0x160 */
    uint32_t    CFG_DATA_LL25_THRESHOLD            ;        /* Offset = 0x164 */
    uint32_t    CFG_DATA_LL26                      ;        /* Offset = 0x168 */
    uint32_t    CFG_DATA_LL26_LPHDR_VAL            ;        /* Offset = 0x16C */
    uint32_t    CFG_DATA_LL26_THRESHOLD            ;        /* Offset = 0x170 */
    uint32_t    CFG_DATA_LL27                      ;        /* Offset = 0x174 */
    uint32_t    CFG_DATA_LL27_LPHDR_VAL            ;        /* Offset = 0x178 */
    uint32_t    CFG_DATA_LL27_THRESHOLD            ;        /* Offset = 0x17C */
    uint32_t    CFG_DATA_LL28                      ;        /* Offset = 0x180 */
    uint32_t    CFG_DATA_LL28_LPHDR_VAL            ;        /* Offset = 0x184 */
    uint32_t    CFG_DATA_LL28_THRESHOLD            ;        /* Offset = 0x188 */
    uint32_t    CFG_DATA_LL29                      ;        /* Offset = 0x18C */
    uint32_t    CFG_DATA_LL29_LPHDR_VAL            ;        /* Offset = 0x190 */
    uint32_t    CFG_DATA_LL29_THRESHOLD            ;        /* Offset = 0x194 */
    uint32_t    CFG_DATA_LL30                      ;        /* Offset = 0x198 */
    uint32_t    CFG_DATA_LL30_LPHDR_VAL            ;        /* Offset = 0x19C */
    uint32_t    CFG_DATA_LL30_THRESHOLD            ;        /* Offset = 0x1A0 */
    uint32_t    CFG_DATA_LL31                      ;        /* Offset = 0x1A4 */
    uint32_t    CFG_DATA_LL31_LPHDR_VAL            ;        /* Offset = 0x1A8 */
    uint32_t    CFG_DATA_LL31_THRESHOLD            ;        /* Offset = 0x1AC */
#else
    DSSCBUFF_LL LL_ENTRY[32];
#endif

    /* SOFTWARE Modification: Making an array would make the driver easier to
     * code and save on memory. */
#if 0
    uint32_t    CFG_LVDS_MAPPING_LANE0_FMT_0       ;        /* Offset = 0x1B0 */
    uint32_t    CFG_LVDS_MAPPING_LANE1_FMT_0       ;        /* Offset = 0x1B4 */
    uint32_t    CFG_LVDS_MAPPING_LANE2_FMT_0       ;        /* Offset = 0x1B8 */
    uint32_t    CFG_LVDS_MAPPING_LANE3_FMT_0       ;        /* Offset = 0x1BC */
    uint32_t    CFG_LVDS_MAPPING_LANE0_FMT_1       ;        /* Offset = 0x1C0 */
    uint32_t    CFG_LVDS_MAPPING_LANE1_FMT_1       ;        /* Offset = 0x1C4 */
    uint32_t    CFG_LVDS_MAPPING_LANE2_FMT_1       ;        /* Offset = 0x1C8 */
    uint32_t    CFG_LVDS_MAPPING_LANE3_FMT_1       ;        /* Offset = 0x1CC */
#else
    uint32_t    CFG_LVDS_MAPPING_LANE_FMT[8];
#endif
    uint32_t    CFG_LVDS_GEN_0                     ;        /* Offset = 0x1D0 */
    uint32_t    CFG_LVDS_GEN_1                     ;        /* Offset = 0x1D4 */
    uint32_t    CFG_LVDS_GEN_2                     ;        /* Offset = 0x1D8 */
    uint32_t    CFG_MASK_REG0                      ;        /* Offset = 0x1DC */
    uint32_t    CFG_MASK_REG1                      ;        /* Offset = 0x1E0 */
    uint32_t    CFG_MASK_REG2                      ;        /* Offset = 0x1E4 */
    uint32_t    CFG_MASK_REG3                      ;        /* Offset = 0x1E8 */
    uint32_t    STAT_CBUFF_REG0                    ;        /* Offset = 0x1EC */
    uint32_t    STAT_CBUFF_REG1                    ;        /* Offset = 0x1F0 */
    uint32_t    STAT_CBUFF_REG2                    ;        /* Offset = 0x1F4 */
    uint32_t    STAT_CBUFF_REG3                    ;        /* Offset = 0x1F8 */
    uint32_t    RESTRICTED2[4]                     ;        /* Offset = 0x1FC */
    uint32_t    CLR_CBUFF_REG0                     ;        /* Offset = 0x20C */
    uint32_t    RESTRICTED3[3]                     ;        /* Offset = 0x210 */
    uint32_t    STAT_CBUFF_ECC_REG                 ;        /* Offset = 0x21C */
    uint32_t    MASK_CBUFF_ECC_REG                 ;        /* Offset = 0x220 */
    uint32_t    CLR_CBUFF_ECC_REG                  ;        /* Offset = 0x224 */
    uint32_t    STAT_SAFETY                        ;        /* Offset = 0x228 */
    uint32_t    MASK_SAFETY                        ;        /* Offset = 0x22C */
    uint32_t    CLR_SAFETY                         ;        /* Offset = 0x230 */
} DSSCBUFFRegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_DSSCBUFF_H */
/* END OF REG_DSSCBUFF_H */

