/**
 *  @file    reg_mibspi.h
 *
 *  @brief
 *    This file gives register definitions of MSS_MIBSPIA module.
 *
 *  This file is auto-generated on 3/27/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define ECCDIAG_STAT_NU1_BIT_START                          2U
#define ECCDIAG_STAT_NU1_BIT_END                            15U

/* Definition for field DEFLG0 in Register ECCDIAG_STAT */
#define ECCDIAG_STAT_DEFLG0_BIT_START                       16U
#define ECCDIAG_STAT_DEFLG0_BIT_END                         16U

/* Definition for field DEFLG1 in Register ECCDIAG_STAT */
#define ECCDIAG_STAT_DEFLG1_BIT_START                       17U
#define ECCDIAG_STAT_DEFLG1_BIT_END                         17U

/* Definition for field NU2 in Register ECCDIAG_STAT */
#define ECCDIAG_STAT_NU2_BIT_START                          18U
#define ECCDIAG_STAT_NU2_BIT_END                            31U

/* Definition for field SBERRADDR1 in Register SBERRADDR1 */
#define SBERRADDR1_SBERRADDR1_BIT_START                     0U
#define SBERRADDR1_SBERRADDR1_BIT_END                       10U

/* Definition for field NU1 in Register SBERRADDR1 */
#define SBERRADDR1_NU1_BIT_START                            11U
#define SBERRADDR1_NU1_BIT_END                              31U

/* Definition for field SBERRADDR0 in Register SBERRADDR0 */
#define SBERRADDR0_SBERRADDR0_BIT_START                     0U
#define SBERRADDR0_SBERRADDR0_BIT_END                       10U

/* Definition for field NU2 in Register SBERRADDR0 */
#define SBERRADDR0_NU2_BIT_START                            11U
#define SBERRADDR0_NU2_BIT_END                              31U

/* Definition for field MINOR in Register SPIREV */
#define SPIREV_MINOR_BIT_START                              0U
#define SPIREV_MINOR_BIT_END                                5U

/* Definition for field CUSTOM in Register SPIREV */
#define SPIREV_CUSTOM_BIT_START                             6U
#define SPIREV_CUSTOM_BIT_END                               7U

/* Definition for field MAJOR in Register SPIREV */
#define SPIREV_MAJOR_BIT_START                              8U
#define SPIREV_MAJOR_BIT_END                                10U

/* Definition for field RTL in Register SPIREV */
#define SPIREV_RTL_BIT_START                                11U
#define SPIREV_RTL_BIT_END                                  15U

/* Definition for field FUNC in Register SPIREV */
#define SPIREV_FUNC_BIT_START                               16U
#define SPIREV_FUNC_BIT_END                                 27U

/* Definition for field NU in Register SPIREV */
#define SPIREV_NU_BIT_START                                 28U
#define SPIREV_NU_BIT_END                                   29U

/* Definition for field SCHEME in Register SPIREV */
#define SPIREV_SCHEME_BIT_START                             30U
#define SPIREV_SCHEME_BIT_END                               31U



/**
 * @struct MIBSPIRegs_t
 * @brief
 *   Module MSS_MIBSPIA Register Definition
 * @details
 *   This structure is used to access the MSS_MIBSPIA module registers.
 */
/**
 * @typedef MIBSPIRegs
 * @brief
 *   Module MSS_MIBSPIA Register Frame type Definition
 * @details
 *   This type is used to access the MSS_MIBSPIA module registers.
 */
typedef volatile struct MIBSPIRegs_t
{
    uint32_t    SPIGCR0                            ;        /* Offset = 0x000 */
    uint32_t    SPIGCR1                            ;        /* Offset = 0x004 */
    uint32_t    SPIINT0                            ;        /* Offset = 0x008 */
    uint32_t    SPILVL                             ;        /* Offset = 0x00C */
    uint32_t    SPIFLG                             ;        /* Offset = 0x010 */
    uint32_t    SPIPC0                             ;        /* Offset = 0x014 */
    uint32_t    SPIPC1                             ;        /* Offset = 0x018 */
    uint32_t    SPIPC2                             ;        /* Offset = 0x01C */
    uint32_t    SPIPC3                             ;        /* Offset = 0x020 */
    uint32_t    SPIPC4                             ;        /* Offset = 0x024 */
    uint32_t    SPIPC5                             ;        /* Offset = 0x028 */
    uint32_t    SPIPC6                             ;        /* Offset = 0x02C */
    uint32_t    SPIPC7                             ;        /* Offset = 0x030 */
    uint32_t    SPIPC8                             ;        /* Offset = 0x034 */
    uint32_t    SPIDAT0                            ;        /* Offset = 0x038 */
    uint32_t    SPIDAT1                            ;        /* Offset = 0x03C */
    uint32_t    SPIBUF                             ;        /* Offset = 0x040 */
    uint32_t    SPIEMU                             ;        /* Offset = 0x044 */
    uint32_t    SPIDELAY                           ;        /* Offset = 0x048 */
    uint32_t    SPIDEF                             ;        /* Offset = 0x04C */
    uint32_t    SPIFMT0                            ;        /* Offset = 0x050 */
    uint32_t    SPIFMT1                            ;        /* Offset = 0x054 */
    uint32_t    SPIFMT2                            ;        /* Offset = 0x058 */
    uint32_t    SPIFMT3                            ;        /* Offset = 0x05C */
    uint32_t    TGINTVECT0                         ;        /* Offset = 0x060 */
    uint32_t    TGINTVECT1                         ;        /* Offset = 0x064 */
    uint32_t    SPIPC9                             ;        /* Offset = 0x068 */
    uint32_t    SPIPMCTRL                          ;        /* Offset = 0x06C */
    uint32_t    MIBSPIE                            ;        /* Offset = 0x070 */
    uint32_t    TGITENST                           ;        /* Offset = 0x074 */
    uint32_t    TGITENCR                           ;        /* Offset = 0x078 */
    uint32_t    TGITLVST                           ;        /* Offset = 0x07C */
    uint32_t    TGITLVCR                           ;        /* Offset = 0x080 */
    uint32_t    TGINTFLAG                          ;        /* Offset = 0x084 */
    uint32_t    RESTRICTED2[2]                     ;        /* Offset = 0x088 */
    uint32_t    TICKCNT                            ;        /* Offset = 0x090 */
    uint32_t    LTGPEND                            ;        /* Offset = 0x094 */
#if 0    
    uint32_t    TG0CTRL                            ;        /* Offset = 0x098 */
    uint32_t    TG1CTRL                            ;        /* Offset = 0x09C */
    uint32_t    TG2CTRL                            ;        /* Offset = 0x0A0 */
    uint32_t    TG3CTRL                            ;        /* Offset = 0x0A4 */
    uint32_t    TG4CTRL                            ;        /* Offset = 0x0A8 */
    uint32_t    TG5CTRL                            ;        /* Offset = 0x0AC */
    uint32_t    TG6CTRL                            ;        /* Offset = 0x0B0 */
    uint32_t    TG7CTRL                            ;        /* Offset = 0x0B4 */
#else
    uint32_t    TGCTRL[8]                          ;        /* Offset = 0x098 */
#endif    

    uint32_t    RESTRICTED3[8]                     ;        /* Offset = 0x0B8 */
#if 0
    uint32_t    DMA0CTRL                           ;        /* Offset = 0x0D8 */
    uint32_t    DMA1CTRL                           ;        /* Offset = 0x0DC */
    uint32_t    DMA2CTRL                           ;        /* Offset = 0x0E0 */
    uint32_t    DMA3CTRL                           ;        /* Offset = 0x0E4 */
    uint32_t    DMA4CTRL                           ;        /* Offset = 0x0E8 */
#else 
    uint32_t    DMACTRL[5]                         ;        /* Offset = 0x0D8 */
#endif
    uint32_t    RESTRICTED4[3]                     ;        /* Offset = 0x0EC */
#if 0
    uint32_t    ICOUNT0                            ;        /* Offset = 0x0F8 */
    uint32_t    ICOUNT1                            ;        /* Offset = 0x0FC */
    uint32_t    ICOUNT2                            ;        /* Offset = 0x100 */
    uint32_t    ICOUNT3                            ;        /* Offset = 0x104 */
    uint32_t    ICOUNT4                            ;        /* Offset = 0x108 */
#else  
    uint32_t    ICOUNT[5]                          ;        /* Offset = 0x0F8 */
#endif
    uint32_t    RESTRICTED5[3]                     ;        /* Offset = 0x10C */
    uint32_t    DMACNTLEN                          ;        /* Offset = 0x118 */
    uint32_t    RESTRICTED6                        ;        /* Offset = 0x11C */
    uint32_t    PAR_ECC_CTRL                       ;        /* Offset = 0x120 */
    uint32_t    PAR_ECC_STAT                       ;        /* Offset = 0x124 */
    uint32_t    UERRADDR1                          ;        /* Offset = 0x128 */
    uint32_t    UERRADDR0                          ;        /* Offset = 0x12C */
    uint32_t    RXOVRN_BUF_ADDR                    ;        /* Offset = 0x130 */
    uint32_t    IOLPBKTSTCR                        ;        /* Offset = 0x134 */
    uint32_t    EXTENDED_PRESCALE1                 ;        /* Offset = 0x138 */
    uint32_t    EXTENDED_PRESCALE2                 ;        /* Offset = 0x13C */
    uint32_t    ECCDIAG_CTRL                       ;        /* Offset = 0x140 */
    uint32_t    ECCDIAG_STAT                       ;        /* Offset = 0x144 */
    uint32_t    SBERRADDR1                         ;        /* Offset = 0x148 */
    uint32_t    SBERRADDR0                         ;        /* Offset = 0x14C */
    uint32_t    RESTRICTED7[43]                    ;        /* Offset = 0x150 */
    uint32_t    SPIREV                             ;        /* Offset = 0x1FC */
} MIBSPIRegs;


/**
 * @struct MIBSPIRam_t
 * @brief
 *   MIBSPI Buffer RAM Definition
 * @details
 *   This structure is used to access the MSS_MIBSPIA buffer memory.
 */
/**
 * @typedef MIBSPIRam
 * @brief
 *   MIBSPI Buffer RAM Definition
 * @details
 *   This structure is used to access the MSS_MIBSPIA buffer memory.
 */
typedef volatile struct MIBSPIRam_t
{
    struct
    {
     uint16_t  data;     /**< tx buffer data    */
     uint16_t  control;  /**< tx buffer control */
    } tx[128];
    struct
    {
     uint16_t data;     /**< rx buffer data  */
     uint16_t flags;    /**< rx buffer flags */
    } rx[128];
} MIBSPIRam;


#ifdef __cplusplus
}
#endif

#endif /* REG_MIBSPI_H */
/* END OF REG_MIBSPI_H */

