/**
 *  @file    reg_dss_xwr16xx.h
 *
 *  @brief
 *    This file gives register definitions of DSS_REG module.
 *
 *  This file is auto-generated on 3/27/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

/* Definition for field ADCBUFSAMPCNT in Register ADCBUFCFG4 */
#define ADCBUFCFG4_ADCBUFSAMPCNT_BIT_START                  0U
#define ADCBUFCFG4_ADCBUFSAMPCNT_BIT_END                    15U

/* Definition for field ADCBUFNUMCHRPPING in Register ADCBUFCFG4 */
#define ADCBUFCFG4_ADCBUFNUMCHRPPING_BIT_START              16U
#define ADCBUFCFG4_ADCBUFNUMCHRPPING_BIT_END                20U

/* Definition for field ADCBUFNUMCHRPPONG in Register ADCBUFCFG4 */
#define ADCBUFCFG4_ADCBUFNUMCHRPPONG_BIT_START              21U
#define ADCBUFCFG4_ADCBUFNUMCHRPPONG_BIT_END                25U

/* Definition for field STCPBISTLRSTDASRTHALT in Register STCPBISTSMCFG1 */
#define STCPBISTSMCFG1_STCPBISTLRSTDASRTHALT_BIT_START      3U
#define STCPBISTSMCFG1_STCPBISTLRSTDASRTHALT_BIT_END        3U

/* Definition for field RTI2EVT0 in Register RTI2EVENTCAPTURESEL */
#define RTI2EVENTCAPTURESEL_RTI2EVT0_BIT_START              0U
#define RTI2EVENTCAPTURESEL_RTI2EVT0_BIT_END                6U

/* Definition for field RTI2EVT1 in Register RTI2EVENTCAPTURESEL */
#define RTI2EVENTCAPTURESEL_RTI2EVT1_BIT_START              16U
#define RTI2EVENTCAPTURESEL_RTI2EVT1_BIT_END                22U

/* Definition for field CQPIPOSELCNT in Register DSSMISC5 */
#define DSSMISC5_CQPIPOSELCNT_BIT_START                     0U
#define DSSMISC5_CQPIPOSELCNT_BIT_END                       0U

/* Definition for field CQPIPOSELVAL in Register DSSMISC5 */
#define DSSMISC5_CQPIPOSELVAL_BIT_START                     1U
#define DSSMISC5_CQPIPOSELVAL_BIT_END                       1U

/* Definition for field CPBPMPIPOSELCNT in Register DSSMISC5 */
#define DSSMISC5_CPBPMPIPOSELCNT_BIT_START                  2U
#define DSSMISC5_CPBPMPIPOSELCNT_BIT_END                    2U

/* Definition for field CPBPMPIPOSELVAL in Register DSSMISC5 */
#define DSSMISC5_CPBPMPIPOSELVAL_BIT_START                  3U
#define DSSMISC5_CPBPMPIPOSELVAL_BIT_END                    3U

/* Definition for field TPCC0PARMEMINIT in Register DSSMISC5 */
#define DSSMISC5_TPCC0PARMEMINIT_BIT_START                  4U
#define DSSMISC5_TPCC0PARMEMINIT_BIT_END                    4U

/* Definition for field TPCC1PARMEMINIT in Register DSSMISC5 */
#define DSSMISC5_TPCC1PARMEMINIT_BIT_START                  5U
#define DSSMISC5_TPCC1PARMEMINIT_BIT_END                    5U

/* Definition for field TPCC0PARMEMINITDONE in Register DSSMISC5 */
#define DSSMISC5_TPCC0PARMEMINITDONE_BIT_START              6U
#define DSSMISC5_TPCC0PARMEMINITDONE_BIT_END                6U

/* Definition for field TPCC1PARMEMINITDONE in Register DSSMISC5 */
#define DSSMISC5_TPCC1PARMEMINITDONE_BIT_START              7U
#define DSSMISC5_TPCC1PARMEMINITDONE_BIT_END                7U



/**
 * @struct DSSRegs_t
 * @brief
 *   Module DSS_REG Register Definition
 * @details
 *   This structure is used to access the DSS_REG module registers.
 */
/**
 * @typedef DSSRegs
 * @brief
 *   Module DSS_REG Register Frame type Definition
 * @details
 *   This type is used to access the DSS_REG module registers.
 */
typedef volatile struct DSSRegs_t
{
    uint32_t    DSSGPREG0                          ;        /* Offset = 0x000 */
    uint32_t    RESTRICTED1[19]                    ;        /* Offset = 0x004 */
    uint32_t    RTIEVENTCAPTURESEL                 ;        /* Offset = 0x050 */
    uint32_t    RESTRICTED2[6]                     ;        /* Offset = 0x054 */
    uint32_t    CQCFG1                             ;        /* Offset = 0x06C */
    uint32_t    RESTRICTED3[4]                     ;        /* Offset = 0x070 */
    uint32_t    TPCCPARSTATCFG                     ;        /* Offset = 0x080 */
    uint32_t    CSI2TXPARSTATCFG                   ;        /* Offset = 0x084 */
    uint32_t    RESTRICTED4[6]                     ;        /* Offset = 0x088 */
    uint32_t    CSICFG1                            ;        /* Offset = 0x0A0 */
    uint32_t    RESTRICTED5[24]                    ;        /* Offset = 0x0A4 */
    uint32_t    TPTC0WRMPUSTADD0                   ;        /* Offset = 0x104 */
    uint32_t    TPTC0WRMPUSTADD1                   ;        /* Offset = 0x108 */
    uint32_t    TPTC0WRMPUSTADD2                   ;        /* Offset = 0x10C */
    uint32_t    TPTC0WRMPUSTADD3                   ;        /* Offset = 0x110 */
    uint32_t    TPTC0WRMPUSTADD4                   ;        /* Offset = 0x114 */
    uint32_t    TPTC0WRMPUSTADD5                   ;        /* Offset = 0x118 */
    uint32_t    RESTRICTED6[2]                     ;        /* Offset = 0x11C */
    uint32_t    TPTC0WRMPUENDADD0                  ;        /* Offset = 0x124 */
    uint32_t    TPTC0WRMPUENDADD1                  ;        /* Offset = 0x128 */
    uint32_t    TPTC0WRMPUENDADD2                  ;        /* Offset = 0x12C */
    uint32_t    TPTC0WRMPUENDADD3                  ;        /* Offset = 0x130 */
    uint32_t    TPTC0WRMPUENDADD4                  ;        /* Offset = 0x134 */
    uint32_t    TPTC0WRMPUENDADD5                  ;        /* Offset = 0x138 */
    uint32_t    RESTRICTED7[2]                     ;        /* Offset = 0x13C */
    uint32_t    TPTC0WRMPUERRADD                   ;        /* Offset = 0x144 */
    uint32_t    TPTC0RDMPUSTADD0                   ;        /* Offset = 0x148 */
    uint32_t    TPTC0RDMPUSTADD1                   ;        /* Offset = 0x14C */
    uint32_t    TPTC0RDMPUSTADD2                   ;        /* Offset = 0x150 */
    uint32_t    TPTC0RDMPUSTADD3                   ;        /* Offset = 0x154 */
    uint32_t    TPTC0RDMPUSTADD4                   ;        /* Offset = 0x158 */
    uint32_t    TPTC0RDMPUSTADD5                   ;        /* Offset = 0x15C */
    uint32_t    RESTRICTED8[2]                     ;        /* Offset = 0x160 */
    uint32_t    TPTC0RDMPUENDADD0                  ;        /* Offset = 0x168 */
    uint32_t    TPTC0RDMPUENDADD1                  ;        /* Offset = 0x16C */
    uint32_t    TPTC0RDMPUENDADD2                  ;        /* Offset = 0x170 */
    uint32_t    TPTC0RDMPUENDADD3                  ;        /* Offset = 0x174 */
    uint32_t    TPTC0RDMPUENDADD4                  ;        /* Offset = 0x178 */
    uint32_t    TPTC0RDMPUENDADD5                  ;        /* Offset = 0x17C */
    uint32_t    RESTRICTED9[2]                     ;        /* Offset = 0x180 */
    uint32_t    TPTC0RDMPUERRADD                   ;        /* Offset = 0x188 */
    uint32_t    TPTC1WRMPUSTADD0                   ;        /* Offset = 0x18C */
    uint32_t    TPTC1WRMPUSTADD1                   ;        /* Offset = 0x190 */
    uint32_t    TPTC1WRMPUSTADD2                   ;        /* Offset = 0x194 */
    uint32_t    TPTC1WRMPUSTADD3                   ;        /* Offset = 0x198 */
    uint32_t    TPTC1WRMPUSTADD4                   ;        /* Offset = 0x19C */
    uint32_t    TPTC1WRMPUSTADD5                   ;        /* Offset = 0x1A0 */
    uint32_t    RESTRICTED10[2]                    ;        /* Offset = 0x1A4 */
    uint32_t    TPTC1WRMPUENDADD0                  ;        /* Offset = 0x1AC */
    uint32_t    TPTC1WRMPUENDADD1                  ;        /* Offset = 0x1B0 */
    uint32_t    TPTC1WRMPUENDADD2                  ;        /* Offset = 0x1B4 */
    uint32_t    TPTC1WRMPUENDADD3                  ;        /* Offset = 0x1B8 */
    uint32_t    TPTC1WRMPUENDADD4                  ;        /* Offset = 0x1BC */
    uint32_t    TPTC1WRMPUENDADD5                  ;        /* Offset = 0x1C0 */
    uint32_t    RESTRICTED11[2]                    ;        /* Offset = 0x1C4 */
    uint32_t    TPTC1WRMPUERRADD                   ;        /* Offset = 0x1CC */
    uint32_t    TPTC1RDMPUSTADD0                   ;        /* Offset = 0x1D0 */
    uint32_t    TPTC1RDMPUSTADD1                   ;        /* Offset = 0x1D4 */
    uint32_t    TPTC1RDMPUSTADD2                   ;        /* Offset = 0x1D8 */
    uint32_t    TPTC1RDMPUSTADD3                   ;        /* Offset = 0x1DC */
    uint32_t    TPTC1RDMPUSTADD4                   ;        /* Offset = 0x1E0 */
    uint32_t    TPTC1RDMPUSTADD5                   ;        /* Offset = 0x1E4 */
    uint32_t    RESTRICTED12[2]                    ;        /* Offset = 0x1E8 */
    uint32_t    TPTC1RDMPUENDADD0                  ;        /* Offset = 0x1F0 */
    uint32_t    TPTC1RDMPUENDADD1                  ;        /* Offset = 0x1F4 */
    uint32_t    TPTC1RDMPUENDADD2                  ;        /* Offset = 0x1F8 */
    uint32_t    TPTC1RDMPUENDADD3                  ;        /* Offset = 0x1FC */
    uint32_t    TPTC1RDMPUENDADD4                  ;        /* Offset = 0x200 */
    uint32_t    TPTC1RDMPUENDADD5                  ;        /* Offset = 0x204 */
    uint32_t    RESTRICTED13[2]                    ;        /* Offset = 0x208 */
    uint32_t    TPTC1RDMPUERRADD                   ;        /* Offset = 0x210 */
    uint32_t    TPTCMPUVALIDCFG                    ;        /* Offset = 0x214 */
    uint32_t    TPTCMPUENCFG                       ;        /* Offset = 0x218 */
    uint32_t    TESTPATTERNRX1ICFG                 ;        /* Offset = 0x21C */
    uint32_t    TESTPATTERNRX2ICFG                 ;        /* Offset = 0x220 */
    uint32_t    TESTPATTERNRX3ICFG                 ;        /* Offset = 0x224 */
    uint32_t    TESTPATTERNRX4ICFG                 ;        /* Offset = 0x228 */
    uint32_t    TESTPATTERNRX1QCFG                 ;        /* Offset = 0x22C */
    uint32_t    TESTPATTERNRX2QCFG                 ;        /* Offset = 0x230 */
    uint32_t    TESTPATTERNRX3QCFG                 ;        /* Offset = 0x234 */
    uint32_t    TESTPATTERNRX4QCFG                 ;        /* Offset = 0x238 */
    uint32_t    TESTPATTERNVLDCFG                  ;        /* Offset = 0x23C */
    uint32_t    DSSMISC                            ;        /* Offset = 0x240 */
    uint32_t    RESTRICTED14[5]                    ;        /* Offset = 0x244 */
    uint32_t    TPCC1PARSTATCFG                    ;        /* Offset = 0x258 */
    uint32_t    RESTRICTED15                       ;        /* Offset = 0x25C */
    uint32_t    DMMSWINT1                          ;        /* Offset = 0x260 */
    uint32_t    RESTRICTED16[3]                    ;        /* Offset = 0x264 */
    uint32_t    DSSINTRCFG                         ;        /* Offset = 0x270 */
    uint32_t    MPUMSTIDCFG1                       ;        /* Offset = 0x274 */
    uint32_t    MPUMSTIDCFG2                       ;        /* Offset = 0x278 */
    uint32_t    MPUMSTIDCFG3                       ;        /* Offset = 0x27C */
    uint32_t    HSRAM1ECCCFG                       ;        /* Offset = 0x280 */
    uint32_t    RESTRICTED17                       ;        /* Offset = 0x284 */
    uint32_t    DATATRRAMECCCFG                    ;        /* Offset = 0x288 */
    uint32_t    ADCBUFPINGECCCFG                   ;        /* Offset = 0x28C */
    uint32_t    ADCBUFPONGECCCFG                   ;        /* Offset = 0x290 */
    uint32_t    RESTRICTED18[2]                    ;        /* Offset = 0x294 */
    uint32_t    UMAP0PARITYCFG1                    ;        /* Offset = 0x29C */
    uint32_t    UMAP0PARITYCFG2                    ;        /* Offset = 0x2A0 */
    uint32_t    UMAP0PARITYCFG3                    ;        /* Offset = 0x2A4 */
    uint32_t    UMAP1PARITYCFG1                    ;        /* Offset = 0x2A8 */
    uint32_t    UMAP1PARITYCFG2                    ;        /* Offset = 0x2AC */
    uint32_t    UMAP1PARITYCFG3                    ;        /* Offset = 0x2B0 */
    uint32_t    ESMGRP2MASKCFG                     ;        /* Offset = 0x2B4 */
    uint32_t    L2MEMINITCFG1                      ;        /* Offset = 0x2B8 */
    uint32_t    L2MEMINITCFG2                      ;        /* Offset = 0x2BC */
    uint32_t    GEMRSTCAUSE                        ;        /* Offset = 0x2C0 */
    uint32_t    RESTRICTED19                       ;        /* Offset = 0x2C4 */
    uint32_t    GEMPWRSMCFG3                       ;        /* Offset = 0x2C8 */
    uint32_t    GEMPWRSMCFG4                       ;        /* Offset = 0x2CC */
    uint32_t    RESTRICTED20                       ;        /* Offset = 0x2D0 */
    uint32_t    PWRSMWAKEMASK0                     ;        /* Offset = 0x2D4 */
    uint32_t    PWRSMWAKEMASK1                     ;        /* Offset = 0x2D8 */
    uint32_t    PWRSMWAKEMASK2                     ;        /* Offset = 0x2DC */
    uint32_t    PWRSMMISEVTMASK0                   ;        /* Offset = 0x2E0 */
    uint32_t    PWRSMMISEVTMASK1                   ;        /* Offset = 0x2E4 */
    uint32_t    PWRSMMISEVTMASK2                   ;        /* Offset = 0x2E8 */
    uint32_t    PWRSMWAKESRCSTAT0                  ;        /* Offset = 0x2EC */
    uint32_t    PWRSMWAKESRCSTAT1                  ;        /* Offset = 0x2F0 */
    uint32_t    RESTRICTED21[11]                   ;        /* Offset = 0x2F4 */
    uint32_t    PWRSMWAKESRCSTAT2                  ;        /* Offset = 0x320 */
    uint32_t    PWRSMEVNTMONSTAT0                  ;        /* Offset = 0x324 */
    uint32_t    PWRSMEVNTMONSTAT1                  ;        /* Offset = 0x328 */
    uint32_t    PWRSMEVNTMONSTAT2                  ;        /* Offset = 0x32C */
    uint32_t    PWRSMWAKESRCSTATCLR0               ;        /* Offset = 0x330 */
    uint32_t    PWRSMWAKESRCSTATCLR1               ;        /* Offset = 0x334 */
    uint32_t    PWRSMWAKESRCSTATCLR2               ;        /* Offset = 0x338 */
    uint32_t    ADCBUFCFG1                         ;        /* Offset = 0x33C */
    uint32_t    ADCBUFCFG2                         ;        /* Offset = 0x340 */
    uint32_t    ADCBUFCFG3                         ;        /* Offset = 0x344 */
    uint32_t    ADCBUFCFG4                         ;        /* Offset = 0x348 */
    uint32_t    STCPBISTSMCFG1                     ;        /* Offset = 0x34C */
    uint32_t    RESTRICTED22[2]                    ;        /* Offset = 0x350 */
    uint32_t    RTI2EVENTCAPTURESEL                ;        /* Offset = 0x358 */
    uint32_t    DSSMISC5                           ;        /* Offset = 0x35C */
} DSSRegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_DSS_H */
/* END OF REG_DSS_H */

