/**
 *  @file    reg_dss2_xwr16xx.h
 *
 *  @brief
 *    This file gives register definitions of DSS_REG2 module.
 *
 *  This file is auto-generated on 3/27/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT,  STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef REG_DSS2_H
#define REG_DSS2_H

/****************************************************************************************
 * INCLUDE FILES
 ****************************************************************************************/
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* Definition for field TPTC2WRMPUSTADD0 in Register TPTC2WRMPUSTADD0 */
#define TPTC2WRMPUSTADD0_TPTC2WRMPUSTADD0_BIT_START         0U
#define TPTC2WRMPUSTADD0_TPTC2WRMPUSTADD0_BIT_END           31U

/* Definition for field TPTC2WRMPUSTADD1 in Register TPTC2WRMPUSTADD1 */
#define TPTC2WRMPUSTADD1_TPTC2WRMPUSTADD1_BIT_START         0U
#define TPTC2WRMPUSTADD1_TPTC2WRMPUSTADD1_BIT_END           31U

/* Definition for field TPTC2WRMPUSTADD2 in Register TPTC2WRMPUSTADD2 */
#define TPTC2WRMPUSTADD2_TPTC2WRMPUSTADD2_BIT_START         0U
#define TPTC2WRMPUSTADD2_TPTC2WRMPUSTADD2_BIT_END           31U

/* Definition for field TPTC2WRMPUSTADD3 in Register TPTC2WRMPUSTADD3 */
#define TPTC2WRMPUSTADD3_TPTC2WRMPUSTADD3_BIT_START         0U
#define TPTC2WRMPUSTADD3_TPTC2WRMPUSTADD3_BIT_END           31U

/* Definition for field TPTC2WRMPUSTADD4 in Register TPTC2WRMPUSTADD4 */
#define TPTC2WRMPUSTADD4_TPTC2WRMPUSTADD4_BIT_START         0U
#define TPTC2WRMPUSTADD4_TPTC2WRMPUSTADD4_BIT_END           31U

/* Definition for field TPTC2WRMPUSTADD5 in Register TPTC2WRMPUSTADD5 */
#define TPTC2WRMPUSTADD5_TPTC2WRMPUSTADD5_BIT_START         0U
#define TPTC2WRMPUSTADD5_TPTC2WRMPUSTADD5_BIT_END           31U

/* Definition for field TPTC2WRMPUENDADD0 in Register TPTC2WRMPUENDADD0 */
#define TPTC2WRMPUENDADD0_TPTC2WRMPUENDADD0_BIT_START       0U
#define TPTC2WRMPUENDADD0_TPTC2WRMPUENDADD0_BIT_END         31U

/* Definition for field TPTC2WRMPUENDADD1 in Register TPTC2WRMPUENDADD1 */
#define TPTC2WRMPUENDADD1_TPTC2WRMPUENDADD1_BIT_START       0U
#define TPTC2WRMPUENDADD1_TPTC2WRMPUENDADD1_BIT_END         31U

/* Definition for field TPTC2WRMPUENDADD2 in Register TPTC2WRMPUENDADD2 */
#define TPTC2WRMPUENDADD2_TPTC2WRMPUENDADD2_BIT_START       0U
#define TPTC2WRMPUENDADD2_TPTC2WRMPUENDADD2_BIT_END         31U

/* Definition for field TPTC2WRMPUENDADD3 in Register TPTC2WRMPUENDADD3 */
#define TPTC2WRMPUENDADD3_TPTC2WRMPUENDADD3_BIT_START       0U
#define TPTC2WRMPUENDADD3_TPTC2WRMPUENDADD3_BIT_END         31U

/* Definition for field TPTC2WRMPUENDADD4 in Register TPTC2WRMPUENDADD4 */
#define TPTC2WRMPUENDADD4_TPTC2WRMPUENDADD4_BIT_START       0U
#define TPTC2WRMPUENDADD4_TPTC2WRMPUENDADD4_BIT_END         31U

/* Definition for field TPTC2WRMPUENDADD5 in Register TPTC2WRMPUENDADD5 */
#define TPTC2WRMPUENDADD5_TPTC2WRMPUENDADD5_BIT_START       0U
#define TPTC2WRMPUENDADD5_TPTC2WRMPUENDADD5_BIT_END         31U

/* Definition for field TPTC2WRMPUERRADD in Register TPTC2WRMPUERRADD */
#define TPTC2WRMPUERRADD_TPTC2WRMPUERRADD_BIT_START         0U
#define TPTC2WRMPUERRADD_TPTC2WRMPUERRADD_BIT_END           31U

/* Definition for field TPTC2RDMPUSTADD0 in Register TPTC2RDMPUSTADD0 */
#define TPTC2RDMPUSTADD0_TPTC2RDMPUSTADD0_BIT_START         0U
#define TPTC2RDMPUSTADD0_TPTC2RDMPUSTADD0_BIT_END           31U

/* Definition for field TPTC2RDMPUSTADD1 in Register TPTC2RDMPUSTADD1 */
#define TPTC2RDMPUSTADD1_TPTC2RDMPUSTADD1_BIT_START         0U
#define TPTC2RDMPUSTADD1_TPTC2RDMPUSTADD1_BIT_END           31U

/* Definition for field TPTC2RDMPUSTADD2 in Register TPTC2RDMPUSTADD2 */
#define TPTC2RDMPUSTADD2_TPTC2RDMPUSTADD2_BIT_START         0U
#define TPTC2RDMPUSTADD2_TPTC2RDMPUSTADD2_BIT_END           31U

/* Definition for field TPTC2RDMPUSTADD3 in Register TPTC2RDMPUSTADD3 */
#define TPTC2RDMPUSTADD3_TPTC2RDMPUSTADD3_BIT_START         0U
#define TPTC2RDMPUSTADD3_TPTC2RDMPUSTADD3_BIT_END           31U

/* Definition for field TPTC2RDMPUSTADD4 in Register TPTC2RDMPUSTADD4 */
#define TPTC2RDMPUSTADD4_TPTC2RDMPUSTADD4_BIT_START         0U
#define TPTC2RDMPUSTADD4_TPTC2RDMPUSTADD4_BIT_END           31U

/* Definition for field TPTC2RDMPUSTADD5 in Register TPTC2RDMPUSTADD5 */
#define TPTC2RDMPUSTADD5_TPTC2RDMPUSTADD5_BIT_START         0U
#define TPTC2RDMPUSTADD5_TPTC2RDMPUSTADD5_BIT_END           31U

/* Definition for field TPTC2RDMPUENDADD0 in Register TPTC2RDMPUENDADD0 */
#define TPTC2RDMPUENDADD0_TPTC2RDMPUENDADD0_BIT_START       0U
#define TPTC2RDMPUENDADD0_TPTC2RDMPUENDADD0_BIT_END         31U

/* Definition for field TPTC2RDMPUENDADD1 in Register TPTC2RDMPUENDADD1 */
#define TPTC2RDMPUENDADD1_TPTC2RDMPUENDADD1_BIT_START       0U
#define TPTC2RDMPUENDADD1_TPTC2RDMPUENDADD1_BIT_END         31U

/* Definition for field TPTC2RDMPUENDADD2 in Register TPTC2RDMPUENDADD2 */
#define TPTC2RDMPUENDADD2_TPTC2RDMPUENDADD2_BIT_START       0U
#define TPTC2RDMPUENDADD2_TPTC2RDMPUENDADD2_BIT_END         31U

/* Definition for field TPTC2RDMPUENDADD3 in Register TPTC2RDMPUENDADD3 */
#define TPTC2RDMPUENDADD3_TPTC2RDMPUENDADD3_BIT_START       0U
#define TPTC2RDMPUENDADD3_TPTC2RDMPUENDADD3_BIT_END         31U

/* Definition for field TPTC2RDMPUENDADD4 in Register TPTC2RDMPUENDADD4 */
#define TPTC2RDMPUENDADD4_TPTC2RDMPUENDADD4_BIT_START       0U
#define TPTC2RDMPUENDADD4_TPTC2RDMPUENDADD4_BIT_END         31U

/* Definition for field TPTC2RDMPUENDADD5 in Register TPTC2RDMPUENDADD5 */
#define TPTC2RDMPUENDADD5_TPTC2RDMPUENDADD5_BIT_START       0U
#define TPTC2RDMPUENDADD5_TPTC2RDMPUENDADD5_BIT_END         31U

/* Definition for field TPTC2RDMPUERRADD in Register TPTC2RDMPUERRADD */
#define TPTC2RDMPUERRADD_TPTC2RDMPUERRADD_BIT_START         0U
#define TPTC2RDMPUERRADD_TPTC2RDMPUERRADD_BIT_END           31U

/* Definition for field TPTC3WRMPUSTADD0 in Register TPTC3WRMPUSTADD0 */
#define TPTC3WRMPUSTADD0_TPTC3WRMPUSTADD0_BIT_START         0U
#define TPTC3WRMPUSTADD0_TPTC3WRMPUSTADD0_BIT_END           31U

/* Definition for field TPTC3WRMPUSTADD1 in Register TPTC3WRMPUSTADD1 */
#define TPTC3WRMPUSTADD1_TPTC3WRMPUSTADD1_BIT_START         0U
#define TPTC3WRMPUSTADD1_TPTC3WRMPUSTADD1_BIT_END           31U

/* Definition for field TPTC3WRMPUSTADD2 in Register TPTC3WRMPUSTADD2 */
#define TPTC3WRMPUSTADD2_TPTC3WRMPUSTADD2_BIT_START         0U
#define TPTC3WRMPUSTADD2_TPTC3WRMPUSTADD2_BIT_END           31U

/* Definition for field TPTC3WRMPUSTADD3 in Register TPTC3WRMPUSTADD3 */
#define TPTC3WRMPUSTADD3_TPTC3WRMPUSTADD3_BIT_START         0U
#define TPTC3WRMPUSTADD3_TPTC3WRMPUSTADD3_BIT_END           31U

/* Definition for field TPTC3WRMPUSTADD4 in Register TPTC3WRMPUSTADD4 */
#define TPTC3WRMPUSTADD4_TPTC3WRMPUSTADD4_BIT_START         0U
#define TPTC3WRMPUSTADD4_TPTC3WRMPUSTADD4_BIT_END           31U

/* Definition for field TPTC3WRMPUSTADD5 in Register TPTC3WRMPUSTADD5 */
#define TPTC3WRMPUSTADD5_TPTC3WRMPUSTADD5_BIT_START         0U
#define TPTC3WRMPUSTADD5_TPTC3WRMPUSTADD5_BIT_END           31U

/* Definition for field TPTC3WRMPUENDADD0 in Register TPTC3WRMPUENDADD0 */
#define TPTC3WRMPUENDADD0_TPTC3WRMPUENDADD0_BIT_START       0U
#define TPTC3WRMPUENDADD0_TPTC3WRMPUENDADD0_BIT_END         31U

/* Definition for field TPTC3WRMPUENDADD1 in Register TPTC3WRMPUENDADD1 */
#define TPTC3WRMPUENDADD1_TPTC3WRMPUENDADD1_BIT_START       0U
#define TPTC3WRMPUENDADD1_TPTC3WRMPUENDADD1_BIT_END         31U

/* Definition for field TPTC3WRMPUENDADD2 in Register TPTC3WRMPUENDADD2 */
#define TPTC3WRMPUENDADD2_TPTC3WRMPUENDADD2_BIT_START       0U
#define TPTC3WRMPUENDADD2_TPTC3WRMPUENDADD2_BIT_END         31U

/* Definition for field TPTC3WRMPUENDADD3 in Register TPTC3WRMPUENDADD3 */
#define TPTC3WRMPUENDADD3_TPTC3WRMPUENDADD3_BIT_START       0U
#define TPTC3WRMPUENDADD3_TPTC3WRMPUENDADD3_BIT_END         31U

/* Definition for field TPTC3WRMPUENDADD4 in Register TPTC3WRMPUENDADD4 */
#define TPTC3WRMPUENDADD4_TPTC3WRMPUENDADD4_BIT_START       0U
#define TPTC3WRMPUENDADD4_TPTC3WRMPUENDADD4_BIT_END         31U

/* Definition for field TPTC3WRMPUENDADD5 in Register TPTC3WRMPUENDADD5 */
#define TPTC3WRMPUENDADD5_TPTC3WRMPUENDADD5_BIT_START       0U
#define TPTC3WRMPUENDADD5_TPTC3WRMPUENDADD5_BIT_END         31U

/* Definition for field TPTC3WRMPUERRADD in Register TPTC3WRMPUERRADD */
#define TPTC3WRMPUERRADD_TPTC3WRMPUERRADD_BIT_START         0U
#define TPTC3WRMPUERRADD_TPTC3WRMPUERRADD_BIT_END           31U

/* Definition for field TPTC3RDMPUSTADD0 in Register TPTC3RDMPUSTADD0 */
#define TPTC3RDMPUSTADD0_TPTC3RDMPUSTADD0_BIT_START         0U
#define TPTC3RDMPUSTADD0_TPTC3RDMPUSTADD0_BIT_END           31U

/* Definition for field TPTC3RDMPUSTADD1 in Register TPTC3RDMPUSTADD1 */
#define TPTC3RDMPUSTADD1_TPTC3RDMPUSTADD1_BIT_START         0U
#define TPTC3RDMPUSTADD1_TPTC3RDMPUSTADD1_BIT_END           31U

/* Definition for field TPTC3RDMPUSTADD2 in Register TPTC3RDMPUSTADD2 */
#define TPTC3RDMPUSTADD2_TPTC3RDMPUSTADD2_BIT_START         0U
#define TPTC3RDMPUSTADD2_TPTC3RDMPUSTADD2_BIT_END           31U

/* Definition for field TPTC3RDMPUSTADD3 in Register TPTC3RDMPUSTADD3 */
#define TPTC3RDMPUSTADD3_TPTC3RDMPUSTADD3_BIT_START         0U
#define TPTC3RDMPUSTADD3_TPTC3RDMPUSTADD3_BIT_END           31U

/* Definition for field TPTC3RDMPUSTADD4 in Register TPTC3RDMPUSTADD4 */
#define TPTC3RDMPUSTADD4_TPTC3RDMPUSTADD4_BIT_START         0U
#define TPTC3RDMPUSTADD4_TPTC3RDMPUSTADD4_BIT_END           31U

/* Definition for field TPTC3RDMPUSTADD5 in Register TPTC3RDMPUSTADD5 */
#define TPTC3RDMPUSTADD5_TPTC3RDMPUSTADD5_BIT_START         0U
#define TPTC3RDMPUSTADD5_TPTC3RDMPUSTADD5_BIT_END           31U

/* Definition for field TPTC3RDMPUENDADD0 in Register TPTC3RDMPUENDADD0 */
#define TPTC3RDMPUENDADD0_TPTC3RDMPUENDADD0_BIT_START       0U
#define TPTC3RDMPUENDADD0_TPTC3RDMPUENDADD0_BIT_END         31U

/* Definition for field TPTC3RDMPUENDADD1 in Register TPTC3RDMPUENDADD1 */
#define TPTC3RDMPUENDADD1_TPTC3RDMPUENDADD1_BIT_START       0U
#define TPTC3RDMPUENDADD1_TPTC3RDMPUENDADD1_BIT_END         31U

/* Definition for field TPTC3RDMPUENDADD2 in Register TPTC3RDMPUENDADD2 */
#define TPTC3RDMPUENDADD2_TPTC3RDMPUENDADD2_BIT_START       0U
#define TPTC3RDMPUENDADD2_TPTC3RDMPUENDADD2_BIT_END         31U

/* Definition for field TPTC3RDMPUENDADD3 in Register TPTC3RDMPUENDADD3 */
#define TPTC3RDMPUENDADD3_TPTC3RDMPUENDADD3_BIT_START       0U
#define TPTC3RDMPUENDADD3_TPTC3RDMPUENDADD3_BIT_END         31U

/* Definition for field TPTC3RDMPUENDADD4 in Register TPTC3RDMPUENDADD4 */
#define TPTC3RDMPUENDADD4_TPTC3RDMPUENDADD4_BIT_START       0U
#define TPTC3RDMPUENDADD4_TPTC3RDMPUENDADD4_BIT_END         31U

/* Definition for field TPTC3RDMPUENDADD5 in Register TPTC3RDMPUENDADD5 */
#define TPTC3RDMPUENDADD5_TPTC3RDMPUENDADD5_BIT_START       0U
#define TPTC3RDMPUENDADD5_TPTC3RDMPUENDADD5_BIT_END         31U

/* Definition for field TPTC3RDMPUERRADD in Register TPTC3RDMPUERRADD */
#define TPTC3RDMPUERRADD_TPTC3RDMPUERRADD_BIT_START         0U
#define TPTC3RDMPUERRADD_TPTC3RDMPUERRADD_BIT_END           31U

/* Definition for field TPTC2WRMPURNGVLD in Register TPTCMPUVALIDCFG2 */
#define TPTCMPUVALIDCFG2_TPTC2WRMPURNGVLD_BIT_START         0U
#define TPTCMPUVALIDCFG2_TPTC2WRMPURNGVLD_BIT_END           7U

/* Definition for field TPTC2RDMPURNGVLD in Register TPTCMPUVALIDCFG2 */
#define TPTCMPUVALIDCFG2_TPTC2RDMPURNGVLD_BIT_START         8U
#define TPTCMPUVALIDCFG2_TPTC2RDMPURNGVLD_BIT_END           15U

/* Definition for field TPTC3WRMPURNGVLD in Register TPTCMPUVALIDCFG2 */
#define TPTCMPUVALIDCFG2_TPTC3WRMPURNGVLD_BIT_START         16U
#define TPTCMPUVALIDCFG2_TPTC3WRMPURNGVLD_BIT_END           23U

/* Definition for field TPTC3RDMPURNGVLD in Register TPTCMPUVALIDCFG2 */
#define TPTCMPUVALIDCFG2_TPTC3RDMPURNGVLD_BIT_START         24U
#define TPTCMPUVALIDCFG2_TPTC3RDMPURNGVLD_BIT_END           31U

/* Definition for field TPTC2WRMPUEN in Register TPTCMPUENCFG2 */
#define TPTCMPUENCFG2_TPTC2WRMPUEN_BIT_START                0U
#define TPTCMPUENCFG2_TPTC2WRMPUEN_BIT_END                  0U

/* Definition for field TPTC2RDMPUEN in Register TPTCMPUENCFG2 */
#define TPTCMPUENCFG2_TPTC2RDMPUEN_BIT_START                1U
#define TPTCMPUENCFG2_TPTC2RDMPUEN_BIT_END                  1U

/* Definition for field TPTC3WRMPUEN in Register TPTCMPUENCFG2 */
#define TPTCMPUENCFG2_TPTC3WRMPUEN_BIT_START                2U
#define TPTCMPUENCFG2_TPTC3WRMPUEN_BIT_END                  2U

/* Definition for field TPTC3RDMPUEN in Register TPTCMPUENCFG2 */
#define TPTCMPUENCFG2_TPTC3RDMPUEN_BIT_START                3U
#define TPTCMPUENCFG2_TPTC3RDMPUEN_BIT_END                  3U

/* Definition for field TPTC2WRMPUERRCLR in Register TPTCMPUENCFG2 */
#define TPTCMPUENCFG2_TPTC2WRMPUERRCLR_BIT_START            4U
#define TPTCMPUENCFG2_TPTC2WRMPUERRCLR_BIT_END              4U

/* Definition for field TPTC2RDMPUERRCLR in Register TPTCMPUENCFG2 */
#define TPTCMPUENCFG2_TPTC2RDMPUERRCLR_BIT_START            5U
#define TPTCMPUENCFG2_TPTC2RDMPUERRCLR_BIT_END              5U

/* Definition for field TPTC3WRMPUERRCLR in Register TPTCMPUENCFG2 */
#define TPTCMPUENCFG2_TPTC3WRMPUERRCLR_BIT_START            6U
#define TPTCMPUENCFG2_TPTC3WRMPUERRCLR_BIT_END              6U

/* Definition for field TPTC3RDMPUERRCLR in Register TPTCMPUENCFG2 */
#define TPTCMPUENCFG2_TPTC3RDMPUERRCLR_BIT_START            7U
#define TPTCMPUENCFG2_TPTC3RDMPUERRCLR_BIT_END              7U

/* Definition for field L3ECCEN in Register L3ECCCFG1 */
#define L3ECCCFG1_L3ECCEN_BIT_START                         0U
#define L3ECCCFG1_L3ECCEN_BIT_END                           0U

/* Definition for field L3ECCERRCLR in Register L3ECCCFG1 */
#define L3ECCCFG1_L3ECCERRCLR_BIT_START                     1U
#define L3ECCCFG1_L3ECCERRCLR_BIT_END                       1U

/* Definition for field L3ECCERRSTAT in Register L3ECCCFG1 */
#define L3ECCCFG1_L3ECCERRSTAT_BIT_START                    2U
#define L3ECCCFG1_L3ECCERRSTAT_BIT_END                      2U

/* Definition for field L3ECCREPAIREDBIT in Register L3ECCCFG1 */
#define L3ECCCFG1_L3ECCREPAIREDBIT_BIT_START                3U
#define L3ECCCFG1_L3ECCREPAIREDBIT_BIT_END                  26U

/* Definition for field L3ECCFAULTADDR in Register L3ECCCFG2 */
#define L3ECCCFG2_L3ECCFAULTADDR_BIT_START                  0U
#define L3ECCCFG2_L3ECCFAULTADDR_BIT_END                    16U

/* Definition for field MSSSWIRQ1 in Register DSS2MSSSWIRQ */
#define DSS2MSSSWIRQ_MSSSWIRQ1_BIT_START                    0U
#define DSS2MSSSWIRQ_MSSSWIRQ1_BIT_END                      0U

/* Definition for field MSSSWIRQ2 in Register DSS2MSSSWIRQ */
#define DSS2MSSSWIRQ_MSSSWIRQ2_BIT_START                    1U
#define DSS2MSSSWIRQ_MSSSWIRQ2_BIT_END                      1U



/**
 * @struct DSS2Regs_t
 * @brief
 *   Module DSS_REG2 Register Definition
 * @details
 *   This structure is used to access the DSS_REG2 module registers.
 */
/**
 * @typedef DSS2Regs
 * @brief
 *   Module DSS_REG2 Register Frame type Definition
 * @details
 *   This type is used to access the DSS_REG2 module registers.
 */
typedef volatile struct DSS2Regs_t
{
    uint32_t    RESTRICTED1[64]                    ;        /* Offset = 0x000 */
    uint32_t    TPTC2WRMPUSTADD0                   ;        /* Offset = 0x100 */
    uint32_t    TPTC2WRMPUSTADD1                   ;        /* Offset = 0x104 */
    uint32_t    TPTC2WRMPUSTADD2                   ;        /* Offset = 0x108 */
    uint32_t    TPTC2WRMPUSTADD3                   ;        /* Offset = 0x10C */
    uint32_t    TPTC2WRMPUSTADD4                   ;        /* Offset = 0x110 */
    uint32_t    TPTC2WRMPUSTADD5                   ;        /* Offset = 0x114 */
    uint32_t    RESTRICTED2[2]                     ;        /* Offset = 0x118 */
    uint32_t    TPTC2WRMPUENDADD0                  ;        /* Offset = 0x120 */
    uint32_t    TPTC2WRMPUENDADD1                  ;        /* Offset = 0x124 */
    uint32_t    TPTC2WRMPUENDADD2                  ;        /* Offset = 0x128 */
    uint32_t    TPTC2WRMPUENDADD3                  ;        /* Offset = 0x12C */
    uint32_t    TPTC2WRMPUENDADD4                  ;        /* Offset = 0x130 */
    uint32_t    TPTC2WRMPUENDADD5                  ;        /* Offset = 0x134 */
    uint32_t    RESTRICTED3[2]                     ;        /* Offset = 0x138 */
    uint32_t    TPTC2WRMPUERRADD                   ;        /* Offset = 0x140 */
    uint32_t    RESTRICTED4                        ;        /* Offset = 0x144 */
    uint32_t    TPTC2RDMPUSTADD0                   ;        /* Offset = 0x148 */
    uint32_t    TPTC2RDMPUSTADD1                   ;        /* Offset = 0x14C */
    uint32_t    TPTC2RDMPUSTADD2                   ;        /* Offset = 0x150 */
    uint32_t    TPTC2RDMPUSTADD3                   ;        /* Offset = 0x154 */
    uint32_t    TPTC2RDMPUSTADD4                   ;        /* Offset = 0x158 */
    uint32_t    TPTC2RDMPUSTADD5                   ;        /* Offset = 0x15C */
    uint32_t    RESTRICTED5[2]                     ;        /* Offset = 0x160 */
    uint32_t    TPTC2RDMPUENDADD0                  ;        /* Offset = 0x168 */
    uint32_t    TPTC2RDMPUENDADD1                  ;        /* Offset = 0x16C */
    uint32_t    TPTC2RDMPUENDADD2                  ;        /* Offset = 0x170 */
    uint32_t    TPTC2RDMPUENDADD3                  ;        /* Offset = 0x174 */
    uint32_t    TPTC2RDMPUENDADD4                  ;        /* Offset = 0x178 */
    uint32_t    TPTC2RDMPUENDADD5                  ;        /* Offset = 0x17C */
    uint32_t    RESTRICTED6[2]                     ;        /* Offset = 0x180 */
    uint32_t    TPTC2RDMPUERRADD                   ;        /* Offset = 0x188 */
    uint32_t    TPTC3WRMPUSTADD0                   ;        /* Offset = 0x18C */
    uint32_t    TPTC3WRMPUSTADD1                   ;        /* Offset = 0x190 */
    uint32_t    TPTC3WRMPUSTADD2                   ;        /* Offset = 0x194 */
    uint32_t    TPTC3WRMPUSTADD3                   ;        /* Offset = 0x198 */
    uint32_t    TPTC3WRMPUSTADD4                   ;        /* Offset = 0x19C */
    uint32_t    TPTC3WRMPUSTADD5                   ;        /* Offset = 0x1A0 */
    uint32_t    RESTRICTED7[2]                     ;        /* Offset = 0x1A4 */
    uint32_t    TPTC3WRMPUENDADD0                  ;        /* Offset = 0x1AC */
    uint32_t    TPTC3WRMPUENDADD1                  ;        /* Offset = 0x1B0 */
    uint32_t    TPTC3WRMPUENDADD2                  ;        /* Offset = 0x1B4 */
    uint32_t    TPTC3WRMPUENDADD3                  ;        /* Offset = 0x1B8 */
    uint32_t    TPTC3WRMPUENDADD4                  ;        /* Offset = 0x1BC */
    uint32_t    TPTC3WRMPUENDADD5                  ;        /* Offset = 0x1C0 */
    uint32_t    RESTRICTED8[2]                     ;        /* Offset = 0x1C4 */
    uint32_t    TPTC3WRMPUERRADD                   ;        /* Offset = 0x1CC */
    uint32_t    TPTC3RDMPUSTADD0                   ;        /* Offset = 0x1D0 */
    uint32_t    TPTC3RDMPUSTADD1                   ;        /* Offset = 0x1D4 */
    uint32_t    TPTC3RDMPUSTADD2                   ;        /* Offset = 0x1D8 */
    uint32_t    TPTC3RDMPUSTADD3                   ;        /* Offset = 0x1DC */
    uint32_t    TPTC3RDMPUSTADD4                   ;        /* Offset = 0x1E0 */
    uint32_t    TPTC3RDMPUSTADD5                   ;        /* Offset = 0x1E4 */
    uint32_t    RESTRICTED9[2]                     ;        /* Offset = 0x1E8 */
    uint32_t    TPTC3RDMPUENDADD0                  ;        /* Offset = 0x1F0 */
    uint32_t    TPTC3RDMPUENDADD1                  ;        /* Offset = 0x1F4 */
    uint32_t    TPTC3RDMPUENDADD2                  ;        /* Offset = 0x1F8 */
    uint32_t    TPTC3RDMPUENDADD3                  ;        /* Offset = 0x1FC */
    uint32_t    TPTC3RDMPUENDADD4                  ;        /* Offset = 0x200 */
    uint32_t    TPTC3RDMPUENDADD5                  ;        /* Offset = 0x204 */
    uint32_t    RESTRICTED10[2]                    ;        /* Offset = 0x208 */
    uint32_t    TPTC3RDMPUERRADD                   ;        /* Offset = 0x210 */
    uint32_t    TPTCMPUVALIDCFG2                   ;        /* Offset = 0x214 */
    uint32_t    TPTCMPUENCFG2                      ;        /* Offset = 0x218 */
    uint32_t    RESTRICTED11[19]                   ;        /* Offset = 0x21C */
    uint32_t    L3ECCCFG1                          ;        /* Offset = 0x268 */
    uint32_t    L3ECCCFG2                          ;        /* Offset = 0x26C */
    uint32_t    DSS2MSSSWIRQ                       ;        /* Offset = 0x270 */
} DSS2Regs;

#ifdef __cplusplus
}
#endif

#endif /* REG_DSS2_H */
/* END OF REG_DSS2_H */

