/**
 *  @file    reg_gpcfg_xwr16xx.h
 *
 *  @brief
 *    This file gives register definitions of MSS_GPCFG_REG module.
 *
 *  This file is auto-generated on 3/27/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT,  STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef REG_GPCFG_H
#define REG_GPCFG_H

/****************************************************************************************
 * INCLUDE FILES
 ****************************************************************************************/
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* Definition for field GPCFG0 in Register GPCFG0 */
#define GPCFG0_GPCFG0_BIT_START                             0U
#define GPCFG0_GPCFG0_BIT_END                               31U

/* Definition for field GPCFG1 in Register GPCFG1 */
#define GPCFG1_GPCFG1_BIT_START                             0U
#define GPCFG1_GPCFG1_BIT_END                               31U

/* Definition for field GPCFG2 in Register GPCFG2 */
#define GPCFG2_GPCFG2_BIT_START                             0U
#define GPCFG2_GPCFG2_BIT_END                               31U

/* Definition for field GPCFG3 in Register GPCFG3 */
#define GPCFG3_GPCFG3_BIT_START                             0U
#define GPCFG3_GPCFG3_BIT_END                               31U

/* Definition for field GPCFG4 in Register GPCFG4 */
#define GPCFG4_GPCFG4_BIT_START                             0U
#define GPCFG4_GPCFG4_BIT_END                               31U

/* Definition for field MSS2BSSSWIRQ1 in Register GPCFG11 */
#define GPCFG11_MSS2BSSSWIRQ1_BIT_START                     0U
#define GPCFG11_MSS2BSSSWIRQ1_BIT_END                       0U

/* Definition for field MSS2BSSSWIRQ2 in Register GPCFG11 */
#define GPCFG11_MSS2BSSSWIRQ2_BIT_START                     1U
#define GPCFG11_MSS2BSSSWIRQ2_BIT_END                       1U

/* Definition for field DSS2BSSSWIRQ1 in Register GPCFG11 */
#define GPCFG11_DSS2BSSSWIRQ1_BIT_START                     8U
#define GPCFG11_DSS2BSSSWIRQ1_BIT_END                       8U

/* Definition for field DSS2BSSSWIRQ2 in Register GPCFG11 */
#define GPCFG11_DSS2BSSSWIRQ2_BIT_START                     9U
#define GPCFG11_DSS2BSSSWIRQ2_BIT_END                       9U

/* Definition for field BSS2DSSSWIRQ1 in Register GPCFG11 */
#define GPCFG11_BSS2DSSSWIRQ1_BIT_START                     16U
#define GPCFG11_BSS2DSSSWIRQ1_BIT_END                       16U

/* Definition for field BSS2DSSSWIRQ2 in Register GPCFG11 */
#define GPCFG11_BSS2DSSSWIRQ2_BIT_START                     17U
#define GPCFG11_BSS2DSSSWIRQ2_BIT_END                       17U

/* Definition for field CCCA_CLOCK0_SEL in Register CCCACFG0 */
#define CCCACFG0_CCCA_CLOCK0_SEL_BIT_START                  0U
#define CCCACFG0_CCCA_CLOCK0_SEL_BIT_END                    2U

/* Definition for field CCCA_CLOCK1_SEL in Register CCCACFG0 */
#define CCCACFG0_CCCA_CLOCK1_SEL_BIT_START                  3U
#define CCCACFG0_CCCA_CLOCK1_SEL_BIT_END                    5U

/* Definition for field CCCA_DISABLE_CLOCKS in Register CCCACFG0 */
#define CCCACFG0_CCCA_DISABLE_CLOCKS_BIT_START              6U
#define CCCACFG0_CCCA_DISABLE_CLOCKS_BIT_END                6U

/* Definition for field CCCA_ENABLE_MODULE in Register CCCACFG0 */
#define CCCACFG0_CCCA_ENABLE_MODULE_BIT_START               7U
#define CCCACFG0_CCCA_ENABLE_MODULE_BIT_END                 7U

/* Definition for field CCCA_SINGLE_SHOT_MODE in Register CCCACFG0 */
#define CCCACFG0_CCCA_SINGLE_SHOT_MODE_BIT_START            8U
#define CCCACFG0_CCCA_SINGLE_SHOT_MODE_BIT_END              8U

/* Definition for field CCCA_MARGIN_COUNT in Register CCCACFG0 */
#define CCCACFG0_CCCA_MARGIN_COUNT_BIT_START                16U
#define CCCACFG0_CCCA_MARGIN_COUNT_BIT_END                  31U

/* Definition for field CCCACFG1 in Register CCCACFG1 */
#define CCCACFG1_CCCACFG1_BIT_START                         0U
#define CCCACFG1_CCCACFG1_BIT_END                           31U

/* Definition for field CCCACFG2 in Register CCCACFG2 */
#define CCCACFG2_CCCACFG2_BIT_START                         0U
#define CCCACFG2_CCCACFG2_BIT_END                           31U

/* Definition for field CCCACFG3 in Register CCCACFG3 */
#define CCCACFG3_CCCACFG3_BIT_START                         0U
#define CCCACFG3_CCCACFG3_BIT_END                           31U

/* Definition for field CCCB_CLOCK0_SEL in Register CCCBCFG0 */
#define CCCBCFG0_CCCB_CLOCK0_SEL_BIT_START                  0U
#define CCCBCFG0_CCCB_CLOCK0_SEL_BIT_END                    2U

/* Definition for field CCCB_CLOCK1_SEL in Register CCCBCFG0 */
#define CCCBCFG0_CCCB_CLOCK1_SEL_BIT_START                  3U
#define CCCBCFG0_CCCB_CLOCK1_SEL_BIT_END                    5U

/* Definition for field CCCB_DISABLE_CLOCKS in Register CCCBCFG0 */
#define CCCBCFG0_CCCB_DISABLE_CLOCKS_BIT_START              6U
#define CCCBCFG0_CCCB_DISABLE_CLOCKS_BIT_END                6U

/* Definition for field CCCB_ENABLE_MODULE in Register CCCBCFG0 */
#define CCCBCFG0_CCCB_ENABLE_MODULE_BIT_START               7U
#define CCCBCFG0_CCCB_ENABLE_MODULE_BIT_END                 7U

/* Definition for field CCCB_SINGLE_SHOT_MODE in Register CCCBCFG0 */
#define CCCBCFG0_CCCB_SINGLE_SHOT_MODE_BIT_START            8U
#define CCCBCFG0_CCCB_SINGLE_SHOT_MODE_BIT_END              8U

/* Definition for field CCCB_MARGIN_COUNT in Register CCCBCFG0 */
#define CCCBCFG0_CCCB_MARGIN_COUNT_BIT_START                16U
#define CCCBCFG0_CCCB_MARGIN_COUNT_BIT_END                  31U

/* Definition for field CCCBCFG1 in Register CCCBCFG1 */
#define CCCBCFG1_CCCBCFG1_BIT_START                         0U
#define CCCBCFG1_CCCBCFG1_BIT_END                           31U

/* Definition for field CCCBCFG2 in Register CCCBCFG2 */
#define CCCBCFG2_CCCBCFG2_BIT_START                         0U
#define CCCBCFG2_CCCBCFG2_BIT_END                           31U

/* Definition for field CCCBCFG3 in Register CCCBCFG3 */
#define CCCBCFG3_CCCBCFG3_BIT_START                         0U
#define CCCBCFG3_CCCBCFG3_BIT_END                           31U

/* Definition for field CCCACNTVAL in Register CCCACNTVAL */
#define CCCACNTVAL_CCCACNTVAL_BIT_START                     0U
#define CCCACNTVAL_CCCACNTVAL_BIT_END                       31U

/* Definition for field CCCBCNTVAL in Register CCCBCNTVAL */
#define CCCBCNTVAL_CCCBCNTVAL_BIT_START                     0U
#define CCCBCNTVAL_CCCBCNTVAL_BIT_END                       31U

/* Definition for field CCCABERRSTAT in Register CCCABERRSTAT */
#define CCCABERRSTAT_CCCABERRSTAT_BIT_START                 0U
#define CCCABERRSTAT_CCCABERRSTAT_BIT_END                   31U

/* Definition for field USERMODEEN in Register USERMODEEN */
#define USERMODEEN_USERMODEEN_BIT_START                     0U
#define USERMODEEN_USERMODEEN_BIT_END                       31U

/* Definition for field EPWMCFG in Register EPWMCFG */
#define EPWMCFG_EPWMCFG_BIT_START                           0U
#define EPWMCFG_EPWMCFG_BIT_END                             31U

/* Definition for field DMMSWINT0 in Register DMMSWINT0 */
#define DMMSWINT0_DMMSWINT0_BIT_START                       0U
#define DMMSWINT0_DMMSWINT0_BIT_END                         31U

/* Definition for field DMMSWINT1 in Register DMMSWINT1 */
#define DMMSWINT1_DMMSWINT1_BIT_START                       0U
#define DMMSWINT1_DMMSWINT1_BIT_END                         31U

/* Definition for field DMMSWINTSEL0 in Register DMMSWINTSEL0 */
#define DMMSWINTSEL0_DMMSWINTSEL0_BIT_START                 0U
#define DMMSWINTSEL0_DMMSWINTSEL0_BIT_END                   31U

/* Definition for field DMMSWINTSEL1 in Register DMMSWINTSEL1 */
#define DMMSWINTSEL1_DMMSWINTSEL1_BIT_START                 0U
#define DMMSWINTSEL1_DMMSWINTSEL1_BIT_END                   31U

/* Definition for field ENABLECCBERRNMI in Register CCCBWDEN */
#define CCCBWDEN_ENABLECCBERRNMI_BIT_START                  0U
#define CCCBWDEN_ENABLECCBERRNMI_BIT_END                    0U

/* Definition for field ENABLECCBERRRSTN in Register CCCBWDEN */
#define CCCBWDEN_ENABLECCBERRRSTN_BIT_START                 16U
#define CCCBWDEN_ENABLECCBERRRSTN_BIT_END                   16U

/* Definition for field GPIO0EDGESEL in Register GPIOINTREDGESEL */
#define GPIOINTREDGESEL_GPIO0EDGESEL_BIT_START              0U
#define GPIOINTREDGESEL_GPIO0EDGESEL_BIT_END                0U

/* Definition for field GPIO1EDGESEL in Register GPIOINTREDGESEL */
#define GPIOINTREDGESEL_GPIO1EDGESEL_BIT_START              1U
#define GPIOINTREDGESEL_GPIO1EDGESEL_BIT_END                1U

/* Definition for field GPIO2EDGESEL in Register GPIOINTREDGESEL */
#define GPIOINTREDGESEL_GPIO2EDGESEL_BIT_START              2U
#define GPIOINTREDGESEL_GPIO2EDGESEL_BIT_END                2U

/* Definition for field PWMDMATRIGEN in Register PWMDMATRIGEN */
#define PWMDMATRIGEN_PWMDMATRIGEN_BIT_START                 0U
#define PWMDMATRIGEN_PWMDMATRIGEN_BIT_END                   3U

/* Definition for field JTAGTXDATA in Register JTAGTXDATA */
#define JTAGTXDATA_JTAGTXDATA_BIT_START                     0U
#define JTAGTXDATA_JTAGTXDATA_BIT_END                       31U

/* Definition for field JTAGTXCONTROL in Register JTAGTXCONTROL */
#define JTAGTXCONTROL_JTAGTXCONTROL_BIT_START               0U
#define JTAGTXCONTROL_JTAGTXCONTROL_BIT_END                 31U

/* Definition for field JTAGRXDATA in Register JTAGRXDATA */
#define JTAGRXDATA_JTAGRXDATA_BIT_START                     0U
#define JTAGRXDATA_JTAGRXDATA_BIT_END                       31U

/* Definition for field JTAGTXDATARD in Register JTAGTXRXACK */
#define JTAGTXRXACK_JTAGTXDATARD_BIT_START                  0U
#define JTAGTXRXACK_JTAGTXDATARD_BIT_END                    0U

/* Definition for field JTAGRXDATAWR in Register JTAGTXRXACK */
#define JTAGTXRXACK_JTAGRXDATAWR_BIT_START                  8U
#define JTAGTXRXACK_JTAGRXDATAWR_BIT_END                    8U

/* Definition for field JTAGRXCONTROL in Register JTAGRXCONTROL */
#define JTAGRXCONTROL_JTAGRXCONTROL_BIT_START               0U
#define JTAGRXCONTROL_JTAGRXCONTROL_BIT_END                 31U

/* Definition for field MSS2GEMSWIRQ1 in Register MSS2GEMSWIRQ */
#define MSS2GEMSWIRQ_MSS2GEMSWIRQ1_BIT_START                0U
#define MSS2GEMSWIRQ_MSS2GEMSWIRQ1_BIT_END                  0U

/* Definition for field MSS2GEMSWIRQ2 in Register MSS2GEMSWIRQ */
#define MSS2GEMSWIRQ_MSS2GEMSWIRQ2_BIT_START                1U
#define MSS2GEMSWIRQ_MSS2GEMSWIRQ2_BIT_END                  1U

/* Definition for field CSETBFLUSHIN in Register CSETBFLUSH */
#define CSETBFLUSH_CSETBFLUSHIN_BIT_START                   0U
#define CSETBFLUSH_CSETBFLUSHIN_BIT_END                     0U

/* Definition for field CSETBFLUSHINACK in Register CSETBFLUSH */
#define CSETBFLUSH_CSETBFLUSHINACK_BIT_START                8U
#define CSETBFLUSH_CSETBFLUSHINACK_BIT_END                  8U

/* Definition for field CSETBACQ_OMPLETE in Register CSETBFLUSH */
#define CSETBFLUSH_CSETBACQ_OMPLETE_BIT_START               9U
#define CSETBFLUSH_CSETBACQ_OMPLETE_BIT_END                 9U

/* Definition for field CSETBFULL in Register CSETBFLUSH */
#define CSETBFLUSH_CSETBFULL_BIT_START                      10U
#define CSETBFLUSH_CSETBFULL_BIT_END                        10U



/**
 * @struct GPCFGRegs_t
 * @brief
 *   Module MSS_GPCFG_REG Register Definition
 * @details
 *   This structure is used to access the MSS_GPCFG_REG module registers.
 */
/**
 * @typedef GPCFGRegs
 * @brief
 *   Module MSS_GPCFG_REG Register Frame type Definition
 * @details
 *   This type is used to access the MSS_GPCFG_REG module registers.
 */
typedef volatile struct GPCFGRegs_t
{
    uint32_t    GPCFG0                             ;        /* Offset = 0x000 */
    uint32_t    GPCFG1                             ;        /* Offset = 0x004 */
    uint32_t    GPCFG2                             ;        /* Offset = 0x008 */
    uint32_t    GPCFG3                             ;        /* Offset = 0x00C */
    uint32_t    GPCFG4                             ;        /* Offset = 0x010 */
    uint32_t    RESTRICTED1[6]                     ;        /* Offset = 0x014 */
    uint32_t    GPCFG11                            ;        /* Offset = 0x02C */
    uint32_t    RESTRICTED2[40]                    ;        /* Offset = 0x030 */
    uint32_t    CCCACFG0                           ;        /* Offset = 0x0D0 */
    uint32_t    CCCACFG1                           ;        /* Offset = 0x0D4 */
    uint32_t    CCCACFG2                           ;        /* Offset = 0x0D8 */
    uint32_t    CCCACFG3                           ;        /* Offset = 0x0DC */
    uint32_t    CCCBCFG0                           ;        /* Offset = 0x0E0 */
    uint32_t    CCCBCFG1                           ;        /* Offset = 0x0E4 */
    uint32_t    CCCBCFG2                           ;        /* Offset = 0x0E8 */
    uint32_t    CCCBCFG3                           ;        /* Offset = 0x0EC */
    uint32_t    CCCACNTVAL                         ;        /* Offset = 0x0F0 */
    uint32_t    CCCBCNTVAL                         ;        /* Offset = 0x0F4 */
    uint32_t    CCCABERRSTAT                       ;        /* Offset = 0x0F8 */
    uint32_t    USERMODEEN                         ;        /* Offset = 0x0FC */
    uint32_t    RESTRICTED3[16]                    ;        /* Offset = 0x100 */
    uint32_t    EPWMCFG                            ;        /* Offset = 0x140 */
    uint32_t    RESTRICTED4                        ;        /* Offset = 0x144 */
    uint32_t    DMMSWINT0                          ;        /* Offset = 0x148 */
    uint32_t    DMMSWINT1                          ;        /* Offset = 0x14C */
    uint32_t    DMMSWINTSEL0                       ;        /* Offset = 0x150 */
    uint32_t    DMMSWINTSEL1                       ;        /* Offset = 0x154 */
    uint32_t    CCCBWDEN                           ;        /* Offset = 0x158 */
    uint32_t    GPIOINTREDGESEL                    ;        /* Offset = 0x15C */
    uint32_t    RESTRICTED5                        ;        /* Offset = 0x160 */
    uint32_t    PWMDMATRIGEN                       ;        /* Offset = 0x164 */
    uint32_t    JTAGTXDATA                         ;        /* Offset = 0x168 */
    uint32_t    JTAGTXCONTROL                      ;        /* Offset = 0x16C */
    uint32_t    JTAGRXDATA                         ;        /* Offset = 0x170 */
    uint32_t    RESTRICTED6                        ;        /* Offset = 0x174 */
    uint32_t    JTAGTXRXACK                        ;        /* Offset = 0x178 */
    uint32_t    JTAGRXCONTROL                      ;        /* Offset = 0x17C */
    uint32_t    MSS2GEMSWIRQ                       ;        /* Offset = 0x180 */
    uint32_t    CSETBFLUSH                         ;        /* Offset = 0x184 */
} GPCFGRegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_GPCFG_H */
/* END OF REG_GPCFG_H */

