/**
 *  @file    reg_dss_xwr14xx.h
 *
 *  @brief
 *    This file gives register definitions of DSS_REG module.
 *
 *  This file is auto-generated on 3/27/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define TESTPATTERNRX3ICFG_TSTPATRX3IINCR_BIT_END           31U

/* Definition for field TSTPATRX4IOFFSET in Register TESTPATTERNRX4ICFG */
#define TESTPATTERNRX4ICFG_TSTPATRX4IOFFSET_BIT_START       0U
#define TESTPATTERNRX4ICFG_TSTPATRX4IOFFSET_BIT_END         15U

/* Definition for field TSTPATRX4IINCR in Register TESTPATTERNRX4ICFG */
#define TESTPATTERNRX4ICFG_TSTPATRX4IINCR_BIT_START         16U
#define TESTPATTERNRX4ICFG_TSTPATRX4IINCR_BIT_END           31U

/* Definition for field TSTPATRX1QOFFSET in Register TESTPATTERNRX1QCFG */
#define TESTPATTERNRX1QCFG_TSTPATRX1QOFFSET_BIT_START       0U
#define TESTPATTERNRX1QCFG_TSTPATRX1QOFFSET_BIT_END         15U

/* Definition for field TSTPATRX1QINCR in Register TESTPATTERNRX1QCFG */
#define TESTPATTERNRX1QCFG_TSTPATRX1QINCR_BIT_START         16U
#define TESTPATTERNRX1QCFG_TSTPATRX1QINCR_BIT_END           31U

/* Definition for field TSTPATRX2QOFFSET in Register TESTPATTERNRX2QCFG */
#define TESTPATTERNRX2QCFG_TSTPATRX2QOFFSET_BIT_START       0U
#define TESTPATTERNRX2QCFG_TSTPATRX2QOFFSET_BIT_END         15U

/* Definition for field TSTPATRX2QINCR in Register TESTPATTERNRX2QCFG */
#define TESTPATTERNRX2QCFG_TSTPATRX2QINCR_BIT_START         16U
#define TESTPATTERNRX2QCFG_TSTPATRX2QINCR_BIT_END           31U

/* Definition for field TSTPATRX3QOFFSET in Register TESTPATTERNRX3QCFG */
#define TESTPATTERNRX3QCFG_TSTPATRX3QOFFSET_BIT_START       0U
#define TESTPATTERNRX3QCFG_TSTPATRX3QOFFSET_BIT_END         15U

/* Definition for field TSTPATRX3QINCR in Register TESTPATTERNRX3QCFG */
#define TESTPATTERNRX3QCFG_TSTPATRX3QINCR_BIT_START         16U
#define TESTPATTERNRX3QCFG_TSTPATRX3QINCR_BIT_END           31U

/* Definition for field TSTPATRX4QOFFSET in Register TESTPATTERNRX4QCFG */
#define TESTPATTERNRX4QCFG_TSTPATRX4QOFFSET_BIT_START       0U
#define TESTPATTERNRX4QCFG_TSTPATRX4QOFFSET_BIT_END         15U

/* Definition for field TSTPATRX4QINCR in Register TESTPATTERNRX4QCFG */
#define TESTPATTERNRX4QCFG_TSTPATRX4QINCR_BIT_START         16U
#define TESTPATTERNRX4QCFG_TSTPATRX4QINCR_BIT_END           31U

/* Definition for field TSTPATVLDCNT in Register TESTPATTERNVLDCFG */
#define TESTPATTERNVLDCFG_TSTPATVLDCNT_BIT_START            0U
#define TESTPATTERNVLDCFG_TSTPATVLDCNT_BIT_END              7U

/* Definition for field TSTPATGENEN in Register TESTPATTERNVLDCFG */
#define TESTPATTERNVLDCFG_TSTPATGENEN_BIT_START             8U
#define TESTPATTERNVLDCFG_TSTPATGENEN_BIT_END               10U

/* Definition for field FFTACCSLVEN in Register DSSMISC */
#define DSSMISC_FFTACCSLVEN_BIT_START                       6U
#define DSSMISC_FFTACCSLVEN_BIT_END                         8U



/**
 * @struct DSSRegs_t
 * @brief
 *   Module DSS_REG Register Definition
 * @details
 *   This structure is used to access the DSS_REG module registers.
 */
/**
 * @typedef DSSRegs
 * @brief
 *   Module DSS_REG Register Frame type Definition
 * @details
 *   This type is used to access the DSS_REG module registers.
 */
typedef volatile struct DSSRegs_t
{
    uint32_t    DSSGPREG0                          ;        /* Offset = 0x000 */
    uint32_t    RESTRICTED1[19]                    ;        /* Offset = 0x004 */
    uint32_t    RTIEVENTCAPTURESEL                 ;        /* Offset = 0x050 */
    uint32_t    RESTRICTED2[2]                     ;        /* Offset = 0x054 */
    uint32_t    ADCBUFCFG1                         ;        /* Offset = 0x05C */
    uint32_t    ADCBUFCFG2                         ;        /* Offset = 0x060 */
    uint32_t    ADCBUFCFG3                         ;        /* Offset = 0x064 */
    uint32_t    ADCBUFCFG4                         ;        /* Offset = 0x068 */
    uint32_t    CQCFG1                             ;        /* Offset = 0x06C */
    uint32_t    RESTRICTED3[4]                     ;        /* Offset = 0x070 */
    uint32_t    TPCCPARSTATCFG                     ;        /* Offset = 0x080 */
    uint32_t    CSI2TXPARSTATCFG                   ;        /* Offset = 0x084 */
    uint32_t    RESTRICTED4[6]                     ;        /* Offset = 0x088 */
    uint32_t    CSICFG1                            ;        /* Offset = 0x0A0 */
    uint32_t    RESTRICTED5[24]                    ;        /* Offset = 0x0A4 */
    uint32_t    TPTC0WRMPUSTADD0                   ;        /* Offset = 0x104 */
    uint32_t    TPTC0WRMPUSTADD1                   ;        /* Offset = 0x108 */
    uint32_t    TPTC0WRMPUSTADD2                   ;        /* Offset = 0x10C */
    uint32_t    TPTC0WRMPUSTADD3                   ;        /* Offset = 0x110 */
    uint32_t    TPTC0WRMPUSTADD4                   ;        /* Offset = 0x114 */
    uint32_t    TPTC0WRMPUSTADD5                   ;        /* Offset = 0x118 */
    uint32_t    TPTC0WRMPUSTADD6                   ;        /* Offset = 0x11C */
    uint32_t    TPTC0WRMPUSTADD7                   ;        /* Offset = 0x120 */
    uint32_t    TPTC0WRMPUENDADD0                  ;        /* Offset = 0x124 */
    uint32_t    TPTC0WRMPUENDADD1                  ;        /* Offset = 0x128 */
    uint32_t    TPTC0WRMPUENDADD2                  ;        /* Offset = 0x12C */
    uint32_t    TPTC0WRMPUENDADD3                  ;        /* Offset = 0x130 */
    uint32_t    TPTC0WRMPUENDADD4                  ;        /* Offset = 0x134 */
    uint32_t    TPTC0WRMPUENDADD5                  ;        /* Offset = 0x138 */
    uint32_t    TPTC0WRMPUENDADD6                  ;        /* Offset = 0x13C */
    uint32_t    TPTC0WRMPUENDADD7                  ;        /* Offset = 0x140 */
    uint32_t    TPTC0WRMPUERRADD                   ;        /* Offset = 0x144 */
    uint32_t    TPTC0RDMPUSTADD0                   ;        /* Offset = 0x148 */
    uint32_t    TPTC0RDMPUSTADD1                   ;        /* Offset = 0x14C */
    uint32_t    TPTC0RDMPUSTADD2                   ;        /* Offset = 0x150 */
    uint32_t    TPTC0RDMPUSTADD3                   ;        /* Offset = 0x154 */
    uint32_t    TPTC0RDMPUSTADD4                   ;        /* Offset = 0x158 */
    uint32_t    TPTC0RDMPUSTADD5                   ;        /* Offset = 0x15C */
    uint32_t    TPTC0RDMPUSTADD6                   ;        /* Offset = 0x160 */
    uint32_t    TPTC0RDMPUSTADD7                   ;        /* Offset = 0x164 */
    uint32_t    TPTC0RDMPUENDADD0                  ;        /* Offset = 0x168 */
    uint32_t    TPTC0RDMPUENDADD1                  ;        /* Offset = 0x16C */
    uint32_t    TPTC0RDMPUENDADD2                  ;        /* Offset = 0x170 */
    uint32_t    TPTC0RDMPUENDADD3                  ;        /* Offset = 0x174 */
    uint32_t    TPTC0RDMPUENDADD4                  ;        /* Offset = 0x178 */
    uint32_t    TPTC0RDMPUENDADD5                  ;        /* Offset = 0x17C */
    uint32_t    TPTC0RDMPUENDADD6                  ;        /* Offset = 0x180 */
    uint32_t    TPTC0RDMPUENDADD7                  ;        /* Offset = 0x184 */
    uint32_t    TPTC0RDMPUERRADD                   ;        /* Offset = 0x188 */
    uint32_t    TPTC1WRMPUSTADD0                   ;        /* Offset = 0x18C */
    uint32_t    TPTC1WRMPUSTADD1                   ;        /* Offset = 0x190 */
    uint32_t    TPTC1WRMPUSTADD2                   ;        /* Offset = 0x194 */
    uint32_t    TPTC1WRMPUSTADD3                   ;        /* Offset = 0x198 */
    uint32_t    TPTC1WRMPUSTADD4                   ;        /* Offset = 0x19C */
    uint32_t    TPTC1WRMPUSTADD5                   ;        /* Offset = 0x1A0 */
    uint32_t    TPTC1WRMPUSTADD6                   ;        /* Offset = 0x1A4 */
    uint32_t    TPTC1WRMPUSTADD7                   ;        /* Offset = 0x1A8 */
    uint32_t    TPTC1WRMPUENDADD0                  ;        /* Offset = 0x1AC */
    uint32_t    TPTC1WRMPUENDADD1                  ;        /* Offset = 0x1B0 */
    uint32_t    TPTC1WRMPUENDADD2                  ;        /* Offset = 0x1B4 */
    uint32_t    TPTC1WRMPUENDADD3                  ;        /* Offset = 0x1B8 */
    uint32_t    TPTC1WRMPUENDADD4                  ;        /* Offset = 0x1BC */
    uint32_t    TPTC1WRMPUENDADD5                  ;        /* Offset = 0x1C0 */
    uint32_t    TPTC1WRMPUENDADD6                  ;        /* Offset = 0x1C4 */
    uint32_t    TPTC1WRMPUENDADD7                  ;        /* Offset = 0x1C8 */
    uint32_t    TPTC1WRMPUERRADD                   ;        /* Offset = 0x1CC */
    uint32_t    TPTC1RDMPUSTADD0                   ;        /* Offset = 0x1D0 */
    uint32_t    TPTC1RDMPUSTADD1                   ;        /* Offset = 0x1D4 */
    uint32_t    TPTC1RDMPUSTADD2                   ;        /* Offset = 0x1D8 */
    uint32_t    TPTC1RDMPUSTADD3                   ;        /* Offset = 0x1DC */
    uint32_t    TPTC1RDMPUSTADD4                   ;        /* Offset = 0x1E0 */
    uint32_t    TPTC1RDMPUSTADD5                   ;        /* Offset = 0x1E4 */
    uint32_t    TPTC1RDMPUSTADD6                   ;        /* Offset = 0x1E8 */
    uint32_t    TPTC1RDMPUSTADD7                   ;        /* Offset = 0x1EC */
    uint32_t    TPTC1RDMPUENDADD0                  ;        /* Offset = 0x1F0 */
    uint32_t    TPTC1RDMPUENDADD1                  ;        /* Offset = 0x1F4 */
    uint32_t    TPTC1RDMPUENDADD2                  ;        /* Offset = 0x1F8 */
    uint32_t    TPTC1RDMPUENDADD3                  ;        /* Offset = 0x1FC */
    uint32_t    TPTC1RDMPUENDADD4                  ;        /* Offset = 0x200 */
    uint32_t    TPTC1RDMPUENDADD5                  ;        /* Offset = 0x204 */
    uint32_t    TPTC1RDMPUENDADD6                  ;        /* Offset = 0x208 */
    uint32_t    TPTC1RDMPUENDADD7                  ;        /* Offset = 0x20C */
    uint32_t    TPTC1RDMPUERRADD                   ;        /* Offset = 0x210 */
    uint32_t    TPTCMPUVALIDCFG                    ;        /* Offset = 0x214 */
    uint32_t    TPTCMPUENCFG                       ;        /* Offset = 0x218 */
    uint32_t    TESTPATTERNRX1ICFG                 ;        /* Offset = 0x21C */
    uint32_t    TESTPATTERNRX2ICFG                 ;        /* Offset = 0x220 */
    uint32_t    TESTPATTERNRX3ICFG                 ;        /* Offset = 0x224 */
    uint32_t    TESTPATTERNRX4ICFG                 ;        /* Offset = 0x228 */
    uint32_t    TESTPATTERNRX1QCFG                 ;        /* Offset = 0x22C */
    uint32_t    TESTPATTERNRX2QCFG                 ;        /* Offset = 0x230 */
    uint32_t    TESTPATTERNRX3QCFG                 ;        /* Offset = 0x234 */
    uint32_t    TESTPATTERNRX4QCFG                 ;        /* Offset = 0x238 */
    uint32_t    TESTPATTERNVLDCFG                  ;        /* Offset = 0x23C */
    uint32_t    DSSMISC                            ;        /* Offset = 0x240 */
} DSSRegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_DSS_H */
/* END OF REG_DSS_H */

