/**
 *  @file    reg_crc.h
 *
 *  @brief
 *    This file gives register definitions of MSS_MCRC module.
 *
 *  This file is auto-generated on 3/22/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

/* Definition for field CRC_CURSEC4 in Register CRC_CURSEC_REG4 */
#define CRC_CURSEC_REG4_CRC_CURSEC4_BIT_START               0U
#define CRC_CURSEC_REG4_CRC_CURSEC4_BIT_END                 15U

/* Definition for field CRC_WDTOPLD4 in Register CRC_WDTOPLD4 */
#define CRC_WDTOPLD4_CRC_WDTOPLD4_BIT_START                 0U
#define CRC_WDTOPLD4_CRC_WDTOPLD4_BIT_END                   23U

/* Definition for field CRC_BCTOPLD4 in Register CRC_BCTOPLD4 */
#define CRC_BCTOPLD4_CRC_BCTOPLD4_BIT_START                 0U
#define CRC_BCTOPLD4_CRC_BCTOPLD4_BIT_END                   23U

/* Definition for field PSASIG4_31_0 in Register PSA_SIGREGL4 */
#define PSA_SIGREGL4_PSASIG4_31_0_BIT_START                 0U
#define PSA_SIGREGL4_PSASIG4_31_0_BIT_END                   31U

/* Definition for field PSA_SIG4_63_32 in Register PSA_SIGREGH4 */
#define PSA_SIGREGH4_PSA_SIG4_63_32_BIT_START               0U
#define PSA_SIGREGH4_PSA_SIG4_63_32_BIT_END                 31U

/* Definition for field CRC4_31_0 in Register CRC_REGL4 */
#define CRC_REGL4_CRC4_31_0_BIT_START                       0U
#define CRC_REGL4_CRC4_31_0_BIT_END                         31U

/* Definition for field CRC4_63_32 in Register CRC_REGH4 */
#define CRC_REGH4_CRC4_63_32_BIT_START                      0U
#define CRC_REGH4_CRC4_63_32_BIT_END                        31U

/* Definition for field PSASECSIG4_31_0 in Register PSA_SECSIGREGL4 */
#define PSA_SECSIGREGL4_PSASECSIG4_31_0_BIT_START           0U
#define PSA_SECSIGREGL4_PSASECSIG4_31_0_BIT_END             31U

/* Definition for field PSASECSIG4_63_32 in Register PSA_SECSIGREGH4 */
#define PSA_SECSIGREGH4_PSASECSIG4_63_32_BIT_START          0U
#define PSA_SECSIGREGH4_PSASECSIG4_63_32_BIT_END            31U

/* Definition for field RAW_DATA4_31_0 in Register RAW_DATAREGL4 */
#define RAW_DATAREGL4_RAW_DATA4_31_0_BIT_START              0U
#define RAW_DATAREGL4_RAW_DATA4_31_0_BIT_END                31U

/* Definition for field RAW_DATA4_63_32 in Register RAW_DATAREGH4 */
#define RAW_DATAREGH4_RAW_DATA4_63_32_BIT_START             0U
#define RAW_DATAREGH4_RAW_DATA4_63_32_BIT_END               31U

/* Definition for field ITCMEn in Register MCRC_BUS_SEL */
#define MCRC_BUS_SEL_ITCMEN_BIT_START                       0U
#define MCRC_BUS_SEL_ITCMEN_BIT_END                         0U

/* Definition for field DTCMEn in Register MCRC_BUS_SEL */
#define MCRC_BUS_SEL_DTCMEN_BIT_START                       1U
#define MCRC_BUS_SEL_DTCMEN_BIT_END                         1U

/* Definition for field MEn in Register MCRC_BUS_SEL */
#define MCRC_BUS_SEL_MEN_BIT_START                          2U
#define MCRC_BUS_SEL_MEN_BIT_END                            2U



/**
 * @struct CRCRegs_t
 * @brief
 *   Module MSS_MCRC Register Definition
 * @details
 *   This structure is used to access the MSS_MCRC module registers.
 */
/**
 * @typedef CRCRegs
 * @brief
 *   Module MSS_MCRC Register Frame type Definition
 * @details
 *   This type is used to access the MSS_MCRC module registers.
 */
typedef volatile struct CRCRegs_t
{
    uint32_t    CRC_CTRL0                          ;        /* Offset = 0x000 */
    uint32_t    RESTRICTED1                        ;        /* Offset = 0x004 */
    uint32_t    CRC_CTRL1                          ;        /* Offset = 0x008 */
    uint32_t    RESTRICTED2                        ;        /* Offset = 0x00C */
    uint32_t    CRC_CTRL2                          ;        /* Offset = 0x010 */
    uint32_t    RESTRICTED3                        ;        /* Offset = 0x014 */
    uint32_t    CRC_INTS                           ;        /* Offset = 0x018 */
    uint32_t    RESTRICTED4                        ;        /* Offset = 0x01C */
    uint32_t    CRC_INTR                           ;        /* Offset = 0x020 */
    uint32_t    RESTRICTED5                        ;        /* Offset = 0x024 */
    uint32_t    CRC_STATUS_REG                     ;        /* Offset = 0x028 */
    uint32_t    RESTRICTED6                        ;        /* Offset = 0x02C */
    uint32_t    CRC_INT_OFFSET_REG                 ;        /* Offset = 0x030 */
    uint32_t    RESTRICTED7                        ;        /* Offset = 0x034 */
    uint32_t    CRC_BUSY                           ;        /* Offset = 0x038 */
    uint32_t    RESTRICTED8                        ;        /* Offset = 0x03C */
    uint32_t    CRC_PCOUNT_REG1                    ;        /* Offset = 0x040 */
    uint32_t    CRC_SCOUNT_REG1                    ;        /* Offset = 0x044 */
    uint32_t    CRC_CURSEC_REG1                    ;        /* Offset = 0x048 */
    uint32_t    CRC_WDTOPLD1                       ;        /* Offset = 0x04C */
    uint32_t    CRC_BCTOPLD1                       ;        /* Offset = 0x050 */
    uint32_t    RESTRICTED9[3]                     ;        /* Offset = 0x054 */
    uint32_t    PSA_SIGREGL1                       ;        /* Offset = 0x060 */
    uint32_t    PSA_SIGREGH1                       ;        /* Offset = 0x064 */
    uint32_t    CRC_REGL1                          ;        /* Offset = 0x068 */
    uint32_t    CRC_REGH1                          ;        /* Offset = 0x06C */
    uint32_t    PSA_SECSIGREGL1                    ;        /* Offset = 0x070 */
    uint32_t    PSA_SECSIGREGH1                    ;        /* Offset = 0x074 */
    uint32_t    RAW_DATAREGL1                      ;        /* Offset = 0x078 */
    uint32_t    RAW_DATAREGH1                      ;        /* Offset = 0x07C */
    uint32_t    CRC_PCOUNT_REG2                    ;        /* Offset = 0x080 */
    uint32_t    CRC_SCOUNT_REG2                    ;        /* Offset = 0x084 */
    uint32_t    CRC_CURSEC_REG2                    ;        /* Offset = 0x088 */
    uint32_t    CRC_WDTOPLD2                       ;        /* Offset = 0x08C */
    uint32_t    CRC_BCTOPLD2                       ;        /* Offset = 0x090 */
    uint32_t    RESTRICTED10[3]                    ;        /* Offset = 0x094 */
    uint32_t    PSA_SIGREGL2                       ;        /* Offset = 0x0A0 */
    uint32_t    PSA_SIGREGH2                       ;        /* Offset = 0x0A4 */
    uint32_t    CRC_REGL2                          ;        /* Offset = 0x0A8 */
    uint32_t    CRC_REGH2                          ;        /* Offset = 0x0AC */
    uint32_t    PSA_SECSIGREGL2                    ;        /* Offset = 0x0B0 */
    uint32_t    PSA_SECSIGREGH2                    ;        /* Offset = 0x0B4 */
    uint32_t    RAW_DATAREGL2                      ;        /* Offset = 0x0B8 */
    uint32_t    RAW_DATAREGH2                      ;        /* Offset = 0x0BC */
    uint32_t    CRC_PCOUNT_REG3                    ;        /* Offset = 0x0C0 */
    uint32_t    CRC_SCOUNT_REG3                    ;        /* Offset = 0x0C4 */
    uint32_t    CRC_CURSEC_REG3                    ;        /* Offset = 0x0C8 */
    uint32_t    CRC_WDTOPLD3                       ;        /* Offset = 0x0CC */
    uint32_t    CRC_BCTOPLD3                       ;        /* Offset = 0x0D0 */
    uint32_t    RESTRICTED11[3]                    ;        /* Offset = 0x0D4 */
    uint32_t    PSA_SIGREGL3                       ;        /* Offset = 0x0E0 */
    uint32_t    PSA_SIGREGH3                       ;        /* Offset = 0x0E4 */
    uint32_t    CRC_REGL3                          ;        /* Offset = 0x0E8 */
    uint32_t    CRC_REGH3                          ;        /* Offset = 0x0EC */
    uint32_t    PSA_SECSIGREGL3                    ;        /* Offset = 0x0F0 */
    uint32_t    PSA_SECSIGREGH3                    ;        /* Offset = 0x0F4 */
    uint32_t    RAW_DATAREGL3                      ;        /* Offset = 0x0F8 */
    uint32_t    RAW_DATAREGH3                      ;        /* Offset = 0x0FC */
    uint32_t    CRC_PCOUNT_REG4                    ;        /* Offset = 0x100 */
    uint32_t    CRC_SCOUNT_REG4                    ;        /* Offset = 0x104 */
    uint32_t    CRC_CURSEC_REG4                    ;        /* Offset = 0x108 */
    uint32_t    CRC_WDTOPLD4                       ;        /* Offset = 0x10C */
    uint32_t    CRC_BCTOPLD4                       ;        /* Offset = 0x110 */
    uint32_t    RESTRICTED12[3]                    ;        /* Offset = 0x114 */
    uint32_t    PSA_SIGREGL4                       ;        /* Offset = 0x120 */
    uint32_t    PSA_SIGREGH4                       ;        /* Offset = 0x124 */
    uint32_t    CRC_REGL4                          ;        /* Offset = 0x128 */
    uint32_t    CRC_REGH4                          ;        /* Offset = 0x12C */
    uint32_t    PSA_SECSIGREGL4                    ;        /* Offset = 0x130 */
    uint32_t    PSA_SECSIGREGH4                    ;        /* Offset = 0x134 */
    uint32_t    RAW_DATAREGL4                      ;        /* Offset = 0x138 */
    uint32_t    RAW_DATAREGH4                      ;        /* Offset = 0x13C */
    uint32_t    MCRC_BUS_SEL                       ;        /* Offset = 0x140 */
    uint32_t    RESERVED1                          ;        /* Offset = 0x144 */
    uint32_t    RESTRICTED13[173]                  ;        /* Offset = 0x148 */
    uint32_t    RESERVED2                          ;        /* Offset = 0x3FC */
} CRCRegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_CRC_H */
/* END OF REG_CRC_H */

