/**
 *  @file    reg_dma.h
 *
 *  @brief
 *    This file gives register definitions of MSS_DMA_REG module.
 *
 *  This file is auto-generated on 3/7/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define DMAMPCTRL_REG3AP_BIT_END                            26U

/* Definition for field INT3ENA in Register DMAMPCTRL */
#define DMAMPCTRL_INT3ENA_BIT_START                         27U
#define DMAMPCTRL_INT3ENA_BIT_END                           27U

/* Definition for field INT3AB in Register DMAMPCTRL */
#define DMAMPCTRL_INT3AB_BIT_START                          28U
#define DMAMPCTRL_INT3AB_BIT_END                            28U

/* Definition for field REG0FT in Register DMAMPST */
#define DMAMPST_REG0FT_BIT_START                            0U
#define DMAMPST_REG0FT_BIT_END                              0U

/* Definition for field REG1FT in Register DMAMPST */
#define DMAMPST_REG1FT_BIT_START                            8U
#define DMAMPST_REG1FT_BIT_END                              8U

/* Definition for field REG2FT in Register DMAMPST */
#define DMAMPST_REG2FT_BIT_START                            16U
#define DMAMPST_REG2FT_BIT_END                              16U

/* Definition for field REG3FT in Register DMAMPST */
#define DMAMPST_REG3FT_BIT_START                            24U
#define DMAMPST_REG3FT_BIT_END                              24U

/* Definition for field STARTADDRESS in Register DMAMPR0S */
#define DMAMPR0S_STARTADDRESS_BIT_START                     0U
#define DMAMPR0S_STARTADDRESS_BIT_END                       31U

/* Definition for field ENDADDRESS in Register DMAMPR0E */
#define DMAMPR0E_ENDADDRESS_BIT_START                       0U
#define DMAMPR0E_ENDADDRESS_BIT_END                         31U

/* Definition for field STARTADDRESS in Register DMAMPR1S */
#define DMAMPR1S_STARTADDRESS_BIT_START                     0U
#define DMAMPR1S_STARTADDRESS_BIT_END                       31U

/* Definition for field ENDADDRESS in Register DMAMPR1E */
#define DMAMPR1E_ENDADDRESS_BIT_START                       0U
#define DMAMPR1E_ENDADDRESS_BIT_END                         31U

/* Definition for field STARTADDRESS in Register DMAMPR2S */
#define DMAMPR2S_STARTADDRESS_BIT_START                     0U
#define DMAMPR2S_STARTADDRESS_BIT_END                       31U

/* Definition for field ENDADDRESS in Register DMAMPR2E */
#define DMAMPR2E_ENDADDRESS_BIT_START                       0U
#define DMAMPR2E_ENDADDRESS_BIT_END                         31U

/* Definition for field STARTADDRESS in Register DMAMPR3S */
#define DMAMPR3S_STARTADDRESS_BIT_START                     0U
#define DMAMPR3S_STARTADDRESS_BIT_END                       31U

/* Definition for field ENDADDRESS in Register DMAMPR3E */
#define DMAMPR3E_ENDADDRESS_BIT_START                       0U
#define DMAMPR3E_ENDADDRESS_BIT_END                         31U



/**
 * @struct DMARegs_t
 * @brief
 *   Module MSS_DMA_REG Register Definition
 * @details
 *   This structure is used to access the MSS_DMA_REG module registers.
 */
/**
 * @typedef DMARegs
 * @brief
 *   Module MSS_DMA_REG Register Frame type Definition
 * @details
 *   This type is used to access the MSS_DMA_REG module registers.
 */
typedef volatile struct DMARegs_t
{
    uint32_t    GCTRL                              ;        /* Offset = 0x000 */
    uint32_t    PEND                               ;        /* Offset = 0x004 */
    uint32_t    FBREG                              ;        /* Offset = 0x008 */
    uint32_t    DMASTAT                            ;        /* Offset = 0x00C */
    uint32_t    MSS_DMA_RESERVED1                  ;        /* Offset = 0x010 */
    uint32_t    HWCHENAS                           ;        /* Offset = 0x014 */
    uint32_t    MSS_DMA_RESERVED2                  ;        /* Offset = 0x018 */
    uint32_t    HWCHENAR                           ;        /* Offset = 0x01C */
    uint32_t    MSS_DMA_RESERVED3                  ;        /* Offset = 0x020 */
    uint32_t    SWCHENAS                           ;        /* Offset = 0x024 */
    uint32_t    MSS_DMA_RESERVED4                  ;        /* Offset = 0x028 */
    uint32_t    SWCHENAR                           ;        /* Offset = 0x02C */
    uint32_t    MSS_DMA_RESERVED5                  ;        /* Offset = 0x030 */
    uint32_t    CHPRIOS                            ;        /* Offset = 0x034 */
    uint32_t    MSS_DMA_RESERVED6                  ;        /* Offset = 0x038 */
    uint32_t    CHPRIOR                            ;        /* Offset = 0x03C */
    uint32_t    MSS_DMA_RESERVED7                  ;        /* Offset = 0x040 */
    uint32_t    GCHIENAS                           ;        /* Offset = 0x044 */
    uint32_t    MSS_DMA_RESERVED8                  ;        /* Offset = 0x048 */
    uint32_t    GCHIENAR                           ;        /* Offset = 0x04C */
    uint32_t    MSS_DMA_RESERVED9                  ;        /* Offset = 0x050 */
#if 0 /* convert to array */
    uint32_t    DREQASI0                           ;        /* Offset = 0x054 */
    uint32_t    DREQASI1                           ;        /* Offset = 0x058 */
    uint32_t    DREQASI2                           ;        /* Offset = 0x05C */
    uint32_t    DREQASI3                           ;        /* Offset = 0x060 */
    uint32_t    DREQASI4                           ;        /* Offset = 0x064 */
    uint32_t    DREQASI5                           ;        /* Offset = 0x068 */
    uint32_t    DREQASI6                           ;        /* Offset = 0x06C */
    uint32_t    DREQASI7                           ;        /* Offset = 0x070 */
#else
    uint32_t DREQASI[8U]; /**<  0x0054 - 0x70: DMA Request Assignment Register */
#endif
    uint32_t    MSS_DMA_RESERVED10                 ;        /* Offset = 0x074 */
    uint32_t    MSS_DMA_RESERVED11                 ;        /* Offset = 0x078 */
    uint32_t    MSS_DMA_RESERVED12                 ;        /* Offset = 0x07C */
    uint32_t    MSS_DMA_RESERVED13                 ;        /* Offset = 0x080 */
    uint32_t    MSS_DMA_RESERVED14                 ;        /* Offset = 0x084 */
    uint32_t    MSS_DMA_RESERVED15                 ;        /* Offset = 0x088 */
    uint32_t    MSS_DMA_RESERVED16                 ;        /* Offset = 0x08C */
    uint32_t    MSS_DMA_RESERVED17                 ;        /* Offset = 0x090 */
#if 0 /* convert to array */
    uint32_t    PAR0                               ;        /* Offset = 0x094 */
    uint32_t    PAR1                               ;        /* Offset = 0x098 */
    uint32_t    PAR2                               ;        /* Offset = 0x09C */
    uint32_t    PAR3                               ;        /* Offset = 0x0A0 */
#else
    uint32_t PAR[4U];     /**<  0x0094 - 0xA0: Port Assignment Register        */
#endif
    uint32_t    MSS_DMA_RESERVED18                 ;        /* Offset = 0x0A4 */
    uint32_t    MSS_DMA_RESERVED19                 ;        /* Offset = 0x0A8 */
    uint32_t    MSS_DMA_RESERVED20                 ;        /* Offset = 0x0AC */
    uint32_t    MSS_DMA_RESERVED21                 ;        /* Offset = 0x0B0 */
    uint32_t    FTCMAP                             ;        /* Offset = 0x0B4 */
    uint32_t    MSS_DMA_RESERVED22                 ;        /* Offset = 0x0B8 */
    uint32_t    LFSMAP                             ;        /* Offset = 0x0BC */
    uint32_t    MSS_DMA_RESERVED23                 ;        /* Offset = 0x0C0 */
    uint32_t    HBCMAP                             ;        /* Offset = 0x0C4 */
    uint32_t    MSS_DMA_RESERVED24                 ;        /* Offset = 0x0C8 */
    uint32_t    BTCMAP                             ;        /* Offset = 0x0CC */
    uint32_t    MSS_DMA_RESERVED25                 ;        /* Offset = 0x0D0 */
    uint32_t    BERMAP                             ;        /* Offset = 0x0D4 */
    uint32_t    MSS_DMA_RESERVED26                 ;        /* Offset = 0x0D8 */
    uint32_t    FTCINTENAS                         ;        /* Offset = 0x0DC */
    uint32_t    MSS_DMA_RESERVED27                 ;        /* Offset = 0x0E0 */
    uint32_t    FTCINTENAR                         ;        /* Offset = 0x0E4 */
    uint32_t    MSS_DMA_RESERVED28                 ;        /* Offset = 0x0E8 */
    uint32_t    LFSINTENAS                         ;        /* Offset = 0x0EC */
    uint32_t    MSS_DMA_RESERVED29                 ;        /* Offset = 0x0F0 */
    uint32_t    LFSINTENAR                         ;        /* Offset = 0x0F4 */
    uint32_t    MSS_DMA_RESERVED30                 ;        /* Offset = 0x0F8 */
    uint32_t    HBCINTENAS                         ;        /* Offset = 0x0FC */
    uint32_t    MSS_DMA_RESERVED31                 ;        /* Offset = 0x100 */
    uint32_t    HBCINTENAR                         ;        /* Offset = 0x104 */
    uint32_t    RESERVED32                         ;        /* Offset = 0x108 */
    uint32_t    BTCINTENAS                         ;        /* Offset = 0x10C */
    uint32_t    MSS_DMA_RESERVED33                 ;        /* Offset = 0x110 */
    uint32_t    BTCINTENAR                         ;        /* Offset = 0x114 */
    uint32_t    MSS_DMA_RESERVED34                 ;        /* Offset = 0x118 */
    uint32_t    GINTFLAG                           ;        /* Offset = 0x11C */
    uint32_t    MSS_DMA_RESERVED35                 ;        /* Offset = 0x120 */
    uint32_t    FTCFLAG                            ;        /* Offset = 0x124 */
    uint32_t    MSS_DMA_RESERVED36                 ;        /* Offset = 0x128 */
    uint32_t    LFSFLAG                            ;        /* Offset = 0x12C */
    uint32_t    MSS_DMA_RESERVED37                 ;        /* Offset = 0x130 */
    uint32_t    HBCFLAG                            ;        /* Offset = 0x134 */
    uint32_t    MSS_DMA_RESERVED38                 ;        /* Offset = 0x138 */
    uint32_t    BTCFLAG                            ;        /* Offset = 0x13C */
    uint32_t    MSS_DMA_RESERVED39                 ;        /* Offset = 0x140 */
    uint32_t    BERFLAG                            ;        /* Offset = 0x144 */
    uint32_t    MSS_DMA_RESERVED40                 ;        /* Offset = 0x148 */
    uint32_t    FTCAOFFSET                         ;        /* Offset = 0x14C */
    uint32_t    LFSAOFFSET                         ;        /* Offset = 0x150 */
    uint32_t    HBCAOFFSET                         ;        /* Offset = 0x154 */
    uint32_t    BTCAOFFSET                         ;        /* Offset = 0x158 */
    uint32_t    BERAOFFSET                         ;        /* Offset = 0x15C */
    uint32_t    FTCBOFFSET                         ;        /* Offset = 0x160 */
    uint32_t    LFSBOFFSET                         ;        /* Offset = 0x164 */
    uint32_t    HBCBOFFSET                         ;        /* Offset = 0x168 */
    uint32_t    BTCBOFFSET                         ;        /* Offset = 0x16C */
    uint32_t    BERBOFFSET                         ;        /* Offset = 0x170 */
    uint32_t    MSS_DMA_RESERVED41                 ;        /* Offset = 0x174 */
    uint32_t    PTCRL                              ;        /* Offset = 0x178 */
    uint32_t    RTCTRL                             ;        /* Offset = 0x17C */
    uint32_t    DCTRL                              ;        /* Offset = 0x180 */
    uint32_t    WPR                                ;        /* Offset = 0x184 */
    uint32_t    WMR                                ;        /* Offset = 0x188 */
    uint32_t    PAACSADDR                          ;        /* Offset = 0x18C */
    uint32_t    PAACDADDR                          ;        /* Offset = 0x190 */
    uint32_t    PAACTC                             ;        /* Offset = 0x194 */
    uint32_t    PBACSADDR                          ;        /* Offset = 0x198 */
    uint32_t    PBACDADDR                          ;        /* Offset = 0x19C */
    uint32_t    PBACTC                             ;        /* Offset = 0x1A0 */
    uint32_t    MSS_DMA_RESERVED42                 ;        /* Offset = 0x1A4 */
    uint32_t    DMAPCR                             ;        /* Offset = 0x1A8 */
    uint32_t    DMAPAR                             ;        /* Offset = 0x1AC */
    uint32_t    DMAMPCTRL                          ;        /* Offset = 0x1B0 */
    uint32_t    DMAMPST                            ;        /* Offset = 0x1B4 */
#if 0 /* convert to array */
    uint32_t    DMAMPR0S                           ;        /* Offset = 0x1B8 */
    uint32_t    DMAMPR0E                           ;        /* Offset = 0x1BC */
    uint32_t    DMAMPR1S                           ;        /* Offset = 0x1C0 */
    uint32_t    DMAMPR1E                           ;        /* Offset = 0x1C4 */
    uint32_t    DMAMPR2S                           ;        /* Offset = 0x1C8 */
    uint32_t    DMAMPR2E                           ;        /* Offset = 0x1CC */
    uint32_t    DMAMPR3S                           ;        /* Offset = 0x1D0 */
    uint32_t    DMAMPR3E                           ;        /* Offset = 0x1D4 */
#else
    struct
    {
        uint32_t STARTADD; /**<  0x01B8, 0x01C0, 0x01C8, 0x1D0: DMA Memory Protection Region Start Address Register  */
        uint32_t ENDADD;   /**<  0x01B8, 0x01C0, 0x01C8, 0x1D0: DMA Memory Protection Region Start Address Register  */
    }DMAMPR[4U];
#endif
} DMARegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_DMA_H */
/* END OF REG_DMA_H */

