/**
 *  @file    reg_dmaram.h
 *
 *  @brief
 *    This file gives register definitions of MSS_DMA_RAM module.
 *
 *  This file is auto-generated on 3/7/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define PRIMARYCONTROLPACKET_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET_CHCTRL */
#define PRIMARYCONTROLPACKET_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET_CHCTRL */
#define PRIMARYCONTROLPACKET_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET_CHCTRL */
#define PRIMARYCONTROLPACKET_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET_CHCTRL */
#define PRIMARYCONTROLPACKET_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET_CHCTRL */
#define PRIMARYCONTROLPACKET_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET_EIOFF */
#define PRIMARYCONTROLPACKET_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET_EIOFF */
#define PRIMARYCONTROLPACKET_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET_FIOFF */
#define PRIMARYCONTROLPACKET_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET_FIOFF */
#define PRIMARYCONTROLPACKET_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET_FIOFF_FIDXD_BIT_END           28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET_CSADDR */
#define WORKINGCONTROLPACKET_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET_CDADDR */
#define WORKINGCONTROLPACKET_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET_CTCOUNT */
#define WORKINGCONTROLPACKET_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET_CTCOUNT */
#define WORKINGCONTROLPACKET_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET_CTCOUNT_CFTCOUNT_BIT_END      28U


/**
 * @struct DMARAMRegs_t
 * @brief
 *   Module MSS_DMA_RAM Register Definition
 * @details
 *   This structure is used to access the MSS_DMA_RAM module registers.
 */
/**
 * @typedef DMARAMRegs
 * @brief
 *   Module MSS_DMA_RAM Register Frame type Definition
 * @details
 *   This type is used to access the MSS_DMA_RAM module registers.
 */
typedef volatile struct DMARAMRegs_t
{

     struct                                     /* 0x000-0x400 */
     {
      uint32_t ISADDR;
      uint32_t IDADDR;
      uint32_t ITCOUNT;
      uint32_t  rsvd1;
      uint32_t CHCTRL;
      uint32_t EIOFF;
      uint32_t FIOFF;
      uint32_t  rsvd2;
     }PRIMARYCONTROLPACKET[32U];

     uint32_t    RESTRICTED1[256];              /* 0x400-0x800*/

     struct                                     /* 0x800-0xA00 */
     {
      uint32_t CSADDR;
      uint32_t CDADDR;
      uint32_t CTCOUNT;
      uint32_t  rsvd3;
     }WORKINGCONTROLPACKET[32U];

} DMARAMRegs;


#else
/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET0_ISADDR */
#define PRIMARYCONTROLPACKET0_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET0_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET0_IDADDR */
#define PRIMARYCONTROLPACKET0_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET0_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET0_ITCOUNT */
#define PRIMARYCONTROLPACKET0_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET0_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET0_ITCOUNT */
#define PRIMARYCONTROLPACKET0_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET0_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET0_CHCTRL */
#define PRIMARYCONTROLPACKET0_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET0_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET0_CHCTRL */
#define PRIMARYCONTROLPACKET0_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET0_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET0_CHCTRL */
#define PRIMARYCONTROLPACKET0_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET0_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET0_CHCTRL */
#define PRIMARYCONTROLPACKET0_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET0_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET0_CHCTRL */
#define PRIMARYCONTROLPACKET0_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET0_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET0_CHCTRL */
#define PRIMARYCONTROLPACKET0_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET0_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET0_CHCTRL */
#define PRIMARYCONTROLPACKET0_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET0_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET0_EIOFF */
#define PRIMARYCONTROLPACKET0_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET0_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET0_EIOFF */
#define PRIMARYCONTROLPACKET0_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET0_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET0_FIOFF */
#define PRIMARYCONTROLPACKET0_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET0_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET0_FIOFF */
#define PRIMARYCONTROLPACKET0_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET0_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET1_ISADDR */
#define PRIMARYCONTROLPACKET1_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET1_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET1_IDADDR */
#define PRIMARYCONTROLPACKET1_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET1_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET1_ITCOUNT */
#define PRIMARYCONTROLPACKET1_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET1_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET1_ITCOUNT */
#define PRIMARYCONTROLPACKET1_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET1_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET1_CHCTRL */
#define PRIMARYCONTROLPACKET1_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET1_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET1_CHCTRL */
#define PRIMARYCONTROLPACKET1_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET1_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET1_CHCTRL */
#define PRIMARYCONTROLPACKET1_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET1_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET1_CHCTRL */
#define PRIMARYCONTROLPACKET1_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET1_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET1_CHCTRL */
#define PRIMARYCONTROLPACKET1_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET1_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET1_CHCTRL */
#define PRIMARYCONTROLPACKET1_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET1_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET1_CHCTRL */
#define PRIMARYCONTROLPACKET1_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET1_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET1_EIOFF */
#define PRIMARYCONTROLPACKET1_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET1_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET1_EIOFF */
#define PRIMARYCONTROLPACKET1_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET1_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET1_FIOFF */
#define PRIMARYCONTROLPACKET1_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET1_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET1_FIOFF */
#define PRIMARYCONTROLPACKET1_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET1_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET2_ISADDR */
#define PRIMARYCONTROLPACKET2_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET2_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET2_IDADDR */
#define PRIMARYCONTROLPACKET2_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET2_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET2_ITCOUNT */
#define PRIMARYCONTROLPACKET2_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET2_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET2_ITCOUNT */
#define PRIMARYCONTROLPACKET2_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET2_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET2_CHCTRL */
#define PRIMARYCONTROLPACKET2_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET2_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET2_CHCTRL */
#define PRIMARYCONTROLPACKET2_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET2_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET2_CHCTRL */
#define PRIMARYCONTROLPACKET2_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET2_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET2_CHCTRL */
#define PRIMARYCONTROLPACKET2_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET2_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET2_CHCTRL */
#define PRIMARYCONTROLPACKET2_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET2_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET2_CHCTRL */
#define PRIMARYCONTROLPACKET2_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET2_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET2_CHCTRL */
#define PRIMARYCONTROLPACKET2_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET2_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET2_EIOFF */
#define PRIMARYCONTROLPACKET2_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET2_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET2_EIOFF */
#define PRIMARYCONTROLPACKET2_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET2_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET2_FIOFF */
#define PRIMARYCONTROLPACKET2_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET2_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET2_FIOFF */
#define PRIMARYCONTROLPACKET2_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET2_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET3_ISADDR */
#define PRIMARYCONTROLPACKET3_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET3_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET3_IDADDR */
#define PRIMARYCONTROLPACKET3_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET3_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET3_ITCOUNT */
#define PRIMARYCONTROLPACKET3_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET3_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET3_ITCOUNT */
#define PRIMARYCONTROLPACKET3_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET3_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET3_CHCTRL */
#define PRIMARYCONTROLPACKET3_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET3_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET3_CHCTRL */
#define PRIMARYCONTROLPACKET3_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET3_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET3_CHCTRL */
#define PRIMARYCONTROLPACKET3_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET3_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET3_CHCTRL */
#define PRIMARYCONTROLPACKET3_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET3_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET3_CHCTRL */
#define PRIMARYCONTROLPACKET3_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET3_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET3_CHCTRL */
#define PRIMARYCONTROLPACKET3_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET3_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET3_CHCTRL */
#define PRIMARYCONTROLPACKET3_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET3_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET3_EIOFF */
#define PRIMARYCONTROLPACKET3_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET3_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET3_EIOFF */
#define PRIMARYCONTROLPACKET3_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET3_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET3_FIOFF */
#define PRIMARYCONTROLPACKET3_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET3_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET3_FIOFF */
#define PRIMARYCONTROLPACKET3_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET3_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET4_ISADDR */
#define PRIMARYCONTROLPACKET4_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET4_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET4_IDADDR */
#define PRIMARYCONTROLPACKET4_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET4_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET4_ITCOUNT */
#define PRIMARYCONTROLPACKET4_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET4_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET4_ITCOUNT */
#define PRIMARYCONTROLPACKET4_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET4_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET4_CHCTRL */
#define PRIMARYCONTROLPACKET4_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET4_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET4_CHCTRL */
#define PRIMARYCONTROLPACKET4_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET4_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET4_CHCTRL */
#define PRIMARYCONTROLPACKET4_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET4_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET4_CHCTRL */
#define PRIMARYCONTROLPACKET4_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET4_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET4_CHCTRL */
#define PRIMARYCONTROLPACKET4_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET4_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET4_CHCTRL */
#define PRIMARYCONTROLPACKET4_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET4_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET4_CHCTRL */
#define PRIMARYCONTROLPACKET4_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET4_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET4_EIOFF */
#define PRIMARYCONTROLPACKET4_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET4_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET4_EIOFF */
#define PRIMARYCONTROLPACKET4_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET4_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET4_FIOFF */
#define PRIMARYCONTROLPACKET4_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET4_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET4_FIOFF */
#define PRIMARYCONTROLPACKET4_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET4_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET5_ISADDR */
#define PRIMARYCONTROLPACKET5_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET5_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET5_IDADDR */
#define PRIMARYCONTROLPACKET5_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET5_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET5_ITCOUNT */
#define PRIMARYCONTROLPACKET5_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET5_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET5_ITCOUNT */
#define PRIMARYCONTROLPACKET5_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET5_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET5_CHCTRL */
#define PRIMARYCONTROLPACKET5_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET5_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET5_CHCTRL */
#define PRIMARYCONTROLPACKET5_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET5_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET5_CHCTRL */
#define PRIMARYCONTROLPACKET5_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET5_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET5_CHCTRL */
#define PRIMARYCONTROLPACKET5_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET5_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET5_CHCTRL */
#define PRIMARYCONTROLPACKET5_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET5_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET5_CHCTRL */
#define PRIMARYCONTROLPACKET5_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET5_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET5_CHCTRL */
#define PRIMARYCONTROLPACKET5_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET5_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET5_EIOFF */
#define PRIMARYCONTROLPACKET5_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET5_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET5_EIOFF */
#define PRIMARYCONTROLPACKET5_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET5_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET5_FIOFF */
#define PRIMARYCONTROLPACKET5_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET5_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET5_FIOFF */
#define PRIMARYCONTROLPACKET5_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET5_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET6_ISADDR */
#define PRIMARYCONTROLPACKET6_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET6_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET6_IDADDR */
#define PRIMARYCONTROLPACKET6_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET6_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET6_ITCOUNT */
#define PRIMARYCONTROLPACKET6_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET6_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET6_ITCOUNT */
#define PRIMARYCONTROLPACKET6_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET6_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET6_CHCTRL */
#define PRIMARYCONTROLPACKET6_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET6_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET6_CHCTRL */
#define PRIMARYCONTROLPACKET6_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET6_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET6_CHCTRL */
#define PRIMARYCONTROLPACKET6_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET6_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET6_CHCTRL */
#define PRIMARYCONTROLPACKET6_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET6_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET6_CHCTRL */
#define PRIMARYCONTROLPACKET6_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET6_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET6_CHCTRL */
#define PRIMARYCONTROLPACKET6_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET6_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET6_CHCTRL */
#define PRIMARYCONTROLPACKET6_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET6_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET6_EIOFF */
#define PRIMARYCONTROLPACKET6_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET6_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET6_EIOFF */
#define PRIMARYCONTROLPACKET6_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET6_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET6_FIOFF */
#define PRIMARYCONTROLPACKET6_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET6_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET6_FIOFF */
#define PRIMARYCONTROLPACKET6_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET6_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET7_ISADDR */
#define PRIMARYCONTROLPACKET7_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET7_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET7_IDADDR */
#define PRIMARYCONTROLPACKET7_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET7_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET7_ITCOUNT */
#define PRIMARYCONTROLPACKET7_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET7_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET7_ITCOUNT */
#define PRIMARYCONTROLPACKET7_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET7_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET7_CHCTRL */
#define PRIMARYCONTROLPACKET7_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET7_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET7_CHCTRL */
#define PRIMARYCONTROLPACKET7_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET7_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET7_CHCTRL */
#define PRIMARYCONTROLPACKET7_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET7_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET7_CHCTRL */
#define PRIMARYCONTROLPACKET7_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET7_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET7_CHCTRL */
#define PRIMARYCONTROLPACKET7_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET7_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET7_CHCTRL */
#define PRIMARYCONTROLPACKET7_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET7_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET7_CHCTRL */
#define PRIMARYCONTROLPACKET7_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET7_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET7_EIOFF */
#define PRIMARYCONTROLPACKET7_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET7_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET7_EIOFF */
#define PRIMARYCONTROLPACKET7_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET7_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET7_FIOFF */
#define PRIMARYCONTROLPACKET7_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET7_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET7_FIOFF */
#define PRIMARYCONTROLPACKET7_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET7_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET8_ISADDR */
#define PRIMARYCONTROLPACKET8_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET8_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET8_IDADDR */
#define PRIMARYCONTROLPACKET8_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET8_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET8_ITCOUNT */
#define PRIMARYCONTROLPACKET8_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET8_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET8_ITCOUNT */
#define PRIMARYCONTROLPACKET8_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET8_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET8_CHCTRL */
#define PRIMARYCONTROLPACKET8_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET8_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET8_CHCTRL */
#define PRIMARYCONTROLPACKET8_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET8_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET8_CHCTRL */
#define PRIMARYCONTROLPACKET8_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET8_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET8_CHCTRL */
#define PRIMARYCONTROLPACKET8_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET8_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET8_CHCTRL */
#define PRIMARYCONTROLPACKET8_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET8_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET8_CHCTRL */
#define PRIMARYCONTROLPACKET8_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET8_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET8_CHCTRL */
#define PRIMARYCONTROLPACKET8_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET8_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET8_EIOFF */
#define PRIMARYCONTROLPACKET8_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET8_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET8_EIOFF */
#define PRIMARYCONTROLPACKET8_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET8_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET8_FIOFF */
#define PRIMARYCONTROLPACKET8_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET8_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET8_FIOFF */
#define PRIMARYCONTROLPACKET8_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET8_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET9_ISADDR */
#define PRIMARYCONTROLPACKET9_ISADDR_ISADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET9_ISADDR_ISADDR_BIT_END         31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET9_IDADDR */
#define PRIMARYCONTROLPACKET9_IDADDR_IDADDR_BIT_START       0U
#define PRIMARYCONTROLPACKET9_IDADDR_IDADDR_BIT_END         31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET9_ITCOUNT */
#define PRIMARYCONTROLPACKET9_ITCOUNT_IETCOUNT_BIT_START    0U
#define PRIMARYCONTROLPACKET9_ITCOUNT_IETCOUNT_BIT_END      12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET9_ITCOUNT */
#define PRIMARYCONTROLPACKET9_ITCOUNT_IFTCOUNT_BIT_START    16U
#define PRIMARYCONTROLPACKET9_ITCOUNT_IFTCOUNT_BIT_END      28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET9_CHCTRL */
#define PRIMARYCONTROLPACKET9_CHCTRL_AIM_BIT_START          0U
#define PRIMARYCONTROLPACKET9_CHCTRL_AIM_BIT_END            0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET9_CHCTRL */
#define PRIMARYCONTROLPACKET9_CHCTRL_ADDMW_BIT_START        1U
#define PRIMARYCONTROLPACKET9_CHCTRL_ADDMW_BIT_END          2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET9_CHCTRL */
#define PRIMARYCONTROLPACKET9_CHCTRL_ADDMR_BIT_START        3U
#define PRIMARYCONTROLPACKET9_CHCTRL_ADDMR_BIT_END          4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET9_CHCTRL */
#define PRIMARYCONTROLPACKET9_CHCTRL_TTYPE_BIT_START        8U
#define PRIMARYCONTROLPACKET9_CHCTRL_TTYPE_BIT_END          8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET9_CHCTRL */
#define PRIMARYCONTROLPACKET9_CHCTRL_WES_BIT_START          12U
#define PRIMARYCONTROLPACKET9_CHCTRL_WES_BIT_END            13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET9_CHCTRL */
#define PRIMARYCONTROLPACKET9_CHCTRL_RES_BIT_START          14U
#define PRIMARYCONTROLPACKET9_CHCTRL_RES_BIT_END            15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET9_CHCTRL */
#define PRIMARYCONTROLPACKET9_CHCTRL_CHAIN_BIT_START        16U
#define PRIMARYCONTROLPACKET9_CHCTRL_CHAIN_BIT_END          21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET9_EIOFF */
#define PRIMARYCONTROLPACKET9_EIOFF_EIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET9_EIOFF_EIDXS_BIT_END           12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET9_EIOFF */
#define PRIMARYCONTROLPACKET9_EIOFF_EIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET9_EIOFF_EIDXD_BIT_END           28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET9_FIOFF */
#define PRIMARYCONTROLPACKET9_FIOFF_FIDXS_BIT_START         0U
#define PRIMARYCONTROLPACKET9_FIOFF_FIDXS_BIT_END           12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET9_FIOFF */
#define PRIMARYCONTROLPACKET9_FIOFF_FIDXD_BIT_START         16U
#define PRIMARYCONTROLPACKET9_FIOFF_FIDXD_BIT_END           28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET10_ISADDR */
#define PRIMARYCONTROLPACKET10_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET10_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET10_IDADDR */
#define PRIMARYCONTROLPACKET10_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET10_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET10_ITCOUNT */
#define PRIMARYCONTROLPACKET10_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET10_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET10_ITCOUNT */
#define PRIMARYCONTROLPACKET10_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET10_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET10_CHCTRL */
#define PRIMARYCONTROLPACKET10_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET10_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET10_CHCTRL */
#define PRIMARYCONTROLPACKET10_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET10_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET10_CHCTRL */
#define PRIMARYCONTROLPACKET10_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET10_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET10_CHCTRL */
#define PRIMARYCONTROLPACKET10_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET10_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET10_CHCTRL */
#define PRIMARYCONTROLPACKET10_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET10_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET10_CHCTRL */
#define PRIMARYCONTROLPACKET10_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET10_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET10_CHCTRL */
#define PRIMARYCONTROLPACKET10_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET10_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET10_EIOFF */
#define PRIMARYCONTROLPACKET10_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET10_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET10_EIOFF */
#define PRIMARYCONTROLPACKET10_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET10_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET10_FIOFF */
#define PRIMARYCONTROLPACKET10_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET10_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET10_FIOFF */
#define PRIMARYCONTROLPACKET10_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET10_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET11_ISADDR */
#define PRIMARYCONTROLPACKET11_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET11_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET11_IDADDR */
#define PRIMARYCONTROLPACKET11_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET11_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET11_ITCOUNT */
#define PRIMARYCONTROLPACKET11_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET11_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET11_ITCOUNT */
#define PRIMARYCONTROLPACKET11_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET11_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET11_CHCTRL */
#define PRIMARYCONTROLPACKET11_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET11_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET11_CHCTRL */
#define PRIMARYCONTROLPACKET11_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET11_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET11_CHCTRL */
#define PRIMARYCONTROLPACKET11_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET11_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET11_CHCTRL */
#define PRIMARYCONTROLPACKET11_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET11_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET11_CHCTRL */
#define PRIMARYCONTROLPACKET11_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET11_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET11_CHCTRL */
#define PRIMARYCONTROLPACKET11_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET11_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET11_CHCTRL */
#define PRIMARYCONTROLPACKET11_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET11_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET11_EIOFF */
#define PRIMARYCONTROLPACKET11_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET11_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET11_EIOFF */
#define PRIMARYCONTROLPACKET11_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET11_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET11_FIOFF */
#define PRIMARYCONTROLPACKET11_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET11_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET11_FIOFF */
#define PRIMARYCONTROLPACKET11_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET11_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET12_ISADDR */
#define PRIMARYCONTROLPACKET12_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET12_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET12_IDADDR */
#define PRIMARYCONTROLPACKET12_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET12_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET12_ITCOUNT */
#define PRIMARYCONTROLPACKET12_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET12_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET12_ITCOUNT */
#define PRIMARYCONTROLPACKET12_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET12_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET12_CHCTRL */
#define PRIMARYCONTROLPACKET12_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET12_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET12_CHCTRL */
#define PRIMARYCONTROLPACKET12_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET12_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET12_CHCTRL */
#define PRIMARYCONTROLPACKET12_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET12_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET12_CHCTRL */
#define PRIMARYCONTROLPACKET12_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET12_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET12_CHCTRL */
#define PRIMARYCONTROLPACKET12_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET12_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET12_CHCTRL */
#define PRIMARYCONTROLPACKET12_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET12_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET12_CHCTRL */
#define PRIMARYCONTROLPACKET12_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET12_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET12_EIOFF */
#define PRIMARYCONTROLPACKET12_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET12_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET12_EIOFF */
#define PRIMARYCONTROLPACKET12_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET12_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET12_FIOFF */
#define PRIMARYCONTROLPACKET12_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET12_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET12_FIOFF */
#define PRIMARYCONTROLPACKET12_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET12_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET13_ISADDR */
#define PRIMARYCONTROLPACKET13_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET13_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET13_IDADDR */
#define PRIMARYCONTROLPACKET13_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET13_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET13_ITCOUNT */
#define PRIMARYCONTROLPACKET13_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET13_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET13_ITCOUNT */
#define PRIMARYCONTROLPACKET13_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET13_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET13_CHCTRL */
#define PRIMARYCONTROLPACKET13_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET13_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET13_CHCTRL */
#define PRIMARYCONTROLPACKET13_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET13_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET13_CHCTRL */
#define PRIMARYCONTROLPACKET13_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET13_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET13_CHCTRL */
#define PRIMARYCONTROLPACKET13_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET13_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET13_CHCTRL */
#define PRIMARYCONTROLPACKET13_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET13_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET13_CHCTRL */
#define PRIMARYCONTROLPACKET13_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET13_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET13_CHCTRL */
#define PRIMARYCONTROLPACKET13_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET13_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET13_EIOFF */
#define PRIMARYCONTROLPACKET13_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET13_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET13_EIOFF */
#define PRIMARYCONTROLPACKET13_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET13_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET13_FIOFF */
#define PRIMARYCONTROLPACKET13_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET13_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET13_FIOFF */
#define PRIMARYCONTROLPACKET13_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET13_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET14_ISADDR */
#define PRIMARYCONTROLPACKET14_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET14_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET14_IDADDR */
#define PRIMARYCONTROLPACKET14_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET14_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET14_ITCOUNT */
#define PRIMARYCONTROLPACKET14_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET14_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET14_ITCOUNT */
#define PRIMARYCONTROLPACKET14_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET14_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET14_CHCTRL */
#define PRIMARYCONTROLPACKET14_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET14_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET14_CHCTRL */
#define PRIMARYCONTROLPACKET14_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET14_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET14_CHCTRL */
#define PRIMARYCONTROLPACKET14_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET14_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET14_CHCTRL */
#define PRIMARYCONTROLPACKET14_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET14_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET14_CHCTRL */
#define PRIMARYCONTROLPACKET14_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET14_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET14_CHCTRL */
#define PRIMARYCONTROLPACKET14_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET14_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET14_CHCTRL */
#define PRIMARYCONTROLPACKET14_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET14_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET14_EIOFF */
#define PRIMARYCONTROLPACKET14_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET14_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET14_EIOFF */
#define PRIMARYCONTROLPACKET14_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET14_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET14_FIOFF */
#define PRIMARYCONTROLPACKET14_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET14_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET14_FIOFF */
#define PRIMARYCONTROLPACKET14_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET14_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET15_ISADDR */
#define PRIMARYCONTROLPACKET15_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET15_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET15_IDADDR */
#define PRIMARYCONTROLPACKET15_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET15_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET15_ITCOUNT */
#define PRIMARYCONTROLPACKET15_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET15_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET15_ITCOUNT */
#define PRIMARYCONTROLPACKET15_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET15_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET15_CHCTRL */
#define PRIMARYCONTROLPACKET15_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET15_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET15_CHCTRL */
#define PRIMARYCONTROLPACKET15_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET15_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET15_CHCTRL */
#define PRIMARYCONTROLPACKET15_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET15_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET15_CHCTRL */
#define PRIMARYCONTROLPACKET15_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET15_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET15_CHCTRL */
#define PRIMARYCONTROLPACKET15_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET15_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET15_CHCTRL */
#define PRIMARYCONTROLPACKET15_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET15_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET15_CHCTRL */
#define PRIMARYCONTROLPACKET15_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET15_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET15_EIOFF */
#define PRIMARYCONTROLPACKET15_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET15_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET15_EIOFF */
#define PRIMARYCONTROLPACKET15_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET15_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET15_FIOFF */
#define PRIMARYCONTROLPACKET15_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET15_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET15_FIOFF */
#define PRIMARYCONTROLPACKET15_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET15_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET16_ISADDR */
#define PRIMARYCONTROLPACKET16_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET16_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET16_IDADDR */
#define PRIMARYCONTROLPACKET16_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET16_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET16_ITCOUNT */
#define PRIMARYCONTROLPACKET16_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET16_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET16_ITCOUNT */
#define PRIMARYCONTROLPACKET16_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET16_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET16_CHCTRL */
#define PRIMARYCONTROLPACKET16_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET16_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET16_CHCTRL */
#define PRIMARYCONTROLPACKET16_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET16_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET16_CHCTRL */
#define PRIMARYCONTROLPACKET16_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET16_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET16_CHCTRL */
#define PRIMARYCONTROLPACKET16_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET16_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET16_CHCTRL */
#define PRIMARYCONTROLPACKET16_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET16_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET16_CHCTRL */
#define PRIMARYCONTROLPACKET16_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET16_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET16_CHCTRL */
#define PRIMARYCONTROLPACKET16_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET16_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET16_EIOFF */
#define PRIMARYCONTROLPACKET16_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET16_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET16_EIOFF */
#define PRIMARYCONTROLPACKET16_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET16_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET16_FIOFF */
#define PRIMARYCONTROLPACKET16_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET16_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET16_FIOFF */
#define PRIMARYCONTROLPACKET16_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET16_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET17_ISADDR */
#define PRIMARYCONTROLPACKET17_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET17_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET17_IDADDR */
#define PRIMARYCONTROLPACKET17_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET17_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET17_ITCOUNT */
#define PRIMARYCONTROLPACKET17_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET17_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET17_ITCOUNT */
#define PRIMARYCONTROLPACKET17_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET17_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET17_CHCTRL */
#define PRIMARYCONTROLPACKET17_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET17_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET17_CHCTRL */
#define PRIMARYCONTROLPACKET17_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET17_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET17_CHCTRL */
#define PRIMARYCONTROLPACKET17_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET17_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET17_CHCTRL */
#define PRIMARYCONTROLPACKET17_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET17_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET17_CHCTRL */
#define PRIMARYCONTROLPACKET17_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET17_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET17_CHCTRL */
#define PRIMARYCONTROLPACKET17_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET17_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET17_CHCTRL */
#define PRIMARYCONTROLPACKET17_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET17_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET17_EIOFF */
#define PRIMARYCONTROLPACKET17_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET17_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET17_EIOFF */
#define PRIMARYCONTROLPACKET17_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET17_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET17_FIOFF */
#define PRIMARYCONTROLPACKET17_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET17_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET17_FIOFF */
#define PRIMARYCONTROLPACKET17_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET17_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET18_ISADDR */
#define PRIMARYCONTROLPACKET18_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET18_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET18_IDADDR */
#define PRIMARYCONTROLPACKET18_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET18_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET18_ITCOUNT */
#define PRIMARYCONTROLPACKET18_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET18_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET18_ITCOUNT */
#define PRIMARYCONTROLPACKET18_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET18_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET18_CHCTRL */
#define PRIMARYCONTROLPACKET18_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET18_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET18_CHCTRL */
#define PRIMARYCONTROLPACKET18_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET18_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET18_CHCTRL */
#define PRIMARYCONTROLPACKET18_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET18_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET18_CHCTRL */
#define PRIMARYCONTROLPACKET18_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET18_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET18_CHCTRL */
#define PRIMARYCONTROLPACKET18_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET18_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET18_CHCTRL */
#define PRIMARYCONTROLPACKET18_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET18_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET18_CHCTRL */
#define PRIMARYCONTROLPACKET18_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET18_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET18_EIOFF */
#define PRIMARYCONTROLPACKET18_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET18_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET18_EIOFF */
#define PRIMARYCONTROLPACKET18_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET18_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET18_FIOFF */
#define PRIMARYCONTROLPACKET18_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET18_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET18_FIOFF */
#define PRIMARYCONTROLPACKET18_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET18_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET19_ISADDR */
#define PRIMARYCONTROLPACKET19_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET19_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET19_IDADDR */
#define PRIMARYCONTROLPACKET19_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET19_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET19_ITCOUNT */
#define PRIMARYCONTROLPACKET19_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET19_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET19_ITCOUNT */
#define PRIMARYCONTROLPACKET19_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET19_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET19_CHCTRL */
#define PRIMARYCONTROLPACKET19_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET19_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET19_CHCTRL */
#define PRIMARYCONTROLPACKET19_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET19_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET19_CHCTRL */
#define PRIMARYCONTROLPACKET19_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET19_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET19_CHCTRL */
#define PRIMARYCONTROLPACKET19_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET19_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET19_CHCTRL */
#define PRIMARYCONTROLPACKET19_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET19_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET19_CHCTRL */
#define PRIMARYCONTROLPACKET19_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET19_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET19_CHCTRL */
#define PRIMARYCONTROLPACKET19_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET19_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET19_EIOFF */
#define PRIMARYCONTROLPACKET19_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET19_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET19_EIOFF */
#define PRIMARYCONTROLPACKET19_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET19_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET19_FIOFF */
#define PRIMARYCONTROLPACKET19_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET19_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET19_FIOFF */
#define PRIMARYCONTROLPACKET19_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET19_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET20_ISADDR */
#define PRIMARYCONTROLPACKET20_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET20_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET20_IDADDR */
#define PRIMARYCONTROLPACKET20_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET20_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET20_ITCOUNT */
#define PRIMARYCONTROLPACKET20_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET20_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET20_ITCOUNT */
#define PRIMARYCONTROLPACKET20_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET20_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET20_CHCTRL */
#define PRIMARYCONTROLPACKET20_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET20_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET20_CHCTRL */
#define PRIMARYCONTROLPACKET20_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET20_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET20_CHCTRL */
#define PRIMARYCONTROLPACKET20_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET20_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET20_CHCTRL */
#define PRIMARYCONTROLPACKET20_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET20_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET20_CHCTRL */
#define PRIMARYCONTROLPACKET20_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET20_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET20_CHCTRL */
#define PRIMARYCONTROLPACKET20_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET20_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET20_CHCTRL */
#define PRIMARYCONTROLPACKET20_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET20_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET20_EIOFF */
#define PRIMARYCONTROLPACKET20_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET20_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET20_EIOFF */
#define PRIMARYCONTROLPACKET20_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET20_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET20_FIOFF */
#define PRIMARYCONTROLPACKET20_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET20_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET20_FIOFF */
#define PRIMARYCONTROLPACKET20_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET20_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET21_ISADDR */
#define PRIMARYCONTROLPACKET21_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET21_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET21_IDADDR */
#define PRIMARYCONTROLPACKET21_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET21_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET21_ITCOUNT */
#define PRIMARYCONTROLPACKET21_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET21_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET21_ITCOUNT */
#define PRIMARYCONTROLPACKET21_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET21_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET21_CHCTRL */
#define PRIMARYCONTROLPACKET21_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET21_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET21_CHCTRL */
#define PRIMARYCONTROLPACKET21_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET21_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET21_CHCTRL */
#define PRIMARYCONTROLPACKET21_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET21_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET21_CHCTRL */
#define PRIMARYCONTROLPACKET21_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET21_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET21_CHCTRL */
#define PRIMARYCONTROLPACKET21_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET21_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET21_CHCTRL */
#define PRIMARYCONTROLPACKET21_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET21_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET21_CHCTRL */
#define PRIMARYCONTROLPACKET21_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET21_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET21_EIOFF */
#define PRIMARYCONTROLPACKET21_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET21_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET21_EIOFF */
#define PRIMARYCONTROLPACKET21_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET21_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET21_FIOFF */
#define PRIMARYCONTROLPACKET21_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET21_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET21_FIOFF */
#define PRIMARYCONTROLPACKET21_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET21_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET22_ISADDR */
#define PRIMARYCONTROLPACKET22_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET22_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET22_IDADDR */
#define PRIMARYCONTROLPACKET22_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET22_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET22_ITCOUNT */
#define PRIMARYCONTROLPACKET22_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET22_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET22_ITCOUNT */
#define PRIMARYCONTROLPACKET22_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET22_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET22_CHCTRL */
#define PRIMARYCONTROLPACKET22_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET22_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET22_CHCTRL */
#define PRIMARYCONTROLPACKET22_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET22_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET22_CHCTRL */
#define PRIMARYCONTROLPACKET22_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET22_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET22_CHCTRL */
#define PRIMARYCONTROLPACKET22_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET22_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET22_CHCTRL */
#define PRIMARYCONTROLPACKET22_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET22_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET22_CHCTRL */
#define PRIMARYCONTROLPACKET22_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET22_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET22_CHCTRL */
#define PRIMARYCONTROLPACKET22_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET22_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET22_EIOFF */
#define PRIMARYCONTROLPACKET22_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET22_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET22_EIOFF */
#define PRIMARYCONTROLPACKET22_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET22_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET22_FIOFF */
#define PRIMARYCONTROLPACKET22_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET22_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET22_FIOFF */
#define PRIMARYCONTROLPACKET22_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET22_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET23_ISADDR */
#define PRIMARYCONTROLPACKET23_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET23_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET23_IDADDR */
#define PRIMARYCONTROLPACKET23_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET23_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET23_ITCOUNT */
#define PRIMARYCONTROLPACKET23_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET23_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET23_ITCOUNT */
#define PRIMARYCONTROLPACKET23_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET23_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET23_CHCTRL */
#define PRIMARYCONTROLPACKET23_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET23_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET23_CHCTRL */
#define PRIMARYCONTROLPACKET23_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET23_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET23_CHCTRL */
#define PRIMARYCONTROLPACKET23_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET23_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET23_CHCTRL */
#define PRIMARYCONTROLPACKET23_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET23_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET23_CHCTRL */
#define PRIMARYCONTROLPACKET23_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET23_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET23_CHCTRL */
#define PRIMARYCONTROLPACKET23_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET23_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET23_CHCTRL */
#define PRIMARYCONTROLPACKET23_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET23_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET23_EIOFF */
#define PRIMARYCONTROLPACKET23_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET23_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET23_EIOFF */
#define PRIMARYCONTROLPACKET23_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET23_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET23_FIOFF */
#define PRIMARYCONTROLPACKET23_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET23_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET23_FIOFF */
#define PRIMARYCONTROLPACKET23_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET23_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET24_ISADDR */
#define PRIMARYCONTROLPACKET24_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET24_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET24_IDADDR */
#define PRIMARYCONTROLPACKET24_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET24_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET24_ITCOUNT */
#define PRIMARYCONTROLPACKET24_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET24_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET24_ITCOUNT */
#define PRIMARYCONTROLPACKET24_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET24_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET24_CHCTRL */
#define PRIMARYCONTROLPACKET24_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET24_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET24_CHCTRL */
#define PRIMARYCONTROLPACKET24_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET24_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET24_CHCTRL */
#define PRIMARYCONTROLPACKET24_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET24_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET24_CHCTRL */
#define PRIMARYCONTROLPACKET24_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET24_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET24_CHCTRL */
#define PRIMARYCONTROLPACKET24_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET24_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET24_CHCTRL */
#define PRIMARYCONTROLPACKET24_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET24_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET24_CHCTRL */
#define PRIMARYCONTROLPACKET24_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET24_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET24_EIOFF */
#define PRIMARYCONTROLPACKET24_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET24_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET24_EIOFF */
#define PRIMARYCONTROLPACKET24_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET24_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET24_FIOFF */
#define PRIMARYCONTROLPACKET24_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET24_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET24_FIOFF */
#define PRIMARYCONTROLPACKET24_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET24_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET25_ISADDR */
#define PRIMARYCONTROLPACKET25_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET25_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET25_IDADDR */
#define PRIMARYCONTROLPACKET25_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET25_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET25_ITCOUNT */
#define PRIMARYCONTROLPACKET25_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET25_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET25_ITCOUNT */
#define PRIMARYCONTROLPACKET25_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET25_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET25_CHCTRL */
#define PRIMARYCONTROLPACKET25_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET25_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET25_CHCTRL */
#define PRIMARYCONTROLPACKET25_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET25_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET25_CHCTRL */
#define PRIMARYCONTROLPACKET25_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET25_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET25_CHCTRL */
#define PRIMARYCONTROLPACKET25_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET25_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET25_CHCTRL */
#define PRIMARYCONTROLPACKET25_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET25_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET25_CHCTRL */
#define PRIMARYCONTROLPACKET25_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET25_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET25_CHCTRL */
#define PRIMARYCONTROLPACKET25_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET25_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET25_EIOFF */
#define PRIMARYCONTROLPACKET25_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET25_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET25_EIOFF */
#define PRIMARYCONTROLPACKET25_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET25_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET25_FIOFF */
#define PRIMARYCONTROLPACKET25_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET25_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET25_FIOFF */
#define PRIMARYCONTROLPACKET25_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET25_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET26_ISADDR */
#define PRIMARYCONTROLPACKET26_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET26_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET26_IDADDR */
#define PRIMARYCONTROLPACKET26_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET26_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET26_ITCOUNT */
#define PRIMARYCONTROLPACKET26_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET26_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET26_ITCOUNT */
#define PRIMARYCONTROLPACKET26_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET26_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET26_CHCTRL */
#define PRIMARYCONTROLPACKET26_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET26_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET26_CHCTRL */
#define PRIMARYCONTROLPACKET26_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET26_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET26_CHCTRL */
#define PRIMARYCONTROLPACKET26_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET26_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET26_CHCTRL */
#define PRIMARYCONTROLPACKET26_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET26_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET26_CHCTRL */
#define PRIMARYCONTROLPACKET26_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET26_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET26_CHCTRL */
#define PRIMARYCONTROLPACKET26_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET26_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET26_CHCTRL */
#define PRIMARYCONTROLPACKET26_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET26_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET26_EIOFF */
#define PRIMARYCONTROLPACKET26_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET26_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET26_EIOFF */
#define PRIMARYCONTROLPACKET26_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET26_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET26_FIOFF */
#define PRIMARYCONTROLPACKET26_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET26_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET26_FIOFF */
#define PRIMARYCONTROLPACKET26_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET26_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET27_ISADDR */
#define PRIMARYCONTROLPACKET27_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET27_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET27_IDADDR */
#define PRIMARYCONTROLPACKET27_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET27_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET27_ITCOUNT */
#define PRIMARYCONTROLPACKET27_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET27_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET27_ITCOUNT */
#define PRIMARYCONTROLPACKET27_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET27_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET27_CHCTRL */
#define PRIMARYCONTROLPACKET27_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET27_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET27_CHCTRL */
#define PRIMARYCONTROLPACKET27_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET27_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET27_CHCTRL */
#define PRIMARYCONTROLPACKET27_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET27_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET27_CHCTRL */
#define PRIMARYCONTROLPACKET27_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET27_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET27_CHCTRL */
#define PRIMARYCONTROLPACKET27_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET27_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET27_CHCTRL */
#define PRIMARYCONTROLPACKET27_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET27_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET27_CHCTRL */
#define PRIMARYCONTROLPACKET27_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET27_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET27_EIOFF */
#define PRIMARYCONTROLPACKET27_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET27_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET27_EIOFF */
#define PRIMARYCONTROLPACKET27_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET27_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET27_FIOFF */
#define PRIMARYCONTROLPACKET27_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET27_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET27_FIOFF */
#define PRIMARYCONTROLPACKET27_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET27_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET28_ISADDR */
#define PRIMARYCONTROLPACKET28_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET28_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET28_IDADDR */
#define PRIMARYCONTROLPACKET28_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET28_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET28_ITCOUNT */
#define PRIMARYCONTROLPACKET28_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET28_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET28_ITCOUNT */
#define PRIMARYCONTROLPACKET28_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET28_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET28_CHCTRL */
#define PRIMARYCONTROLPACKET28_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET28_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET28_CHCTRL */
#define PRIMARYCONTROLPACKET28_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET28_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET28_CHCTRL */
#define PRIMARYCONTROLPACKET28_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET28_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET28_CHCTRL */
#define PRIMARYCONTROLPACKET28_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET28_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET28_CHCTRL */
#define PRIMARYCONTROLPACKET28_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET28_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET28_CHCTRL */
#define PRIMARYCONTROLPACKET28_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET28_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET28_CHCTRL */
#define PRIMARYCONTROLPACKET28_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET28_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET28_EIOFF */
#define PRIMARYCONTROLPACKET28_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET28_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET28_EIOFF */
#define PRIMARYCONTROLPACKET28_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET28_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET28_FIOFF */
#define PRIMARYCONTROLPACKET28_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET28_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET28_FIOFF */
#define PRIMARYCONTROLPACKET28_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET28_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET29_ISADDR */
#define PRIMARYCONTROLPACKET29_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET29_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET29_IDADDR */
#define PRIMARYCONTROLPACKET29_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET29_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET29_ITCOUNT */
#define PRIMARYCONTROLPACKET29_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET29_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET29_ITCOUNT */
#define PRIMARYCONTROLPACKET29_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET29_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET29_CHCTRL */
#define PRIMARYCONTROLPACKET29_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET29_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET29_CHCTRL */
#define PRIMARYCONTROLPACKET29_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET29_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET29_CHCTRL */
#define PRIMARYCONTROLPACKET29_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET29_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET29_CHCTRL */
#define PRIMARYCONTROLPACKET29_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET29_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET29_CHCTRL */
#define PRIMARYCONTROLPACKET29_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET29_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET29_CHCTRL */
#define PRIMARYCONTROLPACKET29_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET29_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET29_CHCTRL */
#define PRIMARYCONTROLPACKET29_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET29_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET29_EIOFF */
#define PRIMARYCONTROLPACKET29_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET29_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET29_EIOFF */
#define PRIMARYCONTROLPACKET29_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET29_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET29_FIOFF */
#define PRIMARYCONTROLPACKET29_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET29_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET29_FIOFF */
#define PRIMARYCONTROLPACKET29_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET29_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET30_ISADDR */
#define PRIMARYCONTROLPACKET30_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET30_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET30_IDADDR */
#define PRIMARYCONTROLPACKET30_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET30_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET30_ITCOUNT */
#define PRIMARYCONTROLPACKET30_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET30_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET30_ITCOUNT */
#define PRIMARYCONTROLPACKET30_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET30_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET30_CHCTRL */
#define PRIMARYCONTROLPACKET30_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET30_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET30_CHCTRL */
#define PRIMARYCONTROLPACKET30_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET30_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET30_CHCTRL */
#define PRIMARYCONTROLPACKET30_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET30_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET30_CHCTRL */
#define PRIMARYCONTROLPACKET30_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET30_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET30_CHCTRL */
#define PRIMARYCONTROLPACKET30_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET30_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET30_CHCTRL */
#define PRIMARYCONTROLPACKET30_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET30_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET30_CHCTRL */
#define PRIMARYCONTROLPACKET30_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET30_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET30_EIOFF */
#define PRIMARYCONTROLPACKET30_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET30_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET30_EIOFF */
#define PRIMARYCONTROLPACKET30_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET30_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET30_FIOFF */
#define PRIMARYCONTROLPACKET30_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET30_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET30_FIOFF */
#define PRIMARYCONTROLPACKET30_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET30_FIOFF_FIDXD_BIT_END          28U

/* Definition for field ISADDR in Register PRIMARYCONTROLPACKET31_ISADDR */
#define PRIMARYCONTROLPACKET31_ISADDR_ISADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET31_ISADDR_ISADDR_BIT_END        31U

/* Definition for field IDADDR in Register PRIMARYCONTROLPACKET31_IDADDR */
#define PRIMARYCONTROLPACKET31_IDADDR_IDADDR_BIT_START      0U
#define PRIMARYCONTROLPACKET31_IDADDR_IDADDR_BIT_END        31U

/* Definition for field IETCOUNT in Register PRIMARYCONTROLPACKET31_ITCOUNT */
#define PRIMARYCONTROLPACKET31_ITCOUNT_IETCOUNT_BIT_START   0U
#define PRIMARYCONTROLPACKET31_ITCOUNT_IETCOUNT_BIT_END     12U

/* Definition for field IFTCOUNT in Register PRIMARYCONTROLPACKET31_ITCOUNT */
#define PRIMARYCONTROLPACKET31_ITCOUNT_IFTCOUNT_BIT_START   16U
#define PRIMARYCONTROLPACKET31_ITCOUNT_IFTCOUNT_BIT_END     28U

/* Definition for field AIM in Register PRIMARYCONTROLPACKET31_CHCTRL */
#define PRIMARYCONTROLPACKET31_CHCTRL_AIM_BIT_START         0U
#define PRIMARYCONTROLPACKET31_CHCTRL_AIM_BIT_END           0U

/* Definition for field ADDMW in Register PRIMARYCONTROLPACKET31_CHCTRL */
#define PRIMARYCONTROLPACKET31_CHCTRL_ADDMW_BIT_START       1U
#define PRIMARYCONTROLPACKET31_CHCTRL_ADDMW_BIT_END         2U

/* Definition for field ADDMR in Register PRIMARYCONTROLPACKET31_CHCTRL */
#define PRIMARYCONTROLPACKET31_CHCTRL_ADDMR_BIT_START       3U
#define PRIMARYCONTROLPACKET31_CHCTRL_ADDMR_BIT_END         4U

/* Definition for field TTYPE in Register PRIMARYCONTROLPACKET31_CHCTRL */
#define PRIMARYCONTROLPACKET31_CHCTRL_TTYPE_BIT_START       8U
#define PRIMARYCONTROLPACKET31_CHCTRL_TTYPE_BIT_END         8U

/* Definition for field WES in Register PRIMARYCONTROLPACKET31_CHCTRL */
#define PRIMARYCONTROLPACKET31_CHCTRL_WES_BIT_START         12U
#define PRIMARYCONTROLPACKET31_CHCTRL_WES_BIT_END           13U

/* Definition for field RES in Register PRIMARYCONTROLPACKET31_CHCTRL */
#define PRIMARYCONTROLPACKET31_CHCTRL_RES_BIT_START         14U
#define PRIMARYCONTROLPACKET31_CHCTRL_RES_BIT_END           15U

/* Definition for field CHAIN in Register PRIMARYCONTROLPACKET31_CHCTRL */
#define PRIMARYCONTROLPACKET31_CHCTRL_CHAIN_BIT_START       16U
#define PRIMARYCONTROLPACKET31_CHCTRL_CHAIN_BIT_END         21U

/* Definition for field EIDXS in Register PRIMARYCONTROLPACKET31_EIOFF */
#define PRIMARYCONTROLPACKET31_EIOFF_EIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET31_EIOFF_EIDXS_BIT_END          12U

/* Definition for field EIDXD in Register PRIMARYCONTROLPACKET31_EIOFF */
#define PRIMARYCONTROLPACKET31_EIOFF_EIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET31_EIOFF_EIDXD_BIT_END          28U

/* Definition for field FIDXS in Register PRIMARYCONTROLPACKET31_FIOFF */
#define PRIMARYCONTROLPACKET31_FIOFF_FIDXS_BIT_START        0U
#define PRIMARYCONTROLPACKET31_FIOFF_FIDXS_BIT_END          12U

/* Definition for field FIDXD in Register PRIMARYCONTROLPACKET31_FIOFF */
#define PRIMARYCONTROLPACKET31_FIOFF_FIDXD_BIT_START        16U
#define PRIMARYCONTROLPACKET31_FIOFF_FIDXD_BIT_END          28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET0_CSADDR */
#define WORKINGCONTROLPACKET0_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET0_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET0_CDADDR */
#define WORKINGCONTROLPACKET0_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET0_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET0_CTCOUNT */
#define WORKINGCONTROLPACKET0_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET0_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET0_CTCOUNT */
#define WORKINGCONTROLPACKET0_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET0_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET1_CSADDR */
#define WORKINGCONTROLPACKET1_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET1_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET1_CDADDR */
#define WORKINGCONTROLPACKET1_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET1_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET1_CTCOUNT */
#define WORKINGCONTROLPACKET1_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET1_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET1_CTCOUNT */
#define WORKINGCONTROLPACKET1_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET1_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET2_CSADDR */
#define WORKINGCONTROLPACKET2_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET2_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET2_CDADDR */
#define WORKINGCONTROLPACKET2_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET2_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET2_CTCOUNT */
#define WORKINGCONTROLPACKET2_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET2_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET2_CTCOUNT */
#define WORKINGCONTROLPACKET2_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET2_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET3_CSADDR */
#define WORKINGCONTROLPACKET3_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET3_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET3_CDADDR */
#define WORKINGCONTROLPACKET3_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET3_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET3_CTCOUNT */
#define WORKINGCONTROLPACKET3_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET3_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET3_CTCOUNT */
#define WORKINGCONTROLPACKET3_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET3_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET4_CSADDR */
#define WORKINGCONTROLPACKET4_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET4_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET4_CDADDR */
#define WORKINGCONTROLPACKET4_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET4_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET4_CTCOUNT */
#define WORKINGCONTROLPACKET4_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET4_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET4_CTCOUNT */
#define WORKINGCONTROLPACKET4_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET4_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET5_CSADDR */
#define WORKINGCONTROLPACKET5_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET5_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET5_CDADDR */
#define WORKINGCONTROLPACKET5_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET5_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET5_CTCOUNT */
#define WORKINGCONTROLPACKET5_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET5_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET5_CTCOUNT */
#define WORKINGCONTROLPACKET5_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET5_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET6_CSADDR */
#define WORKINGCONTROLPACKET6_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET6_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET6_CDADDR */
#define WORKINGCONTROLPACKET6_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET6_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET6_CTCOUNT */
#define WORKINGCONTROLPACKET6_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET6_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET6_CTCOUNT */
#define WORKINGCONTROLPACKET6_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET6_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET7_CSADDR */
#define WORKINGCONTROLPACKET7_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET7_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET7_CDADDR */
#define WORKINGCONTROLPACKET7_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET7_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET7_CTCOUNT */
#define WORKINGCONTROLPACKET7_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET7_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET7_CTCOUNT */
#define WORKINGCONTROLPACKET7_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET7_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET8_CSADDR */
#define WORKINGCONTROLPACKET8_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET8_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET8_CDADDR */
#define WORKINGCONTROLPACKET8_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET8_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET8_CTCOUNT */
#define WORKINGCONTROLPACKET8_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET8_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET8_CTCOUNT */
#define WORKINGCONTROLPACKET8_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET8_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET9_CSADDR */
#define WORKINGCONTROLPACKET9_CSADDR_CSADDR_BIT_START       0U
#define WORKINGCONTROLPACKET9_CSADDR_CSADDR_BIT_END         31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET9_CDADDR */
#define WORKINGCONTROLPACKET9_CDADDR_CDADDR_BIT_START       0U
#define WORKINGCONTROLPACKET9_CDADDR_CDADDR_BIT_END         31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET9_CTCOUNT */
#define WORKINGCONTROLPACKET9_CTCOUNT_CETCOUNT_BIT_START    0U
#define WORKINGCONTROLPACKET9_CTCOUNT_CETCOUNT_BIT_END      12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET9_CTCOUNT */
#define WORKINGCONTROLPACKET9_CTCOUNT_CFTCOUNT_BIT_START    16U
#define WORKINGCONTROLPACKET9_CTCOUNT_CFTCOUNT_BIT_END      28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET10_CSADDR */
#define WORKINGCONTROLPACKET10_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET10_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET10_CDADDR */
#define WORKINGCONTROLPACKET10_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET10_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET10_CTCOUNT */
#define WORKINGCONTROLPACKET10_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET10_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET10_CTCOUNT */
#define WORKINGCONTROLPACKET10_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET10_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET11_CSADDR */
#define WORKINGCONTROLPACKET11_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET11_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET11_CDADDR */
#define WORKINGCONTROLPACKET11_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET11_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET11_CTCOUNT */
#define WORKINGCONTROLPACKET11_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET11_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET11_CTCOUNT */
#define WORKINGCONTROLPACKET11_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET11_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET12_CSADDR */
#define WORKINGCONTROLPACKET12_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET12_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET12_CDADDR */
#define WORKINGCONTROLPACKET12_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET12_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET12_CTCOUNT */
#define WORKINGCONTROLPACKET12_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET12_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET12_CTCOUNT */
#define WORKINGCONTROLPACKET12_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET12_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET13_CSADDR */
#define WORKINGCONTROLPACKET13_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET13_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET13_CDADDR */
#define WORKINGCONTROLPACKET13_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET13_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET13_CTCOUNT */
#define WORKINGCONTROLPACKET13_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET13_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET13_CTCOUNT */
#define WORKINGCONTROLPACKET13_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET13_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET14_CSADDR */
#define WORKINGCONTROLPACKET14_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET14_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET14_CDADDR */
#define WORKINGCONTROLPACKET14_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET14_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET14_CTCOUNT */
#define WORKINGCONTROLPACKET14_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET14_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET14_CTCOUNT */
#define WORKINGCONTROLPACKET14_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET14_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET15_CSADDR */
#define WORKINGCONTROLPACKET15_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET15_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET15_CDADDR */
#define WORKINGCONTROLPACKET15_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET15_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET15_CTCOUNT */
#define WORKINGCONTROLPACKET15_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET15_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET15_CTCOUNT */
#define WORKINGCONTROLPACKET15_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET15_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET16_CSADDR */
#define WORKINGCONTROLPACKET16_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET16_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET16_CDADDR */
#define WORKINGCONTROLPACKET16_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET16_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET16_CTCOUNT */
#define WORKINGCONTROLPACKET16_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET16_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET16_CTCOUNT */
#define WORKINGCONTROLPACKET16_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET16_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET17_CSADDR */
#define WORKINGCONTROLPACKET17_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET17_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET17_CDADDR */
#define WORKINGCONTROLPACKET17_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET17_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET17_CTCOUNT */
#define WORKINGCONTROLPACKET17_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET17_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET17_CTCOUNT */
#define WORKINGCONTROLPACKET17_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET17_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET18_CSADDR */
#define WORKINGCONTROLPACKET18_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET18_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET18_CDADDR */
#define WORKINGCONTROLPACKET18_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET18_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET18_CTCOUNT */
#define WORKINGCONTROLPACKET18_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET18_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET18_CTCOUNT */
#define WORKINGCONTROLPACKET18_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET18_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET19_CSADDR */
#define WORKINGCONTROLPACKET19_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET19_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET19_CDADDR */
#define WORKINGCONTROLPACKET19_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET19_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET19_CTCOUNT */
#define WORKINGCONTROLPACKET19_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET19_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET19_CTCOUNT */
#define WORKINGCONTROLPACKET19_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET19_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET20_CSADDR */
#define WORKINGCONTROLPACKET20_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET20_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET20_CDADDR */
#define WORKINGCONTROLPACKET20_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET20_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET20_CTCOUNT */
#define WORKINGCONTROLPACKET20_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET20_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET20_CTCOUNT */
#define WORKINGCONTROLPACKET20_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET20_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET21_CSADDR */
#define WORKINGCONTROLPACKET21_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET21_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET21_CDADDR */
#define WORKINGCONTROLPACKET21_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET21_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET21_CTCOUNT */
#define WORKINGCONTROLPACKET21_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET21_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET21_CTCOUNT */
#define WORKINGCONTROLPACKET21_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET21_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET22_CSADDR */
#define WORKINGCONTROLPACKET22_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET22_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET22_CDADDR */
#define WORKINGCONTROLPACKET22_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET22_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET22_CTCOUNT */
#define WORKINGCONTROLPACKET22_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET22_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET22_CTCOUNT */
#define WORKINGCONTROLPACKET22_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET22_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET23_CSADDR */
#define WORKINGCONTROLPACKET23_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET23_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET23_CDADDR */
#define WORKINGCONTROLPACKET23_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET23_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET23_CTCOUNT */
#define WORKINGCONTROLPACKET23_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET23_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET23_CTCOUNT */
#define WORKINGCONTROLPACKET23_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET23_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET24_CSADDR */
#define WORKINGCONTROLPACKET24_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET24_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET24_CDADDR */
#define WORKINGCONTROLPACKET24_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET24_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET24_CTCOUNT */
#define WORKINGCONTROLPACKET24_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET24_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET24_CTCOUNT */
#define WORKINGCONTROLPACKET24_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET24_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET25_CSADDR */
#define WORKINGCONTROLPACKET25_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET25_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET25_CDADDR */
#define WORKINGCONTROLPACKET25_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET25_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET25_CTCOUNT */
#define WORKINGCONTROLPACKET25_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET25_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET25_CTCOUNT */
#define WORKINGCONTROLPACKET25_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET25_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET26_CSADDR */
#define WORKINGCONTROLPACKET26_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET26_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET26_CDADDR */
#define WORKINGCONTROLPACKET26_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET26_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET26_CTCOUNT */
#define WORKINGCONTROLPACKET26_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET26_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET26_CTCOUNT */
#define WORKINGCONTROLPACKET26_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET26_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET27_CSADDR */
#define WORKINGCONTROLPACKET27_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET27_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET27_CDADDR */
#define WORKINGCONTROLPACKET27_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET27_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET27_CTCOUNT */
#define WORKINGCONTROLPACKET27_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET27_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET27_CTCOUNT */
#define WORKINGCONTROLPACKET27_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET27_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET28_CSADDR */
#define WORKINGCONTROLPACKET28_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET28_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET28_CDADDR */
#define WORKINGCONTROLPACKET28_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET28_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET28_CTCOUNT */
#define WORKINGCONTROLPACKET28_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET28_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET28_CTCOUNT */
#define WORKINGCONTROLPACKET28_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET28_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET29_CSADDR */
#define WORKINGCONTROLPACKET29_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET29_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET29_CDADDR */
#define WORKINGCONTROLPACKET29_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET29_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET29_CTCOUNT */
#define WORKINGCONTROLPACKET29_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET29_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET29_CTCOUNT */
#define WORKINGCONTROLPACKET29_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET29_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET30_CSADDR */
#define WORKINGCONTROLPACKET30_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET30_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET30_CDADDR */
#define WORKINGCONTROLPACKET30_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET30_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET30_CTCOUNT */
#define WORKINGCONTROLPACKET30_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET30_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET30_CTCOUNT */
#define WORKINGCONTROLPACKET30_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET30_CTCOUNT_CFTCOUNT_BIT_END     28U

/* Definition for field CSADDR in Register WORKINGCONTROLPACKET31_CSADDR */
#define WORKINGCONTROLPACKET31_CSADDR_CSADDR_BIT_START      0U
#define WORKINGCONTROLPACKET31_CSADDR_CSADDR_BIT_END        31U

/* Definition for field CDADDR in Register WORKINGCONTROLPACKET31_CDADDR */
#define WORKINGCONTROLPACKET31_CDADDR_CDADDR_BIT_START      0U
#define WORKINGCONTROLPACKET31_CDADDR_CDADDR_BIT_END        31U

/* Definition for field CETCOUNT in Register WORKINGCONTROLPACKET31_CTCOUNT */
#define WORKINGCONTROLPACKET31_CTCOUNT_CETCOUNT_BIT_START   0U
#define WORKINGCONTROLPACKET31_CTCOUNT_CETCOUNT_BIT_END     12U

/* Definition for field CFTCOUNT in Register WORKINGCONTROLPACKET31_CTCOUNT */
#define WORKINGCONTROLPACKET31_CTCOUNT_CFTCOUNT_BIT_START   16U
#define WORKINGCONTROLPACKET31_CTCOUNT_CFTCOUNT_BIT_END     28U


/**
 * @struct DMARAMRegs_t
 * @brief
 *   Module MSS_DMA_RAM Register Definition
 * @details
 *   This structure is used to access the MSS_DMA_RAM module registers.
 */
/**
 * @typedef DMARAMRegs
 * @brief
 *   Module MSS_DMA_RAM Register Frame type Definition
 * @details
 *   This type is used to access the MSS_DMA_RAM module registers.
 */
typedef volatile struct DMARAMRegs_t
{
    uint32_t    PRIMARYCONTROLPACKET0_ISADDR       ;        /* Offset = 0x000 */
    uint32_t    PRIMARYCONTROLPACKET0_IDADDR       ;        /* Offset = 0x004 */
    uint32_t    PRIMARYCONTROLPACKET0_ITCOUNT      ;        /* Offset = 0x008 */
    uint32_t    PRIMARYCONTROLPACKET0-RESERVED1    ;        /* Offset = 0x00C */
    uint32_t    PRIMARYCONTROLPACKET0_CHCTRL       ;        /* Offset = 0x010 */
    uint32_t    PRIMARYCONTROLPACKET0_EIOFF        ;        /* Offset = 0x014 */
    uint32_t    PRIMARYCONTROLPACKET0_FIOFF        ;        /* Offset = 0x018 */
    uint32_t    PRIMARYCONTROLPACKET0-RESERVED2    ;        /* Offset = 0x01C */
    uint32_t    PRIMARYCONTROLPACKET1_ISADDR       ;        /* Offset = 0x020 */
    uint32_t    PRIMARYCONTROLPACKET1_IDADDR       ;        /* Offset = 0x024 */
    uint32_t    PRIMARYCONTROLPACKET1_ITCOUNT      ;        /* Offset = 0x028 */
    uint32_t    PRIMARYCONTROLPACKET1-RESERVED1    ;        /* Offset = 0x02C */
    uint32_t    PRIMARYCONTROLPACKET1_CHCTRL       ;        /* Offset = 0x030 */
    uint32_t    PRIMARYCONTROLPACKET1_EIOFF        ;        /* Offset = 0x034 */
    uint32_t    PRIMARYCONTROLPACKET1_FIOFF        ;        /* Offset = 0x038 */
    uint32_t    PRIMARYCONTROLPACKET1-RESERVED2    ;        /* Offset = 0x03C */
    uint32_t    PRIMARYCONTROLPACKET2_ISADDR       ;        /* Offset = 0x040 */
    uint32_t    PRIMARYCONTROLPACKET2_IDADDR       ;        /* Offset = 0x044 */
    uint32_t    PRIMARYCONTROLPACKET2_ITCOUNT      ;        /* Offset = 0x048 */
    uint32_t    PRIMARYCONTROLPACKET2-RESERVED1    ;        /* Offset = 0x04C */
    uint32_t    PRIMARYCONTROLPACKET2_CHCTRL       ;        /* Offset = 0x050 */
    uint32_t    PRIMARYCONTROLPACKET2_EIOFF        ;        /* Offset = 0x054 */
    uint32_t    PRIMARYCONTROLPACKET2_FIOFF        ;        /* Offset = 0x058 */
    uint32_t    PRIMARYCONTROLPACKET2-RESERVED2    ;        /* Offset = 0x05C */
    uint32_t    PRIMARYCONTROLPACKET3_ISADDR       ;        /* Offset = 0x060 */
    uint32_t    PRIMARYCONTROLPACKET3_IDADDR       ;        /* Offset = 0x064 */
    uint32_t    PRIMARYCONTROLPACKET3_ITCOUNT      ;        /* Offset = 0x068 */
    uint32_t    PRIMARYCONTROLPACKET3-RESERVED1    ;        /* Offset = 0x06C */
    uint32_t    PRIMARYCONTROLPACKET3_CHCTRL       ;        /* Offset = 0x070 */
    uint32_t    PRIMARYCONTROLPACKET3_EIOFF        ;        /* Offset = 0x074 */
    uint32_t    PRIMARYCONTROLPACKET3_FIOFF        ;        /* Offset = 0x078 */
    uint32_t    PRIMARYCONTROLPACKET3-RESERVED2    ;        /* Offset = 0x07C */
    uint32_t    PRIMARYCONTROLPACKET4_ISADDR       ;        /* Offset = 0x080 */
    uint32_t    PRIMARYCONTROLPACKET4_IDADDR       ;        /* Offset = 0x084 */
    uint32_t    PRIMARYCONTROLPACKET4_ITCOUNT      ;        /* Offset = 0x088 */
    uint32_t    PRIMARYCONTROLPACKET4-RESERVED1    ;        /* Offset = 0x08C */
    uint32_t    PRIMARYCONTROLPACKET4_CHCTRL       ;        /* Offset = 0x090 */
    uint32_t    PRIMARYCONTROLPACKET4_EIOFF        ;        /* Offset = 0x094 */
    uint32_t    PRIMARYCONTROLPACKET4_FIOFF        ;        /* Offset = 0x098 */
    uint32_t    PRIMARYCONTROLPACKET4-RESERVED2    ;        /* Offset = 0x09C */
    uint32_t    PRIMARYCONTROLPACKET5_ISADDR       ;        /* Offset = 0x0A0 */
    uint32_t    PRIMARYCONTROLPACKET5_IDADDR       ;        /* Offset = 0x0A4 */
    uint32_t    PRIMARYCONTROLPACKET5_ITCOUNT      ;        /* Offset = 0x0A8 */
    uint32_t    PRIMARYCONTROLPACKET5-RESERVED1    ;        /* Offset = 0x0AC */
    uint32_t    PRIMARYCONTROLPACKET5_CHCTRL       ;        /* Offset = 0x0B0 */
    uint32_t    PRIMARYCONTROLPACKET5_EIOFF        ;        /* Offset = 0x0B4 */
    uint32_t    PRIMARYCONTROLPACKET5_FIOFF        ;        /* Offset = 0x0B8 */
    uint32_t    PRIMARYCONTROLPACKET5-RESERVED2    ;        /* Offset = 0x0BC */
    uint32_t    PRIMARYCONTROLPACKET6_ISADDR       ;        /* Offset = 0x0C0 */
    uint32_t    PRIMARYCONTROLPACKET6_IDADDR       ;        /* Offset = 0x0C4 */
    uint32_t    PRIMARYCONTROLPACKET6_ITCOUNT      ;        /* Offset = 0x0C8 */
    uint32_t    PRIMARYCONTROLPACKET6-RESERVED1    ;        /* Offset = 0x0CC */
    uint32_t    PRIMARYCONTROLPACKET6_CHCTRL       ;        /* Offset = 0x0D0 */
    uint32_t    PRIMARYCONTROLPACKET6_EIOFF        ;        /* Offset = 0x0D4 */
    uint32_t    PRIMARYCONTROLPACKET6_FIOFF        ;        /* Offset = 0x0D8 */
    uint32_t    PRIMARYCONTROLPACKET6-RESERVED2    ;        /* Offset = 0x0DC */
    uint32_t    PRIMARYCONTROLPACKET7_ISADDR       ;        /* Offset = 0x0E0 */
    uint32_t    PRIMARYCONTROLPACKET7_IDADDR       ;        /* Offset = 0x0E4 */
    uint32_t    PRIMARYCONTROLPACKET7_ITCOUNT      ;        /* Offset = 0x0E8 */
    uint32_t    PRIMARYCONTROLPACKET7-RESERVED1    ;        /* Offset = 0x0EC */
    uint32_t    PRIMARYCONTROLPACKET7_CHCTRL       ;        /* Offset = 0x0F0 */
    uint32_t    PRIMARYCONTROLPACKET7_EIOFF        ;        /* Offset = 0x0F4 */
    uint32_t    PRIMARYCONTROLPACKET7_FIOFF        ;        /* Offset = 0x0F8 */
    uint32_t    PRIMARYCONTROLPACKET7-RESERVED2    ;        /* Offset = 0x0FC */
    uint32_t    PRIMARYCONTROLPACKET8_ISADDR       ;        /* Offset = 0x100 */
    uint32_t    PRIMARYCONTROLPACKET8_IDADDR       ;        /* Offset = 0x104 */
    uint32_t    PRIMARYCONTROLPACKET8_ITCOUNT      ;        /* Offset = 0x108 */
    uint32_t    PRIMARYCONTROLPACKET8-RESERVED1    ;        /* Offset = 0x10C */
    uint32_t    PRIMARYCONTROLPACKET8_CHCTRL       ;        /* Offset = 0x110 */
    uint32_t    PRIMARYCONTROLPACKET8_EIOFF        ;        /* Offset = 0x114 */
    uint32_t    PRIMARYCONTROLPACKET8_FIOFF        ;        /* Offset = 0x118 */
    uint32_t    PRIMARYCONTROLPACKET8-RESERVED2    ;        /* Offset = 0x11C */
    uint32_t    PRIMARYCONTROLPACKET9_ISADDR       ;        /* Offset = 0x120 */
    uint32_t    PRIMARYCONTROLPACKET9_IDADDR       ;        /* Offset = 0x124 */
    uint32_t    PRIMARYCONTROLPACKET9_ITCOUNT      ;        /* Offset = 0x128 */
    uint32_t    PRIMARYCONTROLPACKET9-RESERVED1    ;        /* Offset = 0x12C */
    uint32_t    PRIMARYCONTROLPACKET9_CHCTRL       ;        /* Offset = 0x130 */
    uint32_t    PRIMARYCONTROLPACKET9_EIOFF        ;        /* Offset = 0x134 */
    uint32_t    PRIMARYCONTROLPACKET9_FIOFF        ;        /* Offset = 0x138 */
    uint32_t    PRIMARYCONTROLPACKET9-RESERVED2    ;        /* Offset = 0x13C */
    uint32_t    PRIMARYCONTROLPACKET10_ISADDR      ;        /* Offset = 0x140 */
    uint32_t    PRIMARYCONTROLPACKET10_IDADDR      ;        /* Offset = 0x144 */
    uint32_t    PRIMARYCONTROLPACKET10_ITCOUNT     ;        /* Offset = 0x148 */
    uint32_t    PRIMARYCONTROLPACKET10-RESERVED1   ;        /* Offset = 0x14C */
    uint32_t    PRIMARYCONTROLPACKET10_CHCTRL      ;        /* Offset = 0x150 */
    uint32_t    PRIMARYCONTROLPACKET10_EIOFF       ;        /* Offset = 0x154 */
    uint32_t    PRIMARYCONTROLPACKET10_FIOFF       ;        /* Offset = 0x158 */
    uint32_t    PRIMARYCONTROLPACKET10-RESERVED2   ;        /* Offset = 0x15C */
    uint32_t    PRIMARYCONTROLPACKET11_ISADDR      ;        /* Offset = 0x160 */
    uint32_t    PRIMARYCONTROLPACKET11_IDADDR      ;        /* Offset = 0x164 */
    uint32_t    PRIMARYCONTROLPACKET11_ITCOUNT     ;        /* Offset = 0x168 */
    uint32_t    PRIMARYCONTROLPACKET11-RESERVED1   ;        /* Offset = 0x16C */
    uint32_t    PRIMARYCONTROLPACKET11_CHCTRL      ;        /* Offset = 0x170 */
    uint32_t    PRIMARYCONTROLPACKET11_EIOFF       ;        /* Offset = 0x174 */
    uint32_t    PRIMARYCONTROLPACKET11_FIOFF       ;        /* Offset = 0x178 */
    uint32_t    PRIMARYCONTROLPACKET11-RESERVED2   ;        /* Offset = 0x17C */
    uint32_t    PRIMARYCONTROLPACKET12_ISADDR      ;        /* Offset = 0x180 */
    uint32_t    PRIMARYCONTROLPACKET12_IDADDR      ;        /* Offset = 0x184 */
    uint32_t    PRIMARYCONTROLPACKET12_ITCOUNT     ;        /* Offset = 0x188 */
    uint32_t    PRIMARYCONTROLPACKET12-RESERVED1   ;        /* Offset = 0x18C */
    uint32_t    PRIMARYCONTROLPACKET12_CHCTRL      ;        /* Offset = 0x190 */
    uint32_t    PRIMARYCONTROLPACKET12_EIOFF       ;        /* Offset = 0x194 */
    uint32_t    PRIMARYCONTROLPACKET12_FIOFF       ;        /* Offset = 0x198 */
    uint32_t    PRIMARYCONTROLPACKET12-RESERVED2   ;        /* Offset = 0x19C */
    uint32_t    PRIMARYCONTROLPACKET13_ISADDR      ;        /* Offset = 0x1A0 */
    uint32_t    PRIMARYCONTROLPACKET13_IDADDR      ;        /* Offset = 0x1A4 */
    uint32_t    PRIMARYCONTROLPACKET13_ITCOUNT     ;        /* Offset = 0x1A8 */
    uint32_t    PRIMARYCONTROLPACKET13-RESERVED1   ;        /* Offset = 0x1AC */
    uint32_t    PRIMARYCONTROLPACKET13_CHCTRL      ;        /* Offset = 0x1B0 */
    uint32_t    PRIMARYCONTROLPACKET13_EIOFF       ;        /* Offset = 0x1B4 */
    uint32_t    PRIMARYCONTROLPACKET13_FIOFF       ;        /* Offset = 0x1B8 */
    uint32_t    PRIMARYCONTROLPACKET13-RESERVED2   ;        /* Offset = 0x1BC */
    uint32_t    PRIMARYCONTROLPACKET14_ISADDR      ;        /* Offset = 0x1C0 */
    uint32_t    PRIMARYCONTROLPACKET14_IDADDR      ;        /* Offset = 0x1C4 */
    uint32_t    PRIMARYCONTROLPACKET14_ITCOUNT     ;        /* Offset = 0x1C8 */
    uint32_t    PRIMARYCONTROLPACKET14-RESERVED1   ;        /* Offset = 0x1CC */
    uint32_t    PRIMARYCONTROLPACKET14_CHCTRL      ;        /* Offset = 0x1D0 */
    uint32_t    PRIMARYCONTROLPACKET14_EIOFF       ;        /* Offset = 0x1D4 */
    uint32_t    PRIMARYCONTROLPACKET14_FIOFF       ;        /* Offset = 0x1D8 */
    uint32_t    PRIMARYCONTROLPACKET14-RESERVED2   ;        /* Offset = 0x1DC */
    uint32_t    PRIMARYCONTROLPACKET15_ISADDR      ;        /* Offset = 0x1E0 */
    uint32_t    PRIMARYCONTROLPACKET15_IDADDR      ;        /* Offset = 0x1E4 */
    uint32_t    PRIMARYCONTROLPACKET15_ITCOUNT     ;        /* Offset = 0x1E8 */
    uint32_t    PRIMARYCONTROLPACKET15-RESERVED1   ;        /* Offset = 0x1EC */
    uint32_t    PRIMARYCONTROLPACKET15_CHCTRL      ;        /* Offset = 0x1F0 */
    uint32_t    PRIMARYCONTROLPACKET15_EIOFF       ;        /* Offset = 0x1F4 */
    uint32_t    PRIMARYCONTROLPACKET15_FIOFF       ;        /* Offset = 0x1F8 */
    uint32_t    PRIMARYCONTROLPACKET15-RESERVED2   ;        /* Offset = 0x1FC */
    uint32_t    PRIMARYCONTROLPACKET16_ISADDR      ;        /* Offset = 0x200 */
    uint32_t    PRIMARYCONTROLPACKET16_IDADDR      ;        /* Offset = 0x204 */
    uint32_t    PRIMARYCONTROLPACKET16_ITCOUNT     ;        /* Offset = 0x208 */
    uint32_t    PRIMARYCONTROLPACKET16-RESERVED1   ;        /* Offset = 0x20C */
    uint32_t    PRIMARYCONTROLPACKET16_CHCTRL      ;        /* Offset = 0x210 */
    uint32_t    PRIMARYCONTROLPACKET16_EIOFF       ;        /* Offset = 0x214 */
    uint32_t    PRIMARYCONTROLPACKET16_FIOFF       ;        /* Offset = 0x218 */
    uint32_t    PRIMARYCONTROLPACKET16-RESERVED2   ;        /* Offset = 0x21C */
    uint32_t    PRIMARYCONTROLPACKET17_ISADDR      ;        /* Offset = 0x220 */
    uint32_t    PRIMARYCONTROLPACKET17_IDADDR      ;        /* Offset = 0x224 */
    uint32_t    PRIMARYCONTROLPACKET17_ITCOUNT     ;        /* Offset = 0x228 */
    uint32_t    PRIMARYCONTROLPACKET17-RESERVED1   ;        /* Offset = 0x22C */
    uint32_t    PRIMARYCONTROLPACKET17_CHCTRL      ;        /* Offset = 0x230 */
    uint32_t    PRIMARYCONTROLPACKET17_EIOFF       ;        /* Offset = 0x234 */
    uint32_t    PRIMARYCONTROLPACKET17_FIOFF       ;        /* Offset = 0x238 */
    uint32_t    PRIMARYCONTROLPACKET17-RESERVED2   ;        /* Offset = 0x23C */
    uint32_t    PRIMARYCONTROLPACKET18_ISADDR      ;        /* Offset = 0x240 */
    uint32_t    PRIMARYCONTROLPACKET18_IDADDR      ;        /* Offset = 0x244 */
    uint32_t    PRIMARYCONTROLPACKET18_ITCOUNT     ;        /* Offset = 0x248 */
    uint32_t    PRIMARYCONTROLPACKET18-RESERVED1   ;        /* Offset = 0x24C */
    uint32_t    PRIMARYCONTROLPACKET18_CHCTRL      ;        /* Offset = 0x250 */
    uint32_t    PRIMARYCONTROLPACKET18_EIOFF       ;        /* Offset = 0x254 */
    uint32_t    PRIMARYCONTROLPACKET18_FIOFF       ;        /* Offset = 0x258 */
    uint32_t    PRIMARYCONTROLPACKET18-RESERVED2   ;        /* Offset = 0x25C */
    uint32_t    PRIMARYCONTROLPACKET19_ISADDR      ;        /* Offset = 0x260 */
    uint32_t    PRIMARYCONTROLPACKET19_IDADDR      ;        /* Offset = 0x264 */
    uint32_t    PRIMARYCONTROLPACKET19_ITCOUNT     ;        /* Offset = 0x268 */
    uint32_t    PRIMARYCONTROLPACKET19-RESERVED1   ;        /* Offset = 0x26C */
    uint32_t    PRIMARYCONTROLPACKET19_CHCTRL      ;        /* Offset = 0x270 */
    uint32_t    PRIMARYCONTROLPACKET19_EIOFF       ;        /* Offset = 0x274 */
    uint32_t    PRIMARYCONTROLPACKET19_FIOFF       ;        /* Offset = 0x278 */
    uint32_t    PRIMARYCONTROLPACKET19-RESERVED2   ;        /* Offset = 0x27C */
    uint32_t    PRIMARYCONTROLPACKET20_ISADDR      ;        /* Offset = 0x280 */
    uint32_t    PRIMARYCONTROLPACKET20_IDADDR      ;        /* Offset = 0x284 */
    uint32_t    PRIMARYCONTROLPACKET20_ITCOUNT     ;        /* Offset = 0x288 */
    uint32_t    PRIMARYCONTROLPACKET20-RESERVED1   ;        /* Offset = 0x28C */
    uint32_t    PRIMARYCONTROLPACKET20_CHCTRL      ;        /* Offset = 0x290 */
    uint32_t    PRIMARYCONTROLPACKET20_EIOFF       ;        /* Offset = 0x294 */
    uint32_t    PRIMARYCONTROLPACKET20_FIOFF       ;        /* Offset = 0x298 */
    uint32_t    PRIMARYCONTROLPACKET20-RESERVED2   ;        /* Offset = 0x29C */
    uint32_t    PRIMARYCONTROLPACKET21_ISADDR      ;        /* Offset = 0x2A0 */
    uint32_t    PRIMARYCONTROLPACKET21_IDADDR      ;        /* Offset = 0x2A4 */
    uint32_t    PRIMARYCONTROLPACKET21_ITCOUNT     ;        /* Offset = 0x2A8 */
    uint32_t    PRIMARYCONTROLPACKET21-RESERVED1   ;        /* Offset = 0x2AC */
    uint32_t    PRIMARYCONTROLPACKET21_CHCTRL      ;        /* Offset = 0x2B0 */
    uint32_t    PRIMARYCONTROLPACKET21_EIOFF       ;        /* Offset = 0x2B4 */
    uint32_t    PRIMARYCONTROLPACKET21_FIOFF       ;        /* Offset = 0x2B8 */
    uint32_t    PRIMARYCONTROLPACKET21-RESERVED2   ;        /* Offset = 0x2BC */
    uint32_t    PRIMARYCONTROLPACKET22_ISADDR      ;        /* Offset = 0x2C0 */
    uint32_t    PRIMARYCONTROLPACKET22_IDADDR      ;        /* Offset = 0x2C4 */
    uint32_t    PRIMARYCONTROLPACKET22_ITCOUNT     ;        /* Offset = 0x2C8 */
    uint32_t    PRIMARYCONTROLPACKET22-RESERVED1   ;        /* Offset = 0x2CC */
    uint32_t    PRIMARYCONTROLPACKET22_CHCTRL      ;        /* Offset = 0x2D0 */
    uint32_t    PRIMARYCONTROLPACKET22_EIOFF       ;        /* Offset = 0x2D4 */
    uint32_t    PRIMARYCONTROLPACKET22_FIOFF       ;        /* Offset = 0x2D8 */
    uint32_t    PRIMARYCONTROLPACKET22-RESERVED2   ;        /* Offset = 0x2DC */
    uint32_t    PRIMARYCONTROLPACKET23_ISADDR      ;        /* Offset = 0x2E0 */
    uint32_t    PRIMARYCONTROLPACKET23_IDADDR      ;        /* Offset = 0x2E4 */
    uint32_t    PRIMARYCONTROLPACKET23_ITCOUNT     ;        /* Offset = 0x2E8 */
    uint32_t    PRIMARYCONTROLPACKET23-RESERVED1   ;        /* Offset = 0x2EC */
    uint32_t    PRIMARYCONTROLPACKET23_CHCTRL      ;        /* Offset = 0x2F0 */
    uint32_t    PRIMARYCONTROLPACKET23_EIOFF       ;        /* Offset = 0x2F4 */
    uint32_t    PRIMARYCONTROLPACKET23_FIOFF       ;        /* Offset = 0x2F8 */
    uint32_t    PRIMARYCONTROLPACKET23-RESERVED2   ;        /* Offset = 0x2FC */
    uint32_t    PRIMARYCONTROLPACKET24_ISADDR      ;        /* Offset = 0x300 */
    uint32_t    PRIMARYCONTROLPACKET24_IDADDR      ;        /* Offset = 0x304 */
    uint32_t    PRIMARYCONTROLPACKET24_ITCOUNT     ;        /* Offset = 0x308 */
    uint32_t    PRIMARYCONTROLPACKET24-RESERVED1   ;        /* Offset = 0x30C */
    uint32_t    PRIMARYCONTROLPACKET24_CHCTRL      ;        /* Offset = 0x310 */
    uint32_t    PRIMARYCONTROLPACKET24_EIOFF       ;        /* Offset = 0x314 */
    uint32_t    PRIMARYCONTROLPACKET24_FIOFF       ;        /* Offset = 0x318 */
    uint32_t    PRIMARYCONTROLPACKET24-RESERVED2   ;        /* Offset = 0x31C */
    uint32_t    PRIMARYCONTROLPACKET25_ISADDR      ;        /* Offset = 0x320 */
    uint32_t    PRIMARYCONTROLPACKET25_IDADDR      ;        /* Offset = 0x324 */
    uint32_t    PRIMARYCONTROLPACKET25_ITCOUNT     ;        /* Offset = 0x328 */
    uint32_t    PRIMARYCONTROLPACKET25-RESERVED1   ;        /* Offset = 0x32C */
    uint32_t    PRIMARYCONTROLPACKET25_CHCTRL      ;        /* Offset = 0x330 */
    uint32_t    PRIMARYCONTROLPACKET25_EIOFF       ;        /* Offset = 0x334 */
    uint32_t    PRIMARYCONTROLPACKET25_FIOFF       ;        /* Offset = 0x338 */
    uint32_t    PRIMARYCONTROLPACKET25-RESERVED2   ;        /* Offset = 0x33C */
    uint32_t    PRIMARYCONTROLPACKET26_ISADDR      ;        /* Offset = 0x340 */
    uint32_t    PRIMARYCONTROLPACKET26_IDADDR      ;        /* Offset = 0x344 */
    uint32_t    PRIMARYCONTROLPACKET26_ITCOUNT     ;        /* Offset = 0x348 */
    uint32_t    PRIMARYCONTROLPACKET26-RESERVED1   ;        /* Offset = 0x34C */
    uint32_t    PRIMARYCONTROLPACKET26_CHCTRL      ;        /* Offset = 0x350 */
    uint32_t    PRIMARYCONTROLPACKET26_EIOFF       ;        /* Offset = 0x354 */
    uint32_t    PRIMARYCONTROLPACKET26_FIOFF       ;        /* Offset = 0x358 */
    uint32_t    PRIMARYCONTROLPACKET26-RESERVED2   ;        /* Offset = 0x35C */
    uint32_t    PRIMARYCONTROLPACKET27_ISADDR      ;        /* Offset = 0x360 */
    uint32_t    PRIMARYCONTROLPACKET27_IDADDR      ;        /* Offset = 0x364 */
    uint32_t    PRIMARYCONTROLPACKET27_ITCOUNT     ;        /* Offset = 0x368 */
    uint32_t    PRIMARYCONTROLPACKET27-RESERVED1   ;        /* Offset = 0x36C */
    uint32_t    PRIMARYCONTROLPACKET27_CHCTRL      ;        /* Offset = 0x370 */
    uint32_t    PRIMARYCONTROLPACKET27_EIOFF       ;        /* Offset = 0x374 */
    uint32_t    PRIMARYCONTROLPACKET27_FIOFF       ;        /* Offset = 0x378 */
    uint32_t    PRIMARYCONTROLPACKET27-RESERVED2   ;        /* Offset = 0x37C */
    uint32_t    PRIMARYCONTROLPACKET28_ISADDR      ;        /* Offset = 0x380 */
    uint32_t    PRIMARYCONTROLPACKET28_IDADDR      ;        /* Offset = 0x384 */
    uint32_t    PRIMARYCONTROLPACKET28_ITCOUNT     ;        /* Offset = 0x388 */
    uint32_t    PRIMARYCONTROLPACKET28-RESERVED1   ;        /* Offset = 0x38C */
    uint32_t    PRIMARYCONTROLPACKET28_CHCTRL      ;        /* Offset = 0x390 */
    uint32_t    PRIMARYCONTROLPACKET28_EIOFF       ;        /* Offset = 0x394 */
    uint32_t    PRIMARYCONTROLPACKET28_FIOFF       ;        /* Offset = 0x398 */
    uint32_t    PRIMARYCONTROLPACKET28-RESERVED2   ;        /* Offset = 0x39C */
    uint32_t    PRIMARYCONTROLPACKET29_ISADDR      ;        /* Offset = 0x3A0 */
    uint32_t    PRIMARYCONTROLPACKET29_IDADDR      ;        /* Offset = 0x3A4 */
    uint32_t    PRIMARYCONTROLPACKET29_ITCOUNT     ;        /* Offset = 0x3A8 */
    uint32_t    PRIMARYCONTROLPACKET29-RESERVED1   ;        /* Offset = 0x3AC */
    uint32_t    PRIMARYCONTROLPACKET29_CHCTRL      ;        /* Offset = 0x3B0 */
    uint32_t    PRIMARYCONTROLPACKET29_EIOFF       ;        /* Offset = 0x3B4 */
    uint32_t    PRIMARYCONTROLPACKET29_FIOFF       ;        /* Offset = 0x3B8 */
    uint32_t    PRIMARYCONTROLPACKET29-RESERVED2   ;        /* Offset = 0x3BC */
    uint32_t    PRIMARYCONTROLPACKET30_ISADDR      ;        /* Offset = 0x3C0 */
    uint32_t    PRIMARYCONTROLPACKET30_IDADDR      ;        /* Offset = 0x3C4 */
    uint32_t    PRIMARYCONTROLPACKET30_ITCOUNT     ;        /* Offset = 0x3C8 */
    uint32_t    PRIMARYCONTROLPACKET30-RESERVED1   ;        /* Offset = 0x3CC */
    uint32_t    PRIMARYCONTROLPACKET30_CHCTRL      ;        /* Offset = 0x3D0 */
    uint32_t    PRIMARYCONTROLPACKET30_EIOFF       ;        /* Offset = 0x3D4 */
    uint32_t    PRIMARYCONTROLPACKET30_FIOFF       ;        /* Offset = 0x3D8 */
    uint32_t    PRIMARYCONTROLPACKET30-RESERVED2   ;        /* Offset = 0x3DC */
    uint32_t    PRIMARYCONTROLPACKET31_ISADDR      ;        /* Offset = 0x3E0 */
    uint32_t    PRIMARYCONTROLPACKET31_IDADDR      ;        /* Offset = 0x3E4 */
    uint32_t    PRIMARYCONTROLPACKET31_ITCOUNT     ;        /* Offset = 0x3E8 */
    uint32_t    PRIMARYCONTROLPACKET31-RESERVED1   ;        /* Offset = 0x3EC */
    uint32_t    PRIMARYCONTROLPACKET31_CHCTRL      ;        /* Offset = 0x3F0 */
    uint32_t    PRIMARYCONTROLPACKET31_EIOFF       ;        /* Offset = 0x3F4 */
    uint32_t    PRIMARYCONTROLPACKET31_FIOFF       ;        /* Offset = 0x3F8 */
    uint32_t    PRIMARYCONTROLPACKET31-RESERVED2   ;        /* Offset = 0x3FC */
    uint32_t    RESTRICTED1[256]                   ;        /* Offset = 0x400 */
    uint32_t    WORKINGCONTROLPACKET0_CSADDR       ;        /* Offset = 0x800 */
    uint32_t    WORKINGCONTROLPACKET0_CDADDR       ;        /* Offset = 0x804 */
    uint32_t    WORKINGCONTROLPACKET0_CTCOUNT      ;        /* Offset = 0x808 */
    uint32_t    WORKINGCONTROLPACKET0-RESERVED3    ;        /* Offset = 0x80C */
    uint32_t    WORKINGCONTROLPACKET1_CSADDR       ;        /* Offset = 0x810 */
    uint32_t    WORKINGCONTROLPACKET1_CDADDR       ;        /* Offset = 0x814 */
    uint32_t    WORKINGCONTROLPACKET1_CTCOUNT      ;        /* Offset = 0x818 */
    uint32_t    WORKINGCONTROLPACKET1-RESERVED3    ;        /* Offset = 0x81C */
    uint32_t    WORKINGCONTROLPACKET2_CSADDR       ;        /* Offset = 0x820 */
    uint32_t    WORKINGCONTROLPACKET2_CDADDR       ;        /* Offset = 0x824 */
    uint32_t    WORKINGCONTROLPACKET2_CTCOUNT      ;        /* Offset = 0x828 */
    uint32_t    WORKINGCONTROLPACKET2-RESERVED3    ;        /* Offset = 0x82C */
    uint32_t    WORKINGCONTROLPACKET3_CSADDR       ;        /* Offset = 0x830 */
    uint32_t    WORKINGCONTROLPACKET3_CDADDR       ;        /* Offset = 0x834 */
    uint32_t    WORKINGCONTROLPACKET3_CTCOUNT      ;        /* Offset = 0x838 */
    uint32_t    WORKINGCONTROLPACKET3-RESERVED3    ;        /* Offset = 0x83C */
    uint32_t    WORKINGCONTROLPACKET4_CSADDR       ;        /* Offset = 0x840 */
    uint32_t    WORKINGCONTROLPACKET4_CDADDR       ;        /* Offset = 0x844 */
    uint32_t    WORKINGCONTROLPACKET4_CTCOUNT      ;        /* Offset = 0x848 */
    uint32_t    WORKINGCONTROLPACKET4-RESERVED3    ;        /* Offset = 0x84C */
    uint32_t    WORKINGCONTROLPACKET5_CSADDR       ;        /* Offset = 0x850 */
    uint32_t    WORKINGCONTROLPACKET5_CDADDR       ;        /* Offset = 0x854 */
    uint32_t    WORKINGCONTROLPACKET5_CTCOUNT      ;        /* Offset = 0x858 */
    uint32_t    WORKINGCONTROLPACKET5-RESERVED3    ;        /* Offset = 0x85C */
    uint32_t    WORKINGCONTROLPACKET6_CSADDR       ;        /* Offset = 0x860 */
    uint32_t    WORKINGCONTROLPACKET6_CDADDR       ;        /* Offset = 0x864 */
    uint32_t    WORKINGCONTROLPACKET6_CTCOUNT      ;        /* Offset = 0x868 */
    uint32_t    WORKINGCONTROLPACKET6-RESERVED3    ;        /* Offset = 0x86C */
    uint32_t    WORKINGCONTROLPACKET7_CSADDR       ;        /* Offset = 0x870 */
    uint32_t    WORKINGCONTROLPACKET7_CDADDR       ;        /* Offset = 0x874 */
    uint32_t    WORKINGCONTROLPACKET7_CTCOUNT      ;        /* Offset = 0x878 */
    uint32_t    WORKINGCONTROLPACKET7-RESERVED3    ;        /* Offset = 0x87C */
    uint32_t    WORKINGCONTROLPACKET8_CSADDR       ;        /* Offset = 0x880 */
    uint32_t    WORKINGCONTROLPACKET8_CDADDR       ;        /* Offset = 0x884 */
    uint32_t    WORKINGCONTROLPACKET8_CTCOUNT      ;        /* Offset = 0x888 */
    uint32_t    WORKINGCONTROLPACKET8-RESERVED3    ;        /* Offset = 0x88C */
    uint32_t    WORKINGCONTROLPACKET9_CSADDR       ;        /* Offset = 0x890 */
    uint32_t    WORKINGCONTROLPACKET9_CDADDR       ;        /* Offset = 0x894 */
    uint32_t    WORKINGCONTROLPACKET9_CTCOUNT      ;        /* Offset = 0x898 */
    uint32_t    WORKINGCONTROLPACKET9-RESERVED3    ;        /* Offset = 0x89C */
    uint32_t    WORKINGCONTROLPACKET10_CSADDR      ;        /* Offset = 0x8A0 */
    uint32_t    WORKINGCONTROLPACKET10_CDADDR      ;        /* Offset = 0x8A4 */
    uint32_t    WORKINGCONTROLPACKET10_CTCOUNT     ;        /* Offset = 0x8A8 */
    uint32_t    WORKINGCONTROLPACKET10-RESERVED3   ;        /* Offset = 0x8AC */
    uint32_t    WORKINGCONTROLPACKET11_CSADDR      ;        /* Offset = 0x8B0 */
    uint32_t    WORKINGCONTROLPACKET11_CDADDR      ;        /* Offset = 0x8B4 */
    uint32_t    WORKINGCONTROLPACKET11_CTCOUNT     ;        /* Offset = 0x8B8 */
    uint32_t    WORKINGCONTROLPACKET11-RESERVED3   ;        /* Offset = 0x8BC */
    uint32_t    WORKINGCONTROLPACKET12_CSADDR      ;        /* Offset = 0x8C0 */
    uint32_t    WORKINGCONTROLPACKET12_CDADDR      ;        /* Offset = 0x8C4 */
    uint32_t    WORKINGCONTROLPACKET12_CTCOUNT     ;        /* Offset = 0x8C8 */
    uint32_t    WORKINGCONTROLPACKET12-RESERVED3   ;        /* Offset = 0x8CC */
    uint32_t    WORKINGCONTROLPACKET13_CSADDR      ;        /* Offset = 0x8D0 */
    uint32_t    WORKINGCONTROLPACKET13_CDADDR      ;        /* Offset = 0x8D4 */
    uint32_t    WORKINGCONTROLPACKET13_CTCOUNT     ;        /* Offset = 0x8D8 */
    uint32_t    WORKINGCONTROLPACKET13-RESERVED3   ;        /* Offset = 0x8DC */
    uint32_t    WORKINGCONTROLPACKET14_CSADDR      ;        /* Offset = 0x8E0 */
    uint32_t    WORKINGCONTROLPACKET14_CDADDR      ;        /* Offset = 0x8E4 */
    uint32_t    WORKINGCONTROLPACKET14_CTCOUNT     ;        /* Offset = 0x8E8 */
    uint32_t    WORKINGCONTROLPACKET14-RESERVED3   ;        /* Offset = 0x8EC */
    uint32_t    WORKINGCONTROLPACKET15_CSADDR      ;        /* Offset = 0x8F0 */
    uint32_t    WORKINGCONTROLPACKET15_CDADDR      ;        /* Offset = 0x8F4 */
    uint32_t    WORKINGCONTROLPACKET15_CTCOUNT     ;        /* Offset = 0x8F8 */
    uint32_t    WORKINGCONTROLPACKET15-RESERVED3   ;        /* Offset = 0x8FC */
    uint32_t    WORKINGCONTROLPACKET16_CSADDR      ;        /* Offset = 0x900 */
    uint32_t    WORKINGCONTROLPACKET16_CDADDR      ;        /* Offset = 0x904 */
    uint32_t    WORKINGCONTROLPACKET16_CTCOUNT     ;        /* Offset = 0x908 */
    uint32_t    WORKINGCONTROLPACKET16-RESERVED3   ;        /* Offset = 0x90C */
    uint32_t    WORKINGCONTROLPACKET17_CSADDR      ;        /* Offset = 0x910 */
    uint32_t    WORKINGCONTROLPACKET17_CDADDR      ;        /* Offset = 0x914 */
    uint32_t    WORKINGCONTROLPACKET17_CTCOUNT     ;        /* Offset = 0x918 */
    uint32_t    WORKINGCONTROLPACKET17-RESERVED3   ;        /* Offset = 0x91C */
    uint32_t    WORKINGCONTROLPACKET18_CSADDR      ;        /* Offset = 0x920 */
    uint32_t    WORKINGCONTROLPACKET18_CDADDR      ;        /* Offset = 0x924 */
    uint32_t    WORKINGCONTROLPACKET18_CTCOUNT     ;        /* Offset = 0x928 */
    uint32_t    WORKINGCONTROLPACKET18-RESERVED3   ;        /* Offset = 0x92C */
    uint32_t    WORKINGCONTROLPACKET19_CSADDR      ;        /* Offset = 0x930 */
    uint32_t    WORKINGCONTROLPACKET19_CDADDR      ;        /* Offset = 0x934 */
    uint32_t    WORKINGCONTROLPACKET19_CTCOUNT     ;        /* Offset = 0x938 */
    uint32_t    WORKINGCONTROLPACKET19-RESERVED3   ;        /* Offset = 0x93C */
    uint32_t    WORKINGCONTROLPACKET20_CSADDR      ;        /* Offset = 0x940 */
    uint32_t    WORKINGCONTROLPACKET20_CDADDR      ;        /* Offset = 0x944 */
    uint32_t    WORKINGCONTROLPACKET20_CTCOUNT     ;        /* Offset = 0x948 */
    uint32_t    WORKINGCONTROLPACKET20-RESERVED3   ;        /* Offset = 0x94C */
    uint32_t    WORKINGCONTROLPACKET21_CSADDR      ;        /* Offset = 0x950 */
    uint32_t    WORKINGCONTROLPACKET21_CDADDR      ;        /* Offset = 0x954 */
    uint32_t    WORKINGCONTROLPACKET21_CTCOUNT     ;        /* Offset = 0x958 */
    uint32_t    WORKINGCONTROLPACKET21-RESERVED3   ;        /* Offset = 0x95C */
    uint32_t    WORKINGCONTROLPACKET22_CSADDR      ;        /* Offset = 0x960 */
    uint32_t    WORKINGCONTROLPACKET22_CDADDR      ;        /* Offset = 0x964 */
    uint32_t    WORKINGCONTROLPACKET22_CTCOUNT     ;        /* Offset = 0x968 */
    uint32_t    WORKINGCONTROLPACKET22-RESERVED3   ;        /* Offset = 0x96C */
    uint32_t    WORKINGCONTROLPACKET23_CSADDR      ;        /* Offset = 0x970 */
    uint32_t    WORKINGCONTROLPACKET23_CDADDR      ;        /* Offset = 0x974 */
    uint32_t    WORKINGCONTROLPACKET23_CTCOUNT     ;        /* Offset = 0x978 */
    uint32_t    WORKINGCONTROLPACKET23-RESERVED3   ;        /* Offset = 0x97C */
    uint32_t    WORKINGCONTROLPACKET24_CSADDR      ;        /* Offset = 0x980 */
    uint32_t    WORKINGCONTROLPACKET24_CDADDR      ;        /* Offset = 0x984 */
    uint32_t    WORKINGCONTROLPACKET24_CTCOUNT     ;        /* Offset = 0x988 */
    uint32_t    WORKINGCONTROLPACKET24-RESERVED3   ;        /* Offset = 0x98C */
    uint32_t    WORKINGCONTROLPACKET25_CSADDR      ;        /* Offset = 0x990 */
    uint32_t    WORKINGCONTROLPACKET25_CDADDR      ;        /* Offset = 0x994 */
    uint32_t    WORKINGCONTROLPACKET25_CTCOUNT     ;        /* Offset = 0x998 */
    uint32_t    WORKINGCONTROLPACKET25-RESERVED3   ;        /* Offset = 0x99C */
    uint32_t    WORKINGCONTROLPACKET26_CSADDR      ;        /* Offset = 0x9A0 */
    uint32_t    WORKINGCONTROLPACKET26_CDADDR      ;        /* Offset = 0x9A4 */
    uint32_t    WORKINGCONTROLPACKET26_CTCOUNT     ;        /* Offset = 0x9A8 */
    uint32_t    WORKINGCONTROLPACKET26-RESERVED3   ;        /* Offset = 0x9AC */
    uint32_t    WORKINGCONTROLPACKET27_CSADDR      ;        /* Offset = 0x9B0 */
    uint32_t    WORKINGCONTROLPACKET27_CDADDR      ;        /* Offset = 0x9B4 */
    uint32_t    WORKINGCONTROLPACKET27_CTCOUNT     ;        /* Offset = 0x9B8 */
    uint32_t    WORKINGCONTROLPACKET27-RESERVED3   ;        /* Offset = 0x9BC */
    uint32_t    WORKINGCONTROLPACKET28_CSADDR      ;        /* Offset = 0x9C0 */
    uint32_t    WORKINGCONTROLPACKET28_CDADDR      ;        /* Offset = 0x9C4 */
    uint32_t    WORKINGCONTROLPACKET28_CTCOUNT     ;        /* Offset = 0x9C8 */
    uint32_t    WORKINGCONTROLPACKET28-RESERVED3   ;        /* Offset = 0x9CC */
    uint32_t    WORKINGCONTROLPACKET29_CSADDR      ;        /* Offset = 0x9D0 */
    uint32_t    WORKINGCONTROLPACKET29_CDADDR      ;        /* Offset = 0x9D4 */
    uint32_t    WORKINGCONTROLPACKET29_CTCOUNT     ;        /* Offset = 0x9D8 */
    uint32_t    WORKINGCONTROLPACKET29-RESERVED3   ;        /* Offset = 0x9DC */
    uint32_t    WORKINGCONTROLPACKET30_CSADDR      ;        /* Offset = 0x9E0 */
    uint32_t    WORKINGCONTROLPACKET30_CDADDR      ;        /* Offset = 0x9E4 */
    uint32_t    WORKINGCONTROLPACKET30_CTCOUNT     ;        /* Offset = 0x9E8 */
    uint32_t    WORKINGCONTROLPACKET30-RESERVED3   ;        /* Offset = 0x9EC */
    uint32_t    WORKINGCONTROLPACKET31_CSADDR      ;        /* Offset = 0x9F0 */
    uint32_t    WORKINGCONTROLPACKET31_CDADDR      ;        /* Offset = 0x9F4 */
    uint32_t    WORKINGCONTROLPACKET31_CTCOUNT     ;        /* Offset = 0x9F8 */
    uint32_t    WORKINGCONTROLPACKET31-RESERVED3   ;        /* Offset = 0x9FC */
} DMARAMRegs;

#endif


#ifdef __cplusplus
}
#endif

#endif /* REG_DMARAM_H */
/* END OF REG_DMARAM_H */

