/**
 *  @file    reg_csi2protocolengine.h
 *
 *  @brief
 *    This file gives register definitions of CSI2_PROTOCOL_ENGINE module.
 *
 *  This file is auto-generated on 3/22/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define CSI2_VC_IRQSTATUS_FIFO_RX_OVF_IRQ_BIT_END           4U

/* Definition for field FIFO_TX_OVF_IRQ in Register CSI2_VC_IRQSTATUS */
#define CSI2_VC_IRQSTATUS_FIFO_TX_OVF_IRQ_BIT_START         3U
#define CSI2_VC_IRQSTATUS_FIFO_TX_OVF_IRQ_BIT_END           3U

/* Definition for field BTA_IRQ in Register CSI2_VC_IRQSTATUS */
#define CSI2_VC_IRQSTATUS_BTA_IRQ_BIT_START                 5U
#define CSI2_VC_IRQSTATUS_BTA_IRQ_BIT_END                   5U

/* Definition for field ECC_NO_CORRECTION_IRQ in Register CSI2_VC_IRQSTATUS */
#define CSI2_VC_IRQSTATUS_ECC_NO_CORRECTION_IRQ_BIT_START   6U
#define CSI2_VC_IRQSTATUS_ECC_NO_CORRECTION_IRQ_BIT_END     6U

/* Definition for field FIFO_TX_UDF_IRQ in Register CSI2_VC_IRQSTATUS */
#define CSI2_VC_IRQSTATUS_FIFO_TX_UDF_IRQ_BIT_START         7U
#define CSI2_VC_IRQSTATUS_FIFO_TX_UDF_IRQ_BIT_END           7U

/* Definition for field PP_BUSY_CHANGE_IRQ in Register CSI2_VC_IRQSTATUS */
#define CSI2_VC_IRQSTATUS_PP_BUSY_CHANGE_IRQ_BIT_START      8U
#define CSI2_VC_IRQSTATUS_PP_BUSY_CHANGE_IRQ_BIT_END        8U

/* Definition for field TE_EN in Register CSI2_VC_TE */
#define CSI2_VC_TE_TE_EN_BIT_START                          30U
#define CSI2_VC_TE_TE_EN_BIT_END                            30U

/* Definition for field TE_SIZE in Register CSI2_VC_TE */
#define CSI2_VC_TE_TE_SIZE_BIT_START                        0U
#define CSI2_VC_TE_TE_SIZE_BIT_END                          23U

/* Definition for field TE_START in Register CSI2_VC_TE */
#define CSI2_VC_TE_TE_START_BIT_START                       31U
#define CSI2_VC_TE_TE_START_BIT_END                         31U

/* Definition for field TE_LINE in Register CSI2_VC_TE */
#define CSI2_VC_TE_TE_LINE_BIT_START                        29U
#define CSI2_VC_TE_TE_LINE_BIT_END                          29U

/* Definition for field TE_LINE_NB in Register CSI2_VC_TE */
#define CSI2_VC_TE_TE_LINE_NB_BIT_START                     28U
#define CSI2_VC_TE_TE_LINE_NB_BIT_END                       28U

/* Definition for field HEADER in Register CSI2_VC_LONG_PACKET_HEADER */
#define CSI2_VC_LONG_PACKET_HEADER_HEADER_BIT_START         0U
#define CSI2_VC_LONG_PACKET_HEADER_HEADER_BIT_END           31U

/* Definition for field PAYLOAD in Register CSI2_VC_LONG_PACKET_PAYLOAD */
#define CSI2_VC_LONG_PACKET_PAYLOAD_PAYLOAD_BIT_START       0U
#define CSI2_VC_LONG_PACKET_PAYLOAD_PAYLOAD_BIT_END         31U

/* Definition for field HEADER in Register CSI2_VC_SHORT_PACKET_HEADER */
#define CSI2_VC_SHORT_PACKET_HEADER_HEADER_BIT_START        0U
#define CSI2_VC_SHORT_PACKET_HEADER_HEADER_BIT_END          31U



/**
 * @struct CSI2PROTOCOLENGINERegs_t
 * @brief
 *   Module CSI2_PROTOCOL_ENGINE Register Definition
 * @details
 *   This structure is used to access the CSI2_PROTOCOL_ENGINE module registers.
 */
/**
 * @typedef CSI2PROTOCOLENGINERegs
 * @brief
 *   Module CSI2_PROTOCOL_ENGINE Register Frame type Definition
 * @details
 *   This type is used to access the CSI2_PROTOCOL_ENGINE module registers.
 */
typedef volatile struct CSI2PROTOCOLENGINERegs_t
{
    uint32_t    CSI2_REVISION                      ;        /* Offset = 0x000 */
    uint32_t    RESTRICTED1[3]                     ;        /* Offset = 0x004 */
    uint32_t    CSI2_SYSCONFIG                     ;        /* Offset = 0x010 */
    uint32_t    CSI2_SYSSTATUS                     ;        /* Offset = 0x014 */
    uint32_t    CSI2_IRQSTATUS                     ;        /* Offset = 0x018 */
    uint32_t    CSI2_IRQENABLE                     ;        /* Offset = 0x01c */
    uint32_t    RESTRICTED2[8]                     ;        /* Offset = 0x020 */
    uint32_t    CSI2_CTRL                          ;        /* Offset = 0x040 */
    uint32_t    CSI2_GNQ                           ;        /* Offset = 0x044 */
    uint32_t    CSI2_COMPLEXIO_CFG1                ;        /* Offset = 0x048 */
    uint32_t    CSI2_COMPLEXIO_IRQSTATUS           ;        /* Offset = 0x04c */
    uint32_t    CSI2_COMPLEXIO_IRQENABLE           ;        /* Offset = 0x050 */
    uint32_t    CSI2_CLK_CTRL                      ;        /* Offset = 0x054 */
    uint32_t    CSI2_TIMING1                       ;        /* Offset = 0x058 */
    uint32_t    CSI2_TIMING2                       ;        /* Offset = 0x05c */
    uint32_t    CSI2_VM_TIMING1                    ;        /* Offset = 0x060 */
    uint32_t    CSI2_VM_TIMING2                    ;        /* Offset = 0x064 */
    uint32_t    CSI2_VM_TIMING3                    ;        /* Offset = 0x068 */
    uint32_t    CSI2_CLK_TIMING                    ;        /* Offset = 0x06c */
    uint32_t    CSI2_TX_FIFO_VC_SIZE               ;        /* Offset = 0x070 */
    uint32_t    CSI2_RX_FIFO_VC_SIZE               ;        /* Offset = 0x074 */
    uint32_t    CSI2_COMPLEXIO_CFG2                ;        /* Offset = 0x078 */
    uint32_t    CSI2_RX_FIFO_VC_FULLNESS           ;        /* Offset = 0x07c */
    uint32_t    CSI2_VM_TIMING4                    ;        /* Offset = 0x080 */
    uint32_t    CSI2_TX_FIFO_VC_EMPTINESS          ;        /* Offset = 0x084 */
    uint32_t    CSI2_VM_TIMING5                    ;        /* Offset = 0x088 */
    uint32_t    CSI2_VM_TIMING6                    ;        /* Offset = 0x08c */
    uint32_t    CSI2_VM_TIMING7                    ;        /* Offset = 0x090 */
    uint32_t    CSI2_STOPCLK_TIMING                ;        /* Offset = 0x094 */
    uint32_t    CSI2_CTRL2                         ;        /* Offset = 0x098 */
    uint32_t    CSI2_VM_TIMING8                    ;        /* Offset = 0x09c */
        struct                                              /* AddrOffset = 0x0A0 - 0x0B4 */
        {
            uint32_t    CSI2_TE_HSYNC_WIDTH       ;
            uint32_t    CSI2_TE_VSYNC_WIDTH       ;
            uint32_t    CSI2_TE_HSYNC_NUMBER      ;
        }CSI2TEPARAMS[2];
        uint32_t    PADREGARR0[18]            ;             /* AddrOffset = 0x0B8 - 0x0FC */
        struct                                              /* AddrOffset = 0x100 - 0x17C */
        {
            uint32_t    CSI2_VC_CTRL              ;
            uint32_t    CSI2_VC_TE                ;
            uint32_t    CSI2_VC_LONG_PACKET_HEADER;
            uint32_t    CSI2_VC_LONG_PACKET_PAYLOAD;
            uint32_t    CSI2_VC_SHORT_PACKET_HEADER;
            uint32_t    PADREG11                 ;
            uint32_t    CSI2_VC_IRQSTATUS         ;
            uint32_t    CSI2_VC_IRQENABLE         ;
