/**
 *  @file    reg_sha.h
 *
 *  @brief
 *    This file gives register definitions of MSS_SHA module.
 *
 *  This file is auto-generated on 11/2/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define P_HASH512_IDIGEST_K_IDIGEST_K_BIT_START             0U
#define P_HASH512_IDIGEST_K_IDIGEST_K_BIT_END               31U

/* Definition for field IDIGEST_L in Register P_HASH512_IDIGEST_L */
#define P_HASH512_IDIGEST_L_IDIGEST_L_BIT_START             0U
#define P_HASH512_IDIGEST_L_IDIGEST_L_BIT_END               31U

/* Definition for field IDIGEST_M in Register P_HASH512_IDIGEST_M */
#define P_HASH512_IDIGEST_M_IDIGEST_M_BIT_START             0U
#define P_HASH512_IDIGEST_M_IDIGEST_M_BIT_END               31U

/* Definition for field IDIGEST_N in Register P_HASH512_IDIGEST_N */
#define P_HASH512_IDIGEST_N_IDIGEST_N_BIT_START             0U
#define P_HASH512_IDIGEST_N_IDIGEST_N_BIT_END               31U

/* Definition for field IDIGEST_O in Register P_HASH512_IDIGEST_O */
#define P_HASH512_IDIGEST_O_IDIGEST_O_BIT_START             0U
#define P_HASH512_IDIGEST_O_IDIGEST_O_BIT_END               31U

/* Definition for field IDIGEST_P in Register P_HASH512_IDIGEST_P */
#define P_HASH512_IDIGEST_P_IDIGEST_P_BIT_START             0U
#define P_HASH512_IDIGEST_P_IDIGEST_P_BIT_END               31U

/* Definition for field DIGEST_COUNT in Register P_HASH512_DIGEST_COUNT */
#define P_HASH512_DIGEST_COUNT_DIGEST_COUNT_BIT_START       0U
#define P_HASH512_DIGEST_COUNT_DIGEST_COUNT_BIT_END         31U

/* Definition for field ALGORITHM in Register P_HASH512_MODE */
#define P_HASH512_MODE_ALGORITHM_BIT_START                  0U
#define P_HASH512_MODE_ALGORITHM_BIT_END                    2U

/* Definition for field USE_ALG_CONSTANTS in Register P_HASH512_MODE */
#define P_HASH512_MODE_USE_ALG_CONSTANTS_BIT_START          3U
#define P_HASH512_MODE_USE_ALG_CONSTANTS_BIT_END            3U

/* Definition for field CLOSE_HASH in Register P_HASH512_MODE */
#define P_HASH512_MODE_CLOSE_HASH_BIT_START                 4U
#define P_HASH512_MODE_CLOSE_HASH_BIT_END                   4U

/* Definition for field HMAC_KEY_PROCESSING in Register P_HASH512_MODE */
#define P_HASH512_MODE_HMAC_KEY_PROCESSING_BIT_START        5U
#define P_HASH512_MODE_HMAC_KEY_PROCESSING_BIT_END          5U

/* Definition for field REUSE_HMAC_KEY in Register P_HASH512_MODE */
#define P_HASH512_MODE_REUSE_HMAC_KEY_BIT_START             6U
#define P_HASH512_MODE_REUSE_HMAC_KEY_BIT_END               6U

/* Definition for field HMAC_OUTER_HASH in Register P_HASH512_MODE */
#define P_HASH512_MODE_HMAC_OUTER_HASH_BIT_START            7U
#define P_HASH512_MODE_HMAC_OUTER_HASH_BIT_END              7U

/* Definition for field LENGTH in Register P_HASH512_LENGTH */
#define P_HASH512_LENGTH_LENGTH_BIT_START                   0U
#define P_HASH512_LENGTH_LENGTH_BIT_END                     31U



/**
 * @struct SHARegs_t
 * @brief
 *   Module MSS_SHA Register Definition
 * @details
 *   This structure is used to access the MSS_SHA module registers.
 */
/**
 * @typedef SHARegs
 * @brief
 *   Module MSS_SHA Register Frame type Definition
 * @details
 *   This type is used to access the MSS_SHA module registers.
 */
typedef volatile struct SHARegs_t
{
    uint32_t    S_ODIGEST_A                        ;        /* Offset = 0x000 */
    uint32_t    S_ODIGEST_B                        ;        /* Offset = 0x004 */
    uint32_t    S_ODIGEST_C                        ;        /* Offset = 0x008 */
    uint32_t    S_ODIGEST_D                        ;        /* Offset = 0x00C */
    uint32_t    S_ODIGEST_E                        ;        /* Offset = 0x010 */
    uint32_t    S_ODIGEST_F                        ;        /* Offset = 0x014 */
    uint32_t    S_ODIGEST_G                        ;        /* Offset = 0x018 */
    uint32_t    S_ODIGEST_H                        ;        /* Offset = 0x01C */
    uint32_t    S_IDIGEST_A                        ;        /* Offset = 0x020 */
    uint32_t    S_IDIGEST_B                        ;        /* Offset = 0x024 */
    uint32_t    S_IDIGEST_C                        ;        /* Offset = 0x028 */
    uint32_t    S_IDIGEST_D                        ;        /* Offset = 0x02C */
    uint32_t    S_IDIGEST_E                        ;        /* Offset = 0x030 */
    uint32_t    S_IDIGEST_F                        ;        /* Offset = 0x034 */
    uint32_t    S_IDIGEST_G                        ;        /* Offset = 0x038 */
    uint32_t    S_IDIGEST_H                        ;        /* Offset = 0x03C */
    uint32_t    S_DIGEST_COUNT                     ;        /* Offset = 0x040 */
    uint32_t    S_MODE                             ;        /* Offset = 0x044 */
    uint32_t    S_LENGTH                           ;        /* Offset = 0x048 */
    uint32_t    RESTRICTED1[13]                    ;        /* Offset = 0x04C */
    uint32_t    S_DATA0_IN                         ;        /* Offset = 0x080 */
    uint32_t    S_DATA1_IN                         ;        /* Offset = 0x084 */
    uint32_t    S_DATA2_IN                         ;        /* Offset = 0x088 */
    uint32_t    S_DATA3_IN                         ;        /* Offset = 0x08C */
    uint32_t    S_DATA4_IN                         ;        /* Offset = 0x090 */
    uint32_t    S_DATA5_IN                         ;        /* Offset = 0x094 */
    uint32_t    S_DATA6_IN                         ;        /* Offset = 0x098 */
    uint32_t    S_DATA7_IN                         ;        /* Offset = 0x09C */
    uint32_t    S_DATA8_IN                         ;        /* Offset = 0x0A0 */
    uint32_t    S_DATA9_IN                         ;        /* Offset = 0x0A4 */
    uint32_t    S_DATA10_IN                        ;        /* Offset = 0x0A8 */
    uint32_t    S_DATA11_IN                        ;        /* Offset = 0x0AC */
    uint32_t    S_DATA12_IN                        ;        /* Offset = 0x0B0 */
    uint32_t    S_DATA13_IN                        ;        /* Offset = 0x0B4 */
    uint32_t    S_DATA14_IN                        ;        /* Offset = 0x0B8 */
    uint32_t    S_DATA15_IN                        ;        /* Offset = 0x0BC */
    uint32_t    RESTRICTED2[16]                    ;        /* Offset = 0x0C0 */
    uint32_t    S_REVISION                         ;        /* Offset = 0x100 */
    uint32_t    RESTRICTED3[3]                     ;        /* Offset = 0x104 */
    uint32_t    S_SYSCONFIG                        ;        /* Offset = 0x110 */
    uint32_t    S_SYSSTATUS                        ;        /* Offset = 0x114 */
    uint32_t    S_IRQSTATUS                        ;        /* Offset = 0x118 */
    uint32_t    S_IRQENABLE                        ;        /* Offset = 0x11C */
    uint32_t    RESTRICTED4[8]                     ;        /* Offset = 0x120 */
    uint32_t    S_XSSTATUS                         ;        /* Offset = 0x140 */
    uint32_t    RESTRICTED5[2]                     ;        /* Offset = 0x144 */
    uint32_t    S_LOCKDOWN                         ;        /* Offset = 0x14C */
    uint32_t    RESTRICTED6[44]                    ;        /* Offset = 0x150 */
    uint32_t    S_HASH512_ODIGEST_A                ;        /* Offset = 0x200 */
    uint32_t    S_HASH512_ODIGEST_B                ;        /* Offset = 0x204 */
    uint32_t    S_HASH512_ODIGEST_C                ;        /* Offset = 0x208 */
    uint32_t    S_HASH512_ODIGEST_D                ;        /* Offset = 0x20C */
    uint32_t    S_HASH512_ODIGEST_E                ;        /* Offset = 0x210 */
    uint32_t    S_HASH512_ODIGEST_F                ;        /* Offset = 0x214 */
    uint32_t    S_HASH512_ODIGEST_G                ;        /* Offset = 0x218 */
    uint32_t    S_HASH512_ODIGEST_H                ;        /* Offset = 0x21C */
    uint32_t    S_HASH512_ODIGEST_I                ;        /* Offset = 0x220 */
    uint32_t    S_HASH512_ODIGEST_J                ;        /* Offset = 0x224 */
    uint32_t    S_HASH512_ODIGEST_K                ;        /* Offset = 0x228 */
    uint32_t    S_HASH512_ODIGEST_L                ;        /* Offset = 0x22C */
    uint32_t    S_HASH512_ODIGEST_M                ;        /* Offset = 0x230 */
    uint32_t    S_HASH512_ODIGEST_N                ;        /* Offset = 0x234 */
    uint32_t    S_HASH512_ODIGEST_O                ;        /* Offset = 0x238 */
    uint32_t    S_HASH512_ODIGEST_P                ;        /* Offset = 0x23C */
    uint32_t    S_HASH512_IDIGEST_A                ;        /* Offset = 0x240 */
    uint32_t    S_HASH512_IDIGEST_B                ;        /* Offset = 0x244 */
    uint32_t    S_HASH512_IDIGEST_C                ;        /* Offset = 0x248 */
    uint32_t    S_HASH512_IDIGEST_D                ;        /* Offset = 0x24C */
    uint32_t    S_HASH512_IDIGEST_E                ;        /* Offset = 0x250 */
    uint32_t    S_HASH512_IDIGEST_F                ;        /* Offset = 0x254 */
    uint32_t    S_HASH512_IDIGEST_G                ;        /* Offset = 0x258 */
    uint32_t    S_HASH512_IDIGEST_H                ;        /* Offset = 0x25C */
    uint32_t    S_HASH512_IDIGEST_I                ;        /* Offset = 0x260 */
    uint32_t    S_HASH512_IDIGEST_J                ;        /* Offset = 0x264 */
    uint32_t    S_HASH512_IDIGEST_K                ;        /* Offset = 0x268 */
    uint32_t    S_HASH512_IDIGEST_L                ;        /* Offset = 0x26C */
    uint32_t    S_HASH512_IDIGEST_M                ;        /* Offset = 0x270 */
    uint32_t    S_HASH512_IDIGEST_N                ;        /* Offset = 0x274 */
    uint32_t    S_HASH512_IDIGEST_O                ;        /* Offset = 0x278 */
    uint32_t    S_HASH512_IDIGEST_P                ;        /* Offset = 0x27C */
    uint32_t    S_HASH512_DIGEST_COUNT             ;        /* Offset = 0x280 */
    uint32_t    S_HASH512_MODE                     ;        /* Offset = 0x284 */
    uint32_t    S_HASH512_LENGTH                   ;        /* Offset = 0x288 */
    uint32_t    RESTRICTED7[861]                   ;        /* Offset = 0x28C */
    uint32_t    P_ODIGEST_A                        ;        /* Offset = 0x1000 */
    uint32_t    P_ODIGEST_B                        ;        /* Offset = 0x1004 */
    uint32_t    P_ODIGEST_C                        ;        /* Offset = 0x1008 */
    uint32_t    P_ODIGEST_D                        ;        /* Offset = 0x100C */
    uint32_t    P_ODIGEST_E                        ;        /* Offset = 0x1010 */
    uint32_t    P_ODIGEST_F                        ;        /* Offset = 0x1014 */
    uint32_t    P_ODIGEST_G                        ;        /* Offset = 0x1018 */
    uint32_t    P_ODIGEST_H                        ;        /* Offset = 0x101C */
    uint32_t    P_IDIGEST_A                        ;        /* Offset = 0x1020 */
    uint32_t    P_IDIGEST_B                        ;        /* Offset = 0x1024 */
    uint32_t    P_IDIGEST_C                        ;        /* Offset = 0x1028 */
    uint32_t    P_IDIGEST_D                        ;        /* Offset = 0x102C */
    uint32_t    P_IDIGEST_E                        ;        /* Offset = 0x1030 */
    uint32_t    P_IDIGEST_F                        ;        /* Offset = 0x1034 */
    uint32_t    P_IDIGEST_G                        ;        /* Offset = 0x1038 */
    uint32_t    P_IDIGEST_H                        ;        /* Offset = 0x103C */
    uint32_t    P_DIGEST_COUNT                     ;        /* Offset = 0x1040 */
    uint32_t    P_MODE                             ;        /* Offset = 0x1044 */
    uint32_t    P_LENGTH                           ;        /* Offset = 0x1048 */
    uint32_t    RESTRICTED8[13]                    ;        /* Offset = 0x104C */
    uint32_t    P_DATA0_IN                         ;        /* Offset = 0x1080 */
    uint32_t    P_DATA1_IN                         ;        /* Offset = 0x1084 */
    uint32_t    P_DATA2_IN                         ;        /* Offset = 0x1088 */
    uint32_t    P_DATA3_IN                         ;        /* Offset = 0x108C */
    uint32_t    P_DATA4_IN                         ;        /* Offset = 0x1090 */
    uint32_t    P_DATA5_IN                         ;        /* Offset = 0x1094 */
    uint32_t    P_DATA6_IN                         ;        /* Offset = 0x1098 */
    uint32_t    P_DATA7_IN                         ;        /* Offset = 0x109C */
    uint32_t    P_DATA8_IN                         ;        /* Offset = 0x10A0 */
    uint32_t    P_DATA9_IN                         ;        /* Offset = 0x10A4 */
    uint32_t    P_DATA10_IN                        ;        /* Offset = 0x10A8 */
    uint32_t    P_DATA11_IN                        ;        /* Offset = 0x10AC */
    uint32_t    P_DATA12_IN                        ;        /* Offset = 0x10B0 */
    uint32_t    P_DATA13_IN                        ;        /* Offset = 0x10B4 */
    uint32_t    P_DATA14_IN                        ;        /* Offset = 0x10B8 */
    uint32_t    P_DATA15_IN                        ;        /* Offset = 0x10BC */
    uint32_t    RESTRICTED9[16]                    ;        /* Offset = 0x10C0 */
    uint32_t    P_REVISION                         ;        /* Offset = 0x1100 */
    uint32_t    RESTRICTED10[3]                    ;        /* Offset = 0x1104 */
    uint32_t    P_SYSCONFIG                        ;        /* Offset = 0x1110 */
    uint32_t    P_SYSSTATUS                        ;        /* Offset = 0x1114 */
    uint32_t    P_IRQSTATUS                        ;        /* Offset = 0x1118 */
    uint32_t    P_IRQENABLE                        ;        /* Offset = 0x111C */
    uint32_t    RESTRICTED11[56]                   ;        /* Offset = 0x1120 */
    uint32_t    P_HASH512_ODIGEST_A                ;        /* Offset = 0x1200 */
    uint32_t    P_HASH512_ODIGEST_B                ;        /* Offset = 0x1204 */
    uint32_t    P_HASH512_ODIGEST_C                ;        /* Offset = 0x1208 */
    uint32_t    P_HASH512_ODIGEST_D                ;        /* Offset = 0x120C */
    uint32_t    P_HASH512_ODIGEST_E                ;        /* Offset = 0x1210 */
    uint32_t    P_HASH512_ODIGEST_F                ;        /* Offset = 0x1214 */
    uint32_t    P_HASH512_ODIGEST_G                ;        /* Offset = 0x1218 */
    uint32_t    P_HASH512_ODIGEST_H                ;        /* Offset = 0x121C */
    uint32_t    P_HASH512_ODIGEST_I                ;        /* Offset = 0x1220 */
    uint32_t    P_HASH512_ODIGEST_J                ;        /* Offset = 0x1224 */
    uint32_t    P_HASH512_ODIGEST_K                ;        /* Offset = 0x1228 */
    uint32_t    P_HASH512_ODIGEST_L                ;        /* Offset = 0x122C */
    uint32_t    P_HASH512_ODIGEST_M                ;        /* Offset = 0x1230 */
    uint32_t    P_HASH512_ODIGEST_N                ;        /* Offset = 0x1234 */
    uint32_t    P_HASH512_ODIGEST_O                ;        /* Offset = 0x1238 */
    uint32_t    P_HASH512_ODIGEST_P                ;        /* Offset = 0x123C */
    uint32_t    P_HASH512_IDIGEST_A                ;        /* Offset = 0x1240 */
    uint32_t    P_HASH512_IDIGEST_B                ;        /* Offset = 0x1244 */
    uint32_t    P_HASH512_IDIGEST_C                ;        /* Offset = 0x1248 */
    uint32_t    P_HASH512_IDIGEST_D                ;        /* Offset = 0x124C */
    uint32_t    P_HASH512_IDIGEST_E                ;        /* Offset = 0x1250 */
    uint32_t    P_HASH512_IDIGEST_F                ;        /* Offset = 0x1254 */
    uint32_t    P_HASH512_IDIGEST_G                ;        /* Offset = 0x1258 */
    uint32_t    P_HASH512_IDIGEST_H                ;        /* Offset = 0x125C */
    uint32_t    P_HASH512_IDIGEST_I                ;        /* Offset = 0x1260 */
    uint32_t    P_HASH512_IDIGEST_J                ;        /* Offset = 0x1264 */
    uint32_t    P_HASH512_IDIGEST_K                ;        /* Offset = 0x1268 */
    uint32_t    P_HASH512_IDIGEST_L                ;        /* Offset = 0x126C */
    uint32_t    P_HASH512_IDIGEST_M                ;        /* Offset = 0x1270 */
    uint32_t    P_HASH512_IDIGEST_N                ;        /* Offset = 0x1274 */
    uint32_t    P_HASH512_IDIGEST_O                ;        /* Offset = 0x1278 */
    uint32_t    P_HASH512_IDIGEST_P                ;        /* Offset = 0x127C */
    uint32_t    P_HASH512_DIGEST_COUNT             ;        /* Offset = 0x1280 */
    uint32_t    P_HASH512_MODE                     ;        /* Offset = 0x1284 */
    uint32_t    P_HASH512_LENGTH                   ;        /* Offset = 0x1288 */
} SHARegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_SHA_H */
/* END OF REG_SHA_H */

