/**
 *  @file    reg_dthe.h
 *
 *  @brief
 *    This file gives register definitions of MSS_DTHE module.
 *
 *  This file is auto-generated on 11/2/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define P_CRC_CTRL_IBR_BIT_END                              7U

/* Definition for field OBR in Register P_CRC_CTRL */
#define P_CRC_CTRL_OBR_BIT_START                            8U
#define P_CRC_CTRL_OBR_BIT_END                              8U

/* Definition for field OINV in Register P_CRC_CTRL */
#define P_CRC_CTRL_OINV_BIT_START                           9U
#define P_CRC_CTRL_OINV_BIT_END                             9U

/* Definition for field RES2 in Register P_CRC_CTRL */
#define P_CRC_CTRL_RES2_BIT_START                           10U
#define P_CRC_CTRL_RES2_BIT_END                             11U

/* Definition for field BYTE in Register P_CRC_CTRL */
#define P_CRC_CTRL_BYTE_BIT_START                           12U
#define P_CRC_CTRL_BYTE_BIT_END                             12U

/* Definition for field INIT in Register P_CRC_CTRL */
#define P_CRC_CTRL_INIT_BIT_START                           13U
#define P_CRC_CTRL_INIT_BIT_END                             14U

/* Definition for field FLASH_ACC2CRC in Register P_CRC_CTRL */
#define P_CRC_CTRL_FLASH_ACC2CRC_BIT_START                  15U
#define P_CRC_CTRL_FLASH_ACC2CRC_BIT_END                    15U

/* Definition for field RES3 in Register P_CRC_CTRL */
#define P_CRC_CTRL_RES3_BIT_START                           16U
#define P_CRC_CTRL_RES3_BIT_END                             31U

/* Definition for field SEED in Register P_CRC_SEED */
#define P_CRC_SEED_SEED_BIT_START                           0U
#define P_CRC_SEED_SEED_BIT_END                             31U

/* Definition for field DATA_IN in Register P_CRC_DIN */
#define P_CRC_DIN_DATA_IN_BIT_START                         0U
#define P_CRC_DIN_DATA_IN_BIT_END                           31U

/* Definition for field RSLT_PP in Register P_CRC_RSLT_PP */
#define P_CRC_RSLT_PP_RSLT_PP_BIT_START                     0U
#define P_CRC_RSLT_PP_RSLT_PP_BIT_END                       31U

/* Definition for field KEY31_0 in Register P_RAND_KEY0 */
#define P_RAND_KEY0_KEY31_0_BIT_START                       0U
#define P_RAND_KEY0_KEY31_0_BIT_END                         31U

/* Definition for field KEY63_32 in Register P_RAND_KEY1 */
#define P_RAND_KEY1_KEY63_32_BIT_START                      0U
#define P_RAND_KEY1_KEY63_32_BIT_END                        31U

/* Definition for field KEY95_64 in Register P_RAND_KEY2 */
#define P_RAND_KEY2_KEY95_64_BIT_START                      0U
#define P_RAND_KEY2_KEY95_64_BIT_END                        31U

/* Definition for field KEY127_96 in Register P_RAND_KEY3 */
#define P_RAND_KEY3_KEY127_96_BIT_START                     0U
#define P_RAND_KEY3_KEY127_96_BIT_END                       31U



/**
 * @struct DTHERegs_t
 * @brief
 *   Module MSS_DTHE Register Definition
 * @details
 *   This structure is used to access the MSS_DTHE module registers.
 */
/**
 * @typedef DTHERegs
 * @brief
 *   Module MSS_DTHE Register Frame type Definition
 * @details
 *   This type is used to access the MSS_DTHE module registers.
 */
typedef volatile struct DTHERegs_t
{
    uint32_t    S_EIP_CONFIG                       ;        /* Offset = 0x000 */
    uint32_t    RESTRICTED1[3]                     ;        /* Offset = 0x004 */
    uint32_t    S_EIP57T_IMST                      ;        /* Offset = 0x010 */
    uint32_t    S_EIP57T_IRIS                      ;        /* Offset = 0x014 */
    uint32_t    S_EIP57T_IMIS                      ;        /* Offset = 0x018 */
    uint32_t    S_EIP57T_ICIS                      ;        /* Offset = 0x01C */
    uint32_t    S_EIP36T_IMST                      ;        /* Offset = 0x020 */
    uint32_t    S_EIP36T_IRIS                      ;        /* Offset = 0x024 */
    uint32_t    S_EIP36T_IMIS                      ;        /* Offset = 0x028 */
    uint32_t    S_EIP36T_ICIS                      ;        /* Offset = 0x02C */
    uint32_t    S_EIP16T_IMST                      ;        /* Offset = 0x030 */
    uint32_t    S_EIP16T_IRIS                      ;        /* Offset = 0x034 */
    uint32_t    S_EIP16T_IMIS                      ;        /* Offset = 0x038 */
    uint32_t    S_EIP16T_ICIS                      ;        /* Offset = 0x03C */
    uint32_t    RESTRICTED2[112]                   ;        /* Offset = 0x040 */
    uint32_t    S_EIP_CGCFG                        ;        /* Offset = 0x200 */
    uint32_t    S_EIP_CGREQ                        ;        /* Offset = 0x204 */
    uint32_t    RESTRICTED3[126]                   ;        /* Offset = 0x208 */
    uint32_t    S_CRC_CTRL                         ;        /* Offset = 0x400 */
    uint32_t    RESTRICTED4[3]                     ;        /* Offset = 0x404 */
    uint32_t    S_CRC_SEED                         ;        /* Offset = 0x410 */
    uint32_t    S_CRC_DIN                          ;        /* Offset = 0x414 */
    uint32_t    S_CRC_RSLT_PP                      ;        /* Offset = 0x418 */
    uint32_t    RESTRICTED5[253]                   ;        /* Offset = 0x41C */
    uint32_t    P_EIP57T_IMST                      ;        /* Offset = 0x810 */
    uint32_t    P_EIP57T_IRIS                      ;        /* Offset = 0x814 */
    uint32_t    P_EIP57T_IMIS                      ;        /* Offset = 0x818 */
    uint32_t    P_EIP57T_ICIS                      ;        /* Offset = 0x81C */
    uint32_t    P_EIP36T_IMST                      ;        /* Offset = 0x820 */
    uint32_t    P_EIP36T_IRIS                      ;        /* Offset = 0x824 */
    uint32_t    P_EIP36T_IMIS                      ;        /* Offset = 0x828 */
    uint32_t    P_EIP36T_ICIS                      ;        /* Offset = 0x82C */
    uint32_t    P_EIP16T_IMST                      ;        /* Offset = 0x830 */
    uint32_t    P_EIP16T_IRIS                      ;        /* Offset = 0x834 */
    uint32_t    P_EIP16T_IMIS                      ;        /* Offset = 0x838 */
    uint32_t    P_EIP16T_ICIS                      ;        /* Offset = 0x83C */
    uint32_t    RESTRICTED6[112]                   ;        /* Offset = 0x840 */
    uint32_t    P_EIP_CGCFG                        ;        /* Offset = 0xA00 */
    uint32_t    P_EIP_CGREQ                        ;        /* Offset = 0xA04 */
    uint32_t    RESTRICTED7[126]                   ;        /* Offset = 0xA08 */
    uint32_t    P_CRC_CTRL                         ;        /* Offset = 0xC00 */
    uint32_t    RESTRICTED8[3]                     ;        /* Offset = 0xC04 */
    uint32_t    P_CRC_SEED                         ;        /* Offset = 0xC10 */
    uint32_t    P_CRC_DIN                          ;        /* Offset = 0xC14 */
    uint32_t    P_CRC_RSLT_PP                      ;        /* Offset = 0xC18 */
    uint32_t    RESTRICTED9[185]                   ;        /* Offset = 0xC1C */
    uint32_t    P_RAND_KEY0                        ;        /* Offset = 0xF00 */
    uint32_t    P_RAND_KEY1                        ;        /* Offset = 0xF04 */
    uint32_t    P_RAND_KEY2                        ;        /* Offset = 0xF08 */
    uint32_t    P_RAND_KEY3                        ;        /* Offset = 0xF0C */
} DTHERegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_DTHE_H */
/* END OF REG_DTHE_H */

