/**
 *  @file    reg_aes.h
 *
 *  @brief
 *    This file gives register definitions of MSS_AES module.
 *
 *  This file is auto-generated on 11/2/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

/* Definition for field DMA_REQ_DATA_IN_EN in Register P_SYSCONFIG */
#define P_SYSCONFIG_DMA_REQ_DATA_IN_EN_BIT_START            5U
#define P_SYSCONFIG_DMA_REQ_DATA_IN_EN_BIT_END              5U

/* Definition for field DMA_REQ_DATA_OUT_EN in Register P_SYSCONFIG */
#define P_SYSCONFIG_DMA_REQ_DATA_OUT_EN_BIT_START           6U
#define P_SYSCONFIG_DMA_REQ_DATA_OUT_EN_BIT_END             6U

/* Definition for field DMA_REQ_CONTEXT_IN_EN in Register P_SYSCONFIG */
#define P_SYSCONFIG_DMA_REQ_CONTEXT_IN_EN_BIT_START         7U
#define P_SYSCONFIG_DMA_REQ_CONTEXT_IN_EN_BIT_END           7U

/* Definition for field DMA_REQ_CONTEXT_OUT_EN in Register P_SYSCONFIG */
#define P_SYSCONFIG_DMA_REQ_CONTEXT_OUT_EN_BIT_START        8U
#define P_SYSCONFIG_DMA_REQ_CONTEXT_OUT_EN_BIT_END          8U

/* Definition for field MAP_CONTEXT_OUT_ON_DATA_OUT in Register P_SYSCONFIG */
#define P_SYSCONFIG_MAP_CONTEXT_OUT_ON_DATA_OUT_BIT_START   9U
#define P_SYSCONFIG_MAP_CONTEXT_OUT_ON_DATA_OUT_BIT_END     9U

/* Definition for field RESETDONE in Register P_SYSSTATUS */
#define P_SYSSTATUS_RESETDONE_BIT_START                     0U
#define P_SYSSTATUS_RESETDONE_BIT_END                       0U

/* Definition for field CONTEX_IN in Register P_IRQSTATUS */
#define P_IRQSTATUS_CONTEX_IN_BIT_START                     0U
#define P_IRQSTATUS_CONTEX_IN_BIT_END                       0U

/* Definition for field DATA_IN in Register P_IRQSTATUS */
#define P_IRQSTATUS_DATA_IN_BIT_START                       1U
#define P_IRQSTATUS_DATA_IN_BIT_END                         1U

/* Definition for field DATA_OUT in Register P_IRQSTATUS */
#define P_IRQSTATUS_DATA_OUT_BIT_START                      2U
#define P_IRQSTATUS_DATA_OUT_BIT_END                        2U

/* Definition for field CONTEXT_OUT in Register P_IRQSTATUS */
#define P_IRQSTATUS_CONTEXT_OUT_BIT_START                   3U
#define P_IRQSTATUS_CONTEXT_OUT_BIT_END                     3U

/* Definition for field CONTEX_IN in Register P_IRQENABLE */
#define P_IRQENABLE_CONTEX_IN_BIT_START                     0U
#define P_IRQENABLE_CONTEX_IN_BIT_END                       0U

/* Definition for field DATA_IN in Register P_IRQENABLE */
#define P_IRQENABLE_DATA_IN_BIT_START                       1U
#define P_IRQENABLE_DATA_IN_BIT_END                         1U

/* Definition for field DATA_OUT in Register P_IRQENABLE */
#define P_IRQENABLE_DATA_OUT_BIT_START                      2U
#define P_IRQENABLE_DATA_OUT_BIT_END                        2U

/* Definition for field CONTEXT_OUT in Register P_IRQENABLE */
#define P_IRQENABLE_CONTEXT_OUT_BIT_START                   3U
#define P_IRQENABLE_CONTEXT_OUT_BIT_END                     3U



/**
 * @struct AESRegs_t
 * @brief
 *   Module MSS_AES Register Definition
 * @details
 *   This structure is used to access the MSS_AES module registers.
 */
/**
 * @typedef AESRegs
 * @brief
 *   Module MSS_AES Register Frame type Definition
 * @details
 *   This type is used to access the MSS_AES module registers.
 */
typedef volatile struct AESRegs_t{
    uint32_t    S_KEY2_6                           ;        /* Offset = 0x000 */
    uint32_t    S_KEY2_7                           ;        /* Offset = 0x004 */
    uint32_t    S_KEY2_4                           ;        /* Offset = 0x008 */
    uint32_t    S_KEY2_5                           ;        /* Offset = 0x00C */
    uint32_t    S_KEY2_2                           ;        /* Offset = 0x010 */
    uint32_t    S_KEY2_3                           ;        /* Offset = 0x014 */
    uint32_t    S_KEY2_0                           ;        /* Offset = 0x018 */
    uint32_t    S_KEY2_1                           ;        /* Offset = 0x01C */
    uint32_t    S_KEY1_6                           ;        /* Offset = 0x020 */
    uint32_t    S_KEY1_7                           ;        /* Offset = 0x024 */
    uint32_t    S_KEY1_4                           ;        /* Offset = 0x028 */
    uint32_t    S_KEY1_5                           ;        /* Offset = 0x02C */
    uint32_t    S_KEY1_2                           ;        /* Offset = 0x030 */
    uint32_t    S_KEY1_3                           ;        /* Offset = 0x034 */
    uint32_t    S_KEY1_0                           ;        /* Offset = 0x038 */
    uint32_t    S_KEY1_1                           ;        /* Offset = 0x03C */
    uint32_t    S_IV_IN_0                          ;        /* Offset = 0x040 */
    uint32_t    S_IV_IN_1                          ;        /* Offset = 0x044 */
    uint32_t    S_IV_IN_2                          ;        /* Offset = 0x048 */
    uint32_t    S_IV_IN_3                          ;        /* Offset = 0x04C */
    uint32_t    S_CTRL                             ;        /* Offset = 0x050 */
    uint32_t    S_C_LENGTH_0                       ;        /* Offset = 0x054 */
    uint32_t    S_C_LENGTH_1                       ;        /* Offset = 0x058 */
    uint32_t    S_AUTH_LENGTH                      ;        /* Offset = 0x05C */
    uint32_t    S_DATA_IN_0                        ;        /* Offset = 0x060 */
    uint32_t    S_DATA_IN_1                        ;        /* Offset = 0x064 */
    uint32_t    S_DATA_IN_2                        ;        /* Offset = 0x068 */
    uint32_t    S_DATA_IN_3                        ;        /* Offset = 0x06C */
    uint32_t    S_TAG_OUT_0                        ;        /* Offset = 0x070 */
    uint32_t    S_TAG_OUT_1                        ;        /* Offset = 0x074 */
    uint32_t    S_TAG_OUT_2                        ;        /* Offset = 0x078 */
    uint32_t    S_TAG_OUT_3                        ;        /* Offset = 0x07C */
    uint32_t    S_REVISION                         ;        /* Offset = 0x080 */
    uint32_t    S_SYSCONFIG                        ;        /* Offset = 0x084 */
    uint32_t    S_SYSSTATUS                        ;        /* Offset = 0x088 */
    uint32_t    S_IRQSTATUS                        ;        /* Offset = 0x08C */
    uint32_t    S_IRQENABLE                        ;        /* Offset = 0x090 */
    uint32_t    S_DIRTYBITS                        ;        /* Offset = 0x094 */
    uint32_t    S_LOCKDOWN                         ;        /* Offset = 0x098 */
    uint32_t    RESTRICTED1[985]                   ;        /* Offset = 0x09C */
    uint32_t    P_KEY2_6                           ;        /* Offset = 0x1000 */
    uint32_t    P_KEY2_7                           ;        /* Offset = 0x1004 */
    uint32_t    P_KEY2_4                           ;        /* Offset = 0x1008 */
    uint32_t    P_KEY2_5                           ;        /* Offset = 0x100C */
    uint32_t    P_KEY2_2                           ;        /* Offset = 0x1010 */
    uint32_t    P_KEY2_3                           ;        /* Offset = 0x1014 */
    uint32_t    P_KEY2_0                           ;        /* Offset = 0x1018 */
    uint32_t    P_KEY2_1                           ;        /* Offset = 0x101C */
    uint32_t    P_KEY1_6                           ;        /* Offset = 0x1020 */
    uint32_t    P_KEY1_7                           ;        /* Offset = 0x1024 */
    uint32_t    P_KEY1_4                           ;        /* Offset = 0x1028 */
    uint32_t    P_KEY1_5                           ;        /* Offset = 0x102C */
    uint32_t    P_KEY1_2                           ;        /* Offset = 0x1030 */
    uint32_t    P_KEY1_3                           ;        /* Offset = 0x1034 */
    uint32_t    P_KEY1_0                           ;        /* Offset = 0x1038 */
    uint32_t    P_KEY1_1                           ;        /* Offset = 0x103C */
    uint32_t    P_IV_IN_0                          ;        /* Offset = 0x1040 */
    uint32_t    P_IV_IN_1                          ;        /* Offset = 0x1044 */
    uint32_t    P_IV_IN_2                          ;        /* Offset = 0x1048 */
    uint32_t    P_IV_IN_3                          ;        /* Offset = 0x104C */
    uint32_t    P_CTRL                             ;        /* Offset = 0x1050 */
    uint32_t    P_C_LENGTH_0                       ;        /* Offset = 0x1054 */
    uint32_t    P_C_LENGTH_1                       ;        /* Offset = 0x1058 */
    uint32_t    P_AUTH_LENGTH                      ;        /* Offset = 0x105C */
    uint32_t    P_DATA_IN_0                        ;        /* Offset = 0x1060 */
    uint32_t    P_DATA_IN_1                        ;        /* Offset = 0x1064 */
    uint32_t    P_DATA_IN_2                        ;        /* Offset = 0x1068 */
    uint32_t    P_DATA_IN_3                        ;        /* Offset = 0x106C */
    uint32_t    P_TAG_OUT_0                        ;        /* Offset = 0x1070 */
    uint32_t    P_TAG_OUT_1                        ;        /* Offset = 0x1074 */
    uint32_t    P_TAG_OUT_2                        ;        /* Offset = 0x1078 */
    uint32_t    P_TAG_OUT_3                        ;        /* Offset = 0x107C */
    uint32_t    P_REVISION                         ;        /* Offset = 0x1080 */
    uint32_t    P_SYSCONFIG                        ;        /* Offset = 0x1084 */
    uint32_t    P_SYSSTATUS                        ;        /* Offset = 0x1088 */
    uint32_t    P_IRQSTATUS                        ;        /* Offset = 0x108C */
    uint32_t    P_IRQENABLE                        ;        /* Offset = 0x1090 */
} AESRegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_AES_H */
/* END OF REG_AES_H */

